{
  "knowledge/3d-construction-and-building.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday words (construct, spatial reasoning, balance, structure). No physics — no compression, center of gravity, load-bearing, or cantilever concepts. Activity was generic block stacking with no engineering content.",
    "fixed": "Replaced vocabulary with center of gravity, compression, load-bearing, cantilever. Rewrote activity to explain forces during stacking, base-width stability, and cantilever counterbalance. Added triangulation and arch physics for 3-4+."
  },
  "knowledge/academic-subject-exploration.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Meta-lesson about 'enjoying learning' with zero actual academic content; vocabulary section defined only process words",
    "fixed": "Added cardinality, phoneme/phonemic awareness, scientific observation vs. opinion, hypothesis, composition; rewrote station activities to include real disciplinary content"
  },
  "knowledge/acting-and-character-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all everyday words (character, expression, improvise, performance). No theater history, no cognitive science of pretend play, no theory of mind, no mirror neurons, no dramatic arc structure. Activity was \"move like a cat\" with no intellectual content.",
    "fixed": "Replaced vocabulary with theory of mind (cognitive development ages 2-5), mirror neurons (premotor cortex, action-observation coupling), dramatic arc (Aristotle's structure — setup/rising action/resolution), projection (diaphragm-based vocal technique). Rewrote activity to explicitly teach dramatic arc, mirror neuron awareness, and theory of mind during role-play. Added commedia dell'arte, bunraku, and shadow theater for 3-4+."
  },
  "knowledge/adaptation-and-modification-physical-adjustments-creative-improvisation-social-flexibility-learning-strategies.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Process-only lesson with no cognitive science or biological content; vocabulary limited to everyday words",
    "fixed": "Added cognitive flexibility, executive function, neuroplasticity vocabulary; added Key Concepts section covering prefrontal cortex, biological adaptation, improvisation as constrained creativity; updated activity instructions to name brain skills being exercised"
  },
  "knowledge/animal-behaviors-and-types.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No taxonomy, no adaptation/evolution, no endotherm/ectotherm, no vertebrate/invertebrate classification, no metamorphosis. Activity was mimicking animal movements with no biological content. Age adaptation said \"Keep vocabulary to just 'move,' 'animal,' and animal names.\"",
    "fixed": "Replaced vocabulary with taxonomy (Linnaeus 1735, kingdom through species), adaptation (evolved survival features), endotherm/ectotherm (metabolic heat generation), metamorphosis (complete vs. incomplete). Rewrote activity with vertebrate/invertebrate sorting, leg-count classification, adaptation-based movement, and endotherm/ectotherm comparison."
  },
  "knowledge/animal-care-and-rescue-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Pure themed dramatic play. No animal biology, habitat needs, or species-specific knowledge. \"What do animals need?\" asked but never answered with real information.",
    "fixed": "Replaced vocabulary with habitat, veterinarian, herbivore/carnivore/omnivore (with teeth adaptations), thermoregulation (warm-blooded vs cold-blooded). Rewrote activity to classify each animal by diet and thermoregulation. Added species-appropriate habitat building and veterinary diagnosis."
  },
  "knowledge/animation-with-toys-and-objects.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic terms (animate, sequence, motion, narrative). No explanation of HOW animation works — no persistence of vision, no frames per second, no optics. Stop-motion mentioned in extensions but science never explained.",
    "fixed": "Replaced vocabulary with persistence of vision (retinal image retention ~1/25 second), frame rate (fps — 16 fps silent film, 24 fps modern film, 60 fps games), stop-motion animation (object repositioning between photographs), phi phenomenon (Max Wertheimer 1912, brain-constructed motion perception). Rewrote activity to include flip book creation, frame rate experiments, and phone-camera stop-motion. Added zoetrope construction, cel animation history, and CGI comparison for 3-4+."
  },
  "knowledge/architecture-and-building-design.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic everyday words (structure, foundation, balance, architecture). No physics — no compression, tension, forces, center of gravity. Activity was generic block stacking. Age adaptation said \"Use simpler language rather than advanced vocabulary\" — directly contradicting rigor philosophy.",
    "fixed": "Replaced vocabulary with compression (pushing force), tension (pulling force), arch (Roman engineering, keystone), center of gravity (Leaning Tower of Pisa). Rewrote activity with center-of-gravity experiments, compression testing, arch construction, and triangle rigidity demonstrations. Removed anti-vocabulary instruction."
  },
  "knowledge/art-appreciation-and-curation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic art terms (composition, gallery, appreciate, aesthetic). No color theory science, no neuroaesthetics, no formal analysis framework. Activity was \"look at pictures and say what you like.\"",
    "fixed": "Replaced vocabulary with composition (visual path), contrast (light/dark and complementary colors), focal point (visual cortex processing), abstract vs. representational (two fundamental approaches to art). Rewrote activity to teach formal visual analysis and color theory science."
  },
  "knowledge/art-installation-and-display.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "\"Installation\" defined as \"a painting on a wall, blocks in a tower, or drawings on string\" — too broad and missing what installation art actually is as a movement. Vocabulary was all basic descriptors (installation, display, arrange, composition). No art history, no real installation artists, no design principles (contrast, visual weight, focal point, balance).",
    "fixed": "Replaced vocabulary with installation art (1960s-70s movement, Kusama's Infinity Rooms, Christo's The Gates, Turrell's light rooms — art that surrounds the viewer), composition (with contrast, balance, focal point, rhythm as real design principles), visual weight (how elements attract the eye), site-specific (art designed for a particular location). Rewrote introduction to explain installation art history and real artists. Updated wrap-up to teach focal point, balance, and visual weight as children view their finished work."
  },
  "knowledge/attention-and-focus-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All four vocabulary words (focus, attention, concentrate, mindful) were synonyms for the same everyday concept. Zero neuroscience. No explanation of what attention is neurologically or why children's attention spans are shorter.",
    "fixed": "Replaced vocabulary with prefrontal cortex (attention director, matures until age 25), selective attention (spotlight metaphor, signal filtering), executive function (working memory, inhibitory control, cognitive flexibility — stronger predictors of success than IQ), neural pathway (Hebbian learning, myelination). Rewrote activity to practice all three executive functions explicitly. Added cocktail party effect and sustained attention timing for 3-4+."
  },
  "knowledge/baking-and-measuring-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words (measure, combine, texture, transform). No chemistry whatsoever — \"flour and liquid become batter\" with no explanation of what happens. No chemical reactions, gluten, leavening, or states of matter.",
    "fixed": "Replaced vocabulary with chemical reaction (Maillard reaction, denaturation), gluten (glutenin/gliadin protein network), leavening (biological/chemical/mechanical), states of matter (solid/liquid/gas with specific melting/boiling points). Rewrote activity flow to explain gluten formation during mixing, denaturation of egg proteins, and CO2 release from leavening. Added three types of leavening and Maillard reaction for 3-4+."
  },
  "knowledge/balance-and-movement.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Good vocabulary (proprioception, equilibrium) but missing vestibular system, cerebellum, center of gravity; leftover template instruction in vocabulary section; no Key Concepts section",
    "fixed": "Added vestibular system, cerebellum, center of gravity to vocabulary; added Key Concepts section covering three-system balance integration, motor learning, center of gravity physics, inner ear mechanics; updated activity instructions to name systems being used"
  },
  "knowledge/basic-engineering-concepts.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday words (engineer, design, test, improve). No forces — no compression, tension, triangulation, or material properties. Activity was generic building with no engineering physics content.",
    "fixed": "Replaced vocabulary with compression and tension (two fundamental forces), triangulation (inherent rigidity), load distribution, material properties (rigidity vs. flexibility). Rewrote activity to test structural physics concepts hands-on."
  },
  "knowledge/basic-web-design-concepts.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Good generic design vocabulary but missing core web concepts: no HTML, CSS, browser, hyperlink, UX; no explanation of how websites actually work technically",
    "fixed": "Added HTML, CSS, browser, hyperlink, UX, wireframe vocabulary; added Key Concepts section covering server/browser model, HTML/CSS separation of concerns, history of the web (Berners-Lee), UX as a profession, and the principle that good design is invisible; updated introduction to reference real technical concepts"
  },
  "knowledge/beauty-and-aesthetics.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic terms (aesthetic, texture, pattern, balance). No color theory, no golden ratio, no neuroscience. Activity was touching objects and saying \"pretty\" with no scientific content.",
    "fixed": "Replaced vocabulary with symmetry (bilateral, fusiform face area, evolutionary signal of healthy development), golden ratio (1:1.618, phi, Parthenon, nautilus shells), complementary colors (opposing cone cell stimulation, red/green, blue/orange), neuroaesthetics (medial orbito-frontal cortex activation, measurable brain response to beauty). Rewrote activity with symmetry testing, complementary color experiments, and fractal identification. Added Fibonacci sequence, wabi-sabi vs. Greek aesthetics, and fractal art for 3-4+."
  },
  "knowledge/board-games-and-puzzles.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic everyday words (strategy, pattern, persistence, rule). No cognitive science, no probability for dice, no spatial reasoning, no working memory. Activity was basic play with no intellectual content.",
    "fixed": "Replaced vocabulary with probability (1-in-6 die face, 36 combinations for two dice), spatial reasoning (parietal lobe, mental rotation), working memory (prefrontal cortex, 2-3 items for children vs. 7 for adults), algorithm (systematic problem-solving strategy). Rewrote activity to track dice probability, use sorting algorithms for puzzles, and identify cognitive processes during play."
  },
  "knowledge/board-games-and-strategy-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Recommends Candy Land/Chutes and Ladders as 'strategy games' without noting they are pure chance; missing probability, game theory, chance vs. strategy distinction, ancient history of board games, executive function research",
    "fixed": "Added probability, game theory, decision tree vocabulary; added Key Concepts covering chance vs. strategy distinction, ancient board games (Senet, Go, Chess), probability and gambler's fallacy, game theory history (von Neumann), executive function skills; updated activity to explicitly teach the chance/strategy distinction and introduce Tic-Tac-Toe as a true strategy game"
  },
  "knowledge/body-awareness-and-coordination.md": {
    "verdict": "PASS",
    "issues": "Uses \"proprioception,\" \"gross motor skills,\" \"neural pathways.\" Genuinely educational.",
    "fixed": "N/A"
  },
  "knowledge/book-and-media-collection.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary (organize, collection, curate, archive) was introduced but never deployed meaningfully — activity was just sorting books by color or \"silly vs. animals.\" No library science, no Dewey Decimal System, no metadata, no history of libraries or archives.",
    "fixed": "Replaced vocabulary with catalog, archive, classification (Dewey Decimal), metadata. Rewrote activity to teach real library science: reading book metadata (title/author/subject), building a classification system by subject, writing a simple catalog, and explaining what the Internet Archive does. Connected to Alexandria Library and digital search indexing."
  },
  "knowledge/brain-and-nervous-system.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "For a lesson ABOUT the nervous system, never named a single neuron, synapse, axon, or dendrite. \"Signal\" was vague with no mention of electrical impulses or neurotransmitters. No brain anatomy (lobes, cortex). \"Brain is the boss of your body\" with no science.",
    "fixed": "Replaced vocabulary with neuron (86 billion, 270 mph signals, axon/dendrite), synapse (100 trillion, neurotransmitter chemicals — dopamine, serotonin), reflex arc (spinal cord shortcut, 50ms patellar reflex), cerebral cortex (gyri/sulci, occipital/temporal/frontal lobes). Rewrote activity with receptor density experiments, cochlear hair cells, olfactory-limbic connection, and motor cortex mapping."
  },
  "knowledge/broadcasting-and-announcement-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary basic (broadcaster, audience, announcement, voice). No vocal anatomy, no sound wave physics, no radio/broadcast technology. Activity was pretend announcements with no science.",
    "fixed": "Replaced vocabulary with articulation (tongue/lips/teeth/jaw), projection (diaphragm-based technique), sound wave (compression/rarefaction in air at 343 m/s), broadcast (electromagnetic wave technology). Rewrote activity with vocal anatomy exploration and sound wave experiments."
  },
  "knowledge/bug-hunting-and-magnifying-glass-observation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic everyday words (observe, magnify, insect, habitat). No entomology — no exoskeleton, no metamorphosis, no compound eye science, no arthropod classification. Activity was \"look at the shiny wings!\" with no scientific content.",
    "fixed": "Replaced vocabulary with exoskeleton (chitin, molting), arthropod (jointed foot, 1M+ known species), compound eye (ommatidia, dragonfly 30,000 per eye), metamorphosis (complete vs. incomplete, body dissolves in pupa). Rewrote activity to classify by leg count (6=insect, 8=arachnid), explain chemoreceptor antennae, and narrate exoskeleton physics. Added ecological roles and taxonomy for 3-4+."
  },
  "knowledge/building-a-blanket-fort.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words (structure, drape, stability, shelter). Mentioned \"architects\" once but never explained any engineering or physics. No forces, no structural principles, no explanation of why things fall or stand.",
    "fixed": "Replaced vocabulary with load-bearing (structural support), tension (pulling force in blanket), compression (pushing force in chair legs), center of gravity (balance point, why wide bases are stable — pyramids). Rewrote activity to explain forces at each building step. Added thermal insulation and sound absorption for indoor discovery. Added triangular trusses, cantilevers, load testing, and Gothic buttresses for 3-4+."
  },
  "knowledge/building-and-construction.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Lesson was essentially \"play with blocks\" with no engineering or physics. Vocabulary lacked gravity, compression, center of gravity, load, arch. No real structural experiments — just free stacking with cheerful prompts. Real-world connections were superficial (\"buildings have foundations like your blocks\").",
    "fixed": "Replaced vocabulary with gravity, compression, load, center of gravity, arch, engineer, foundation (with real definitions). Rewrote activity as three structured physics experiments: wide vs. narrow base (demonstrating center of gravity), compression (bottom block works hardest), and arch (Roman invention, 2,000-year-old aqueducts still standing). Added engineering thinking framework (\"you're the engineer — test your hypothesis\"). Updated coaching cues with physics language throughout."
  },
  "knowledge/building-and-infrastructure-repair-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "knowledge/building-with-blocks-and-materials.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Missing physics/engineering. No gravity, center of mass, load distribution, or why shapes matter structurally. Just stacking blocks with vocabulary overlay.",
    "fixed": "Replaced vocabulary with center of gravity, compression, load, structural engineer. Rewrote activity to include gravity demonstrations, base-width experiments, triangle-vs-square strength test, and heavy-on-bottom stability concept. Added tension and load testing for 3-4+."
  },
  "knowledge/business-creation-and-entrepreneurship-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary correct but lesson contained no real economics content — no profit, no cost, no supply/demand, no value. Activity was purely themed dramatic play with no explanation of why prices exist or how businesses actually work.",
    "fixed": "Added profit, cost, value, supply-and-demand vocabulary. Updated Discovery phase to explicitly introduce cost vs. selling price, profit calculation, and supply/demand scenarios. Updated 3-4+ age adaptation to include profit thinking and supply/demand exploration."
  },
  "knowledge/buying-and-selling.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday words (transaction, customer, merchant, currency). No economics — no supply/demand, no scarcity, no medium of exchange, no explanation of why money was invented (the barter problem). Activity was pure roleplay with \"give money, get thing.\"",
    "fixed": "Replaced vocabulary with supply and demand, medium of exchange (double coincidence of wants problem), scarcity, profit. Rewrote activity to start with barter failure, introduce money as solution, run scarcity experiments (price rises as items sell out), and calculate profit. Added competition, opportunity cost, inflation experiment, and money history (cowrie shells, salt, Lydian coins 600 BCE) for 3-4+."
  },
  "knowledge/calendar-and-schedule-making.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words (sequence, schedule, calendar, routine). No astronomy — no explanation of why we have days (Earth's rotation), months (Moon's orbit), or years (Earth's orbit). Purely procedural sticker activity.",
    "fixed": "Replaced vocabulary with rotation (Earth spinning, 24 hours = 1 day), orbit (Earth around Sun, 365.25 days = 1 year, leap year), lunar cycle (Moon phases, 29.5 days, word \"month\" from \"moon\"), circadian rhythm (suprachiasmatic nucleus, melatonin, 20,000 neurons). Rewrote activity to teach astronomical basis of calendars. Added seasons (axial tilt), Moon phase tracking, and cross-cultural calendar systems for 3-4+."
  },
  "knowledge/card-games-and-simple-gambling-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Said \"That's luck!\" about dice rolls with zero explanation of probability. No mathematical content despite being a math-adjacent topic.",
    "fixed": "Added probability to vocabulary with proper explanation (1-in-6 chance per die face). Updated activity dialogue to explain probability, randomness, and how memory changes your odds. Added distinction between games of skill vs. games of chance."
  },
  "knowledge/caregiving-and-nurturing-physical-care-creative-projects-social-relationships-learning-mentorship.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday emotional words (nurture, empathy, caregiver, compassion). No developmental psychology, no neuroscience of bonding. Why mammals care for young never explained (evolutionary biology). No attachment theory, no oxytocin, no mirror neurons. Activity was themed play with no intellectual content.",
    "fixed": "Replaced vocabulary with attachment (Bowlby), oxytocin (bonding hormone), mirror neurons (neural basis of empathy), nurture (with nature vs. nurture framing), responsive caregiving, empathy (cognitive vs. affective). Rewrote activity introduction to explain why mammals care for young (helpless offspring require extended care), what oxytocin does, and how mirror neurons underlie learning and empathy. Added plant biology context to the plant care option."
  },
  "knowledge/caregiving-for-dolls-stuffed-animals.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was \"nurture, gentleness, empathy, compassion\" — all everyday words. No developmental psychology, no neuroscience of bonding. Pure roleplay with no intellectual payload.",
    "fixed": "Replaced vocabulary with oxytocin (bonding hormone, released during caregiving), attachment (Bowlby's attachment theory, secure attachment), mirror neurons (fire during both action and observation), theory of mind (attributing mental states to others, develops ages 2-5). Rewrote activity to explain oxytocin release during caregiving, mirror neuron learning, and attachment science. Added altricial vs. precocial species comparison for 3-4+."
  },
  "knowledge/cause-and-effect-physical-causation-social-consequences-logical-reasoning.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Station descriptions described what happens without ever explaining WHY. Push → car moves, but no mention of force as the mechanism. Drop → falls, but gravity never named as the cause. Domino chain reaction described but energy transfer absent. Missing variables as a concept.",
    "fixed": "Added force, energy transfer, variable, and predict to vocabulary. Rewrote each station to explain the mechanism: Station 1 — force as cause of movement, direction changes with different force angles. Station 2 — gravity explicitly named as the cause of falling (with Galileo reference). Station 3 — energy transfer from finger to first domino traveling down the chain; gap-in-chain test added. Added controlled experiment extension (Variation 3) teaching one-variable-at-a-time principle."
  },
  "knowledge/cell-basic-unit-of-life.md": {
    "verdict": "MINOR FIX",
    "issues": "Core content was solid — real organelle names (nucleus, mitochondria, ribosomes, cytoplasm) deployed throughout the activity. But vocabulary section had only generic terms (cell, living, organism, microscope) while actual organelle vocabulary was only in the activity body with brief descriptions. Missing single-celled organisms and cell division.",
    "fixed": "Replaced vocabulary section with nucleus, mitochondria, cell membrane, and organism (expanded to include single-celled organisms — bacteria). Added mention of single-celled organisms (bacteria as complete one-celled life) during discovery. Added cell division / mitosis to follow-up activities."
  },
  "knowledge/change-and-adaptation-physical-changes-human-development-evolution-learning.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Evolution is in topic title but never mentioned; missing natural selection, metamorphosis, germination, phototropism, biological vs. behavioral adaptation distinction; template instruction left in vocabulary section",
    "fixed": "Added evolution, natural selection, metamorphosis, germination, phototropism, biological adaptation vocabulary; added Key Concepts covering Darwin/natural selection, metamorphosis biology (imaginal discs), seed dormancy and germination, human developmental biology, two types of adaptation; updated activity instructions to use real biological terms"
  },
  "knowledge/chemical-elements-and-reactions.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday words (transform, react, experiment, observe). No chemistry — no molecules, atoms, acids, bases, or exothermic reactions. Activity was mixing things with no molecular-level explanation.",
    "fixed": "Replaced vocabulary with molecule (H2O), acid/base (pH scale), exothermic reaction (energy release), indicator (color change signaling chemical properties). Rewrote activity with real acid-base chemistry, CO2 gas production, and pH testing."
  },
  "knowledge/choreography-and-dance-creation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic (choreography, movement, rhythm, expression). No dance technique terminology — no locomotor/non-locomotor, canon, dynamics, or proprioception. Activity was free movement with no choreographic structure.",
    "fixed": "Replaced vocabulary with choreography (notation systems), locomotor/non-locomotor movement, dynamics (force qualities — sustained/percussive/vibratory), canon (sequential performance of same phrase). Rewrote activity to teach real choreographic composition principles."
  },
  "knowledge/circus-movements-and-performance.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all everyday words (acrobat, balance, perform, flexibility). No physics of balance, angular momentum, proprioception, or parabolic arcs. No circus history. Generic movement play with no science.",
    "fixed": "Replaced vocabulary with center of gravity (balance physics), angular momentum (conservation — tuck tighter = spin faster), proprioception (muscle spindles, Golgi tendon organs, cerebellum), circus history (Philip Astley 1768, 42-foot ring diameter from centripetal force physics). Rewrote activity with angular momentum demonstrations, tightrope center-of-gravity experiments, and juggling parabolic arc science."
  },
  "knowledge/cities-and-rural-areas.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Surface-level urban/rural comparison; no population density, infrastructure, or interdependence; activity was purely observational diorama play",
    "fixed": "Added population density, infrastructure, suburb, interdependence vocabulary; added 'Why Cities Form' section explaining agglomeration and river/coast origins; enriched discovery questions to trace food supply chains and urban-rural interdependence"
  },
  "knowledge/class-and-school-simulation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words (simulate, routine, role, participate). No pedagogy, no cognitive science, no explanation of why schools exist or how learning works. Activity was pure roleplay of school behaviors with zero intellectual content.",
    "fixed": "Replaced vocabulary with pedagogy (Greek etymology), curriculum (Latin etymology, scaffolded sequencing), socialization (group norms as coordination solutions), metacognition (prefrontal cortex, self-monitoring). Rewrote activity to teach curriculum design, assessment, retrieval practice (testing effect), and socialization as real concepts. Added Socrates and Socratic method to 3-4+ adaptations."
  },
  "knowledge/clean-vs.-polluted-environments.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was almost entirely everyday (\"clean,\" \"polluted,\" \"environment,\" \"contaminate\"). Pollution treated as just \"trash and dirt\" — no chemical pollution, no invisible toxins, no microplastics. Missing bioaccumulation and biomagnification — how tiny amounts of toxins concentrate up the food chain to dangerous levels. Activity (comparing a clean vs. dirty jar) teaches what everyone already knows.",
    "fixed": "Replaced vocabulary with pollution (invisible types — mercury, lead, microplastics, CO₂), ecosystem, bioaccumulation, biomagnification (with zooplankton→fish→eagle mercury concentration chain), contaminate. Rewrote introduction to explain that invisible pollution is more dangerous than visible pollution. Added biomagnification pebble-counting game to activity. Updated age adaptations with 3-4+ multiplying pebbles exercise and ecological cascade thinking."
  },
  "knowledge/cleaning-and-organizing-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words (organize, sort, categories, tidy). No classification science, no entropy, no cognitive science. Activity was putting toys in bins with no intellectual content.",
    "fixed": "Replaced vocabulary with taxonomy (hierarchical classification), entropy (second law of thermodynamics — disorder increases without energy input), spatial memory (hippocampus mental maps), classification (multi-attribute sorting). Rewrote activity to build taxonomy, demonstrate entropy, practice re-classification by different attributes, and connect to biological taxonomy. Added Venn diagrams and Dewey Decimal System for 3-4+."
  },
  "knowledge/climate-zones.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic (climate, temperature, zone, observe). Never explained WHY climate zones exist — no latitude, no equator, no sun angle physics, no biome concept. \"Tropical is hot, polar is cold\" stated with no mechanism.",
    "fixed": "Replaced vocabulary with latitude (degrees from equator, controls sun angle = climate), equator (0° latitude, most direct sunlight), biome (natural communities shaped by climate, tropical rainforest = 6% surface but 50%+ species), altitude (6.5°C drop per 1000m, Kilimanjaro snow near equator). Rewrote activity with sun-angle physics explanation using globe and flashlight."
  },
  "knowledge/club-and-organization-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary everyday (club, member, meeting, interest). No governance, democratic process, or civic structure concepts. Activity was pretend club with no organizational science.",
    "fixed": "Replaced vocabulary with charter (organizational founding document), bylaws (operating rules), consensus (democratic decision-making), agenda (structured meeting plan). Rewrote activity to teach real governance structures used in institutions worldwide."
  },
  "knowledge/collaboration-and-cooperation-physical-teamwork-creative-partnerships-social-community-learning-groups.md": {
    "verdict": "PASS",
    "issues": "Exceptional — vocabulary cites Adam Smith's division of labor (1776) with actual pin-factory statistics; Norman Triplett's 1898 social facilitation research with brain chemistry (dopamine, norepinephrine); theory of mind with developmental timeline and chimpanzee comparison; free rider problem in 3-4+ adaptation",
    "fixed": "N/A"
  },
  "knowledge/collection-and-curation-physical-objects-creative-works-social-memories-learning-resources.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Pure process lesson — gather, sort, display — with no intellectual content; no taxonomy, classification science, provenance, or why classification matters",
    "fixed": "Added taxonomy, provenance, catalog, classify vocabulary; added 'Why Humans Classify' section covering Linnaeus, Dewey Decimal System, natural history; enriched activity to try multiple classification systems and discuss what each reveals; added curator/geologist framing"
  },
  "knowledge/collection-display-and-presentation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Mostly themed play — arranging objects prettily with no intellectual payload. No museum science (curatorship), no taxonomy/classification science, no visual design principles (symmetry, asymmetry, focal point, contrast). Age adaptation said \"Keep language simple: 'big' or 'small' instead of 'symmetrical'\" — directly against the philosophy.",
    "fixed": "Replaced vocabulary with curator (museum role), taxonomy (classification by shared characteristics, Linnaeus), symmetry (bilateral symmetry, with asymmetry as contrast), aesthetic (with design principles: contrast, repetition, focal point). Rewrote introduction framing the child as a curator. Renamed sorting section to connect to taxonomy explicitly. Updated arrangement section to introduce design vocabulary (symmetrical, asymmetrical, focal point) naturally during activity. Updated 2-3 age adaptation to remove anti-vocabulary guidance and replace with use-the-words-with-explanations instruction."
  },
  "knowledge/communication-across-forms-language-visual-symbols-music-body-language-information.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Stayed at surface level (wave, point, draw, talk) with no linguistics, semiotics, or writing systems; no distinction between sign language and gestures; no animal communication examples",
    "fixed": "Added semiotics, encode/decode, sign language, writing systems vocabulary; added animal communication section (bee waggle dance, dolphin signature whistles, crows); enriched discovery to practice encoding/decoding and introduced concept of missing code; added ASL, hieroglyphs for older children"
  },
  "knowledge/communication-and-expression-physical-gestures-creative-arts-social-conversation-learning-sharing.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday words (\"express,\" \"gesture,\" \"communicate,\" \"create\") with no linguistics. No verbal vs. nonverbal distinction, no symbol concept, no paralanguage, no cultural variation in gestures, no sign language as a complete language. Activities were playing with mirrors and drawing.",
    "fixed": "Replaced vocabulary with verbal communication, nonverbal communication, symbol, paralanguage, gesture (with cultural variation and universal facial expressions). Rewrote activity to include silent communication challenge, ASL signs (practically useful for toddlers), and symbolic drawing. Updated age adaptations to include body language vs. words mismatch and cultural gesture variation."
  },
  "knowledge/community-and-helpers.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All everyday vocabulary (community, helper, responsibility, cooperate). No sociology, economics, or real knowledge about what professionals do. Pure dress-up roleplay with no intellectual payload.",
    "fixed": "Replaced vocabulary with division of labor (Adam Smith 1776, pin factory example), specialization (years of training per profession), infrastructure (Latin etymology, invisible systems — pipes, wires, sewers), interdependence (removing any role affects all others). Rewrote activity to teach real specialist knowledge for each helper, demonstrate interdependence, and identify infrastructure."
  },
  "knowledge/community-garden-and-clean-up-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Plant biology was entirely surface-level: \"seeds need soil, water, and sunlight to grow\" with no mechanism. No germination, no radish/radicle, no decomposition, no soil ecology. Compost was in the vocabulary but never actually used in the activity.",
    "fixed": "Replaced vocabulary with germination (embryo waking up, radicle as first root), decomposition (bacteria/fungi/earthworms breaking organic matter to nutrients), compost (decomposition you can hold), cultivate (refined), stewardship (refined). Rewrote introduction to explain the seed embryo and endosperm (lunchbox for a baby plant). Updated discovery section with radicle, gravitropism (\"why roots go down, shoots go up\"), and earthworms as decomposers with nutrient cycling."
  },
  "knowledge/community-organization-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All four vocabulary words (cooperate, community, role, organization) were everyday synonyms with no social science. No game theory, no sociology, no developmental psychology. Activity was passing a ball with behavioral prompts and zero intellectual content.",
    "fixed": "Replaced all vocabulary with: collective action (what groups can do that individuals can't, civilizational examples), social contract (Rousseau 1762, games as miniature civic rehearsal), reciprocity (vampire bat research, tit-for-tat mathematical superiority), division of labor (Adam Smith pin factory — 1 vs. 48,000 pins/day). Updated introduction to frame games as collective action and social contract. Updated discovery questions to include free rider problem, reciprocity recognition, and role function analysis."
  },
  "knowledge/computers-and-machines.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Placeholder text left in vocabulary section (\"Select 3-4 vocabulary words...\"). Vocabulary was vague (technology = \"things people made\"); no mention of simple machines (lever, gear, wheel and axle), circuits, input/output, or processor. Activity was just touching toys with no explanation of how any machine actually works.",
    "fixed": "Removed placeholder. Replaced vocabulary with simple machine, gear, circuit, input/output, processor, mechanism — all with real definitions. Rewrote activity to explain gears interlocking, springs storing energy, circuits as complete loops, and computers processing input to produce output. Updated age adaptations to include hands-on circuit demos and simple machine scavenger hunt."
  },
  "knowledge/conflict-and-resolution.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary (\"problem,\" \"compromise,\" \"solution,\" \"cooperate\") were all everyday words. Compromise defined inaccurately as \"splitting the difference.\" No emotional regulation science, no amygdala, no \"I\" statements, no interests vs. positions (core negotiation insight). Activity was basic puppet conflict with no intellectual content.",
    "fixed": "Replaced vocabulary with conflict, emotional regulation (amygdala, fight-or-flight), \"I\" statements, interests vs. positions, empathy. Rewrote activity introduction to explain amygdala alarm system and why calming is a physiological requirement before problem-solving. Rewrote scenario 2 to contrast \"you\" vs. \"I\" statements and demonstrate interests vs. positions via orange example."
  },
  "knowledge/conflict-resolution-role-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "\"Empathy\" was real terminology but rest was everyday (peaceful, compromise, communicate). No psychology of conflict, no neuroscience of anger, no negotiation theory. Activity was \"use your words\" behavioral scripts.",
    "fixed": "Replaced vocabulary with amygdala (alarm system, fight-or-flight), prefrontal cortex (impulse control, development timeline to age 25), negotiation (3-step structured process), perspective-taking (theory of mind connection). Rewrote activity to explain amygdala hijack, teach formal negotiation steps, and practice perspective-taking as cognitive exercise. Added win-win vs. win-lose framework for 3-4+."
  },
  "knowledge/conservation-and-recycling.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary everyday (conserve, recycle, environment, sort). No material science — no polymers, biodegradation, or natural resource extraction. Activity was sorting into bins with no science behind why.",
    "fixed": "Replaced vocabulary with decomposition (microbial breakdown, 450-year plastic timeline), polymer (long molecular chains), biodegradable vs. non-biodegradable, natural resource (extraction and finite supply). Rewrote activity with material science investigation and decomposition timeline comparison."
  },
  "knowledge/construction-and-deconstruction-physical-building-creative-making-social-structures-learning-concepts.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No engineering science — missing center of gravity, compression/tension, arch mechanics, foundation; when things fell it was treated as emotional event not physics to analyze",
    "fixed": "Added center of gravity, compression, tension, arch, foundation vocabulary; added 'Why Buildings Stand' section covering Roman arches, steel frames, pyramid stability, Burj Khalifa; enriched discovery to name the physics in each observation; treats structural failure as engineering data"
  },
  "knowledge/conversation-and-dialogue-practice.md": {
    "verdict": "PASS",
    "issues": "Vocabulary (dialogue, turn-taking, active listening, reciprocity) IS real communication science and developmental psychology terminology. Activity genuinely teaches communication skills through practice — the skill itself is the content.",
    "fixed": "N/A"
  },
  "knowledge/cooking-and-recipe-following.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words (ingredients, measure, sequence, texture). Zero food science — purely procedural \"mix, stir, taste\" with no explanation of what happens chemically when ingredients combine. No mention of chemical reactions, dissolving, emulsification, or protein denaturation.",
    "fixed": "Replaced vocabulary with chemical reaction, emulsification, dissolve, protein (with denaturation). Rewrote activity flow to explain dissolving, oil-water immiscibility, oxidation (banana browning), acid-base reactions (baking soda), and physical vs. chemical changes. Added Maillard reaction, leavening, pH, and melting points to 3-4+ adaptations."
  },
  "knowledge/cooperating-and-sharing.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary entirely everyday words (cooperate, share, teammate, patience). No social science, no game theory, no developmental psychology. Activity was block building with turn-taking prompts.",
    "fixed": "Replaced vocabulary with theory of mind, collective action, reciprocal altruism, fairness (with capuchin monkey experiments). Rewrote activity to compare solo vs. group building (demonstrating collective action). Added free rider problem, negotiation, and animal cooperation examples for 3-4+."
  },
  "knowledge/counting-and-numbers.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday (quantity, sequence, numerals, correspond). Missing key mathematical principles — no cardinality, one-to-one correspondence, subitizing, or conservation of number. Activity was counting objects with no mathematical framework.",
    "fixed": "Replaced vocabulary with cardinality (last number = total), one-to-one correspondence, subitizing (instant quantity recognition), conservation of number (arrangement doesn't change quantity). Rewrote activity to explicitly teach each mathematical principle."
  },
  "knowledge/countries-and-continents.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary included \"discover\" (non-geographic, non-technical). Missing the continent/country distinction (geographic vs. political), no hemispheres, no equator explaining climate, no borders as human decisions. Activity was pure \"point at globe\" with no deeper geographic reasoning.",
    "fixed": "Replaced vocabulary with continent, country (with explicit continent/country distinction via pizza analogy), equator (climate explanation), hemisphere, border (as human decision), latitude (climate predictor). Rewrote activity to explain the geographic vs. political distinction, equator effect on climate, one real fact about each continent (Africa 54 countries, Australia = single country, Antarctica = no countries), and borders as human inventions. Added continental drift as extension activity."
  },
  "knowledge/creating-a-nature-display-from-a-walk.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Purely aesthetic — collecting and arranging pretty things with no natural science; no botany, geology, ecology, or scientific observation",
    "fixed": "Added specimen, veins/midrib, abscission, erosion, decomposer vocabulary; added 'What Your Walk Items Are Actually Telling You' section covering erosion history of rocks, leaf vascular anatomy, moss moisture requirements, pine cone mechanics; enriched walk with naturalist-style questioning for each item type"
  },
  "knowledge/creative-problem-solving-challenges.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Activity-only lesson — no real cognitive science terminology (divergent thinking, hypothesis, constraint, design cycle)",
    "fixed": "Added hypothesis, constraint, divergent thinking to vocabulary; added engineering design cycle framing and constraint-based challenge prompts to activity flow"
  },
  "knowledge/creative-problem-solving.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was \"solution,\" \"obstacle,\" \"persist,\" \"transform\" — no cognitive science. Activity was retrieving stuck toys with no systematic thinking framework. No scientific method, no distinction between divergent and convergent thinking.",
    "fixed": "Replaced vocabulary with hypothesis, divergent thinking, constraint, iteration. Rewrote activity to use the scientific method explicitly: form hypothesis → test → analyze → iterate. Added divergent vs. convergent thinking exercise, constraints as creativity drivers, and algorithm concept for 3-4+."
  },
  "knowledge/creative-storytelling-and-narrative.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "knowledge/critical-thinking-and-questioning.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary defined \"question\" as \"a sentence that asks for information\" (teaching nothing) and \"reason\" as \"think carefully\" (too vague). Missing the core critical thinking apparatus: observation vs. inference distinction, hypothesis, evidence, cause and effect, bias. Activity was mystery box play with no intellectual framework — just vague wondering.",
    "fixed": "Replaced vocabulary entirely with observation (direct sensory facts), inference (conclusion from evidence), hypothesis (testable educated guess), evidence, cause and effect, and bias (tendency distorting reasoning). Rewrote activity overview to explain the scientific method framework (observe → infer → hypothesize → test → revise). Updated exploration to explicitly teach the observation/inference distinction at every step. Updated discovery phase to introduce disconfirming evidence (\"what would tell us we were wrong?\") and bias identification. Updated wrap-up to name the process rather than praising children. Updated 3-4+ to require formal hypothesis format (prediction + reason) and introduce the scientific practice of writing hypotheses before testing."
  },
  "knowledge/critical-thinking-puzzles.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary used only everyday words: \"solve,\" \"puzzle,\" \"pattern,\" \"persist\" — no cognitive science. No mention of executive function, prefrontal cortex, working memory, inhibitory control, cognitive flexibility, or divergent vs. convergent thinking. Template placeholder comment not removed.",
    "fixed": "Rewrote vocabulary section with: executive function (working memory, inhibitory control, cognitive flexibility), prefrontal cortex (mid-20s maturation), hypothesis (testable prediction), spatial reasoning (parietal lobe), pattern recognition (visual cortex + prefrontal cortex), trial and error (empirical testing). Updated coaching cues to narrate the cognitive process; added metacognition to 3-4+ adaptations."
  },
  "knowledge/cultural-craft-and-art-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary everyday (texture, craft, tradition, create). No material science, no loom/weaving mechanics, no pigment chemistry, no kiln chemistry. Activity was generic crafting with cultural labels.",
    "fixed": "Replaced vocabulary with loom (warp/weft, 10,000-year history), pigment (mineral/plant sources, light absorption), kiln (chemical transformation at 1,000°C+), motif (repeating design elements with cultural meaning). Rewrote activity with real textile, pigment, and ceramic science."
  },
  "knowledge/cultural-cuisine-exploration.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary everyday (culture, tradition, flavor, taste). No food science — no staple crops, fermentation, five basic tastes, or spice botany. Activity was tasting foods with no scientific content.",
    "fixed": "Replaced vocabulary with staple crop (climate-adapted agriculture), fermentation (microbial transformation), umami (Ikeda 1908, glutamate receptor), spice (specific plant parts — bark, seed, root, fruit). Rewrote activity with taste science experiments and food geography."
  },
  "knowledge/cultural-dance-and-music.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "knowledge/cultural-diversity-and-inclusion.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was entirely everyday words (culture, celebrate, tradition, diverse). No cultural anthropology, no migration, no trade routes, no geographic isolation as mechanism for cultural divergence. Activity was \"touch the fabric and say what color it is\" with no intellectual content. The 2-3 age adaptation said \"Avoid complex explanations about geography or culture.\"",
    "fixed": "Replaced vocabulary with migration, geographic isolation, oral tradition, trade route, syncretism, linguistic family. Rewrote activity to explain HOW cultures diverged (geographic isolation) and how they spread (trade routes, migration). Added real food history (tomatoes from Mexico, rice from China), Silk Road, jazz as syncretism example. Updated 2-3 adaptation to remove anti-knowledge instruction."
  },
  "knowledge/cultural-exploration-through-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Entirely generic—'cultures are different' framing with no anthropological content; no explanation of why cultures differ",
    "fixed": "Added anthropology, cultural diffusion, indigenous, oral tradition vocabulary; added geography/climate explanations for why food/music/material culture differs; discovery questions now connect observations to historical and environmental causes"
  },
  "knowledge/customer-service-role-play.md": {
    "verdict": "PASS",
    "issues": "Already uses real economic vocabulary (transaction, commerce, shopkeeper) with substantive definitions; activity genuinely teaches commercial exchange rather than just themed play",
    "fixed": "N/A"
  },
  "knowledge/dance-and-movement-expression.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic everyday terms (rhythm, expression, balance, choreography). No music science, no anatomy, no neuroscience. Activity was \"move to music\" with no explanation of why humans respond to rhythm.",
    "fixed": "Replaced vocabulary with tempo (beats per minute, auditory cortex), entrainment (automatic synchronization to rhythm, unique to humans and a few species), dynamics (pianissimo to fortissimo, Italian musical terms), vestibular system (semicircular canals, fluid mechanics of dizziness). Rewrote activity to explore tempo differences, dynamics, vestibular response to spinning. Added meter (4/4 vs 3/4 time), spotting technique, muscle group naming, and evolutionary purpose of dance for 3-4+."
  },
  "knowledge/dance-and-movement.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No physiology or neuroscience content; vocabulary limited to generic terms with no real scientific depth",
    "fixed": "Added proprioception, vestibular system, tempo to vocabulary; added cerebellum's role in movement to activity overview; added tempo naming to phase 3 of activity"
  },
  "knowledge/data-and-statistics.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary everyday (collect, organize, compare, pattern). No statistics terminology — no variable, frequency, bar graph, or data set concepts. Activity was sorting with no statistical framework.",
    "fixed": "Replaced vocabulary with data (datum/data set), variable (measurable property), frequency (count of occurrences), bar graph (visual representation of frequency by category). Rewrote activity to teach real statistical data collection and visualization."
  },
  "knowledge/day-and-night-cycles.md": {
    "verdict": "PASS",
    "issues": "Vocabulary uses genuinely scientific terms (rotation, nocturnal, celestial, illumination) with proper explanations. Activity explains Earth's rotation creating day/night using globe + flashlight demonstration. Content accurately teaches the science.",
    "fixed": "N/A"
  },
  "knowledge/debate-and-discussion-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary everyday (opinion, discuss, agree, disagree). No rhetoric — no claim, evidence, counterargument, or logical reasoning. Activity was sharing preferences with no argumentation framework.",
    "fixed": "Replaced vocabulary with claim (position statement), evidence (supporting reasons), counterargument (opposing position), rhetoric (Aristotle's art of persuasion). Rewrote activity to teach structured argumentation with claim-evidence-reasoning framework."
  },
  "knowledge/decision-making-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary everyday (autonomy, choice, consequence, decide). No decision science — no criteria, trade-offs, opportunity cost, or prediction. Activity was choosing between options with no analytical framework.",
    "fixed": "Replaced vocabulary with criteria (evaluation rules), trade-off (gaining one thing by giving up another), opportunity cost (what you forgo), prediction (expected outcome). Rewrote activity to teach structured decision analysis used in economics and engineering."
  },
  "knowledge/deep-reading.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Good structure overall, but missing key concepts: inference (never named despite activities requiring it), visual narrative (illustrations as independent story layer), and the scientific terms inference and subtext. Vocabulary was decent but non-specific (attentive, illustrate, curious, pattern).",
    "fixed": "Rewrote summary to frame deep reading around inference, visual narrative, and two simultaneous stories (words vs. illustrations). Replaced vocabulary with inference (reading between the lines, the core deep reading skill), visual narrative (illustrator's separate story), subtext (unstated meaning), pattern (more specific definition). Updated first reading section to prompt both text reading and visual narrative reading, name inference when children use it, and introduce subtext via color/composition choices."
  },
  "knowledge/different-cultures-and-peoples.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Purely activity-based with generic vocabulary (culture, tradition, community, diversity); no anthropological concepts or real content about how cultures work",
    "fixed": "Added anthropology, oral tradition, cultural diffusion to vocabulary; added ~7000 cultures statistic and cultural diffusion framing to activity overview; added cultural diffusion example (tomatoes in Italian food) to activity flow"
  },
  "knowledge/different-environments-forest-desert-ocean-mountains.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Factual error (polar bears in mountains instead of Arctic); missing biome/climate as organizing concepts; adaptation definition incomplete",
    "fixed": "Fixed polar bear error (now correctly references Arctic); added biome and climate to vocabulary; corrected cactus anatomy (stem not leaves); added climate science to activity overview with explicit biome/climate/adaptation framing"
  },
  "knowledge/different-languages-around-the-world.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No linguistics vocabulary; all vocabulary terms are everyday words; no content about phonemes, language families, writing systems, or tonal languages",
    "fixed": "Added phoneme, tonal language, language family to vocabulary; added ~7000 languages fact and language family/phoneme/tonal language content to activity overview; added note about related vs unrelated language families during discovery phase"
  },
  "knowledge/digital-art-and-drawing.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all basic (digital, palette, compose, illustrate). \"Digital\" defined as \"uses electricity.\" No pixel science, no touchscreen physics, no RGB color model. Activity was finger-painting on a screen with no technology explanation.",
    "fixed": "Replaced vocabulary with pixel (picture element, millions per screen), RGB (additive color mixing — red+green=yellow, unlike paint), capacitive touchscreen (electrical field detection, why gloves don't work), resolution (width × height pixel count). Rewrote activity to explain pixel construction, test capacitive sensing with gloves, and compare additive vs. subtractive color mixing."
  },
  "knowledge/digital-communication-practice.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Entirely about the social/emotional experience of video calls (waving to grandma); vocabulary was generic (digital literacy, facilitate, interaction, connection); no content about how digital communication actually works",
    "fixed": "Replaced vocabulary with pixel, network, Wi-Fi, data packet, compression, latency — all with real technical explanations; rewrote introduction to explain camera → pixel → compression → Wi-Fi → packet transmission; added real answers to \"how does the camera see us?\" in 3-4+ age adaptation"
  },
  "knowledge/digital-music-and-sound-creation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "knowledge/digital-organization-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words; no technical content about file systems, algorithms, or databases",
    "fixed": "Added file/folder/directory/metadata/algorithm/database vocabulary; explained how sorting algorithms and databases underpin digital organization; updated activity narration to reference real computing concepts"
  },
  "knowledge/disaster-relief-for-toys-dolls.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All 4 vocabulary words (rescue, comfort, nurture, restore) were everyday words. No disaster management, no triage science, no humanitarian aid concepts, no logistics. Pure empathy-themed dramatic play with no real knowledge content.",
    "fixed": "Replaced vocabulary with triage (French origin, color-coded urgency system), humanitarian aid (Red Cross, UNICEF, MSF), infrastructure (roads, water, electricity — first priority in disaster relief), basic needs hierarchy (Maslow 1943, physiological → safety → social), logistics (moving supplies to where needed). Rewrote activity framing around real disaster relief operations."
  },
  "knowledge/documentary-creation-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No real filmmaking content; vocabulary was generic; activity was just 'take pictures and arrange them' with no teaching about what makes documentary a distinct medium",
    "fixed": "Added framing/composition/editing/narration/subject vocabulary; explained how documentaries differ from fiction; introduced real filmmaking techniques (close-up vs. wide shot, editing decisions); connected to real-world documentary tradition"
  },
  "knowledge/drawing-sketching-and-scribbling.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary entirely everyday (scribble, sketch, mark-making, expression). No color science, no neuroscience of motor control, no art technique. Activity was \"draw whatever you want\" with no intellectual content.",
    "fixed": "Replaced vocabulary with pigment (light absorption/reflection), motor cortex (34 hand muscles, neural pathways), primary colors (subtractive color mixing), line weight. Rewrote activity to include pressure/pigment experiments, primary color mixing, and tool science (graphite, wax, liquid ink). Added color wheel, complementary colors, perspective, and cross-hatching for 3-4+."
  },
  "knowledge/ecosystems-and-habitats.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Activity reduced ecosystem to habitat-matching game; no food webs, energy flow, producers/consumers/decomposers, or real interdependence content",
    "fixed": "Added food web, producer, consumer, decomposer vocabulary; discovery questions now teach energy flow from sun through food chain; age adaptations include building food chains with toy animals and learning about decomposers"
  },
  "knowledge/electronics-and-simple-circuits.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Good foundation with real components; missing electrons as the actual carrier, battery as chemical-to-electrical energy conversion, insulator as contrast to conductor, and LED anode/cathode explanation",
    "fixed": "Added electron definition; explained battery as chemical energy conversion; added insulator vocabulary; named LED legs as anode/cathode; incorporated all these into activity narration"
  },
  "knowledge/emergency-preparedness-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Pure \"helpers are nice\" lesson with no fire science, no 911 mechanism, no triage, no evacuation route science, no fire triangle. Vocabulary was basic everyday terms. Activity was pure themed play — no real knowledge content. The 2-3 age adaptation said \"tell a grown-up\" with zero additional content.",
    "fixed": "Replaced vocabulary with combustion (fire triangle), 911 dispatch system, evacuation route, triage, preparedness. Rewrote activity to teach fire triangle, smoke detectors (particle detection), thermal convection (why smoke rises = why we crawl), evacuation drill with scientific framing, emergency kit with explanations of why each item is needed. Added 911 practice with dispatcher system explanation."
  },
  "knowledge/emotional-support-and-comfort-giving.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "knowledge/emotions-and-feelings.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was \"emotion,\" \"express,\" \"recognize,\" \"calm\" — no neuroscience. No brain anatomy, no explanation of what produces emotions physiologically. Activity was labeling paper plate faces with no scientific content.",
    "fixed": "Replaced vocabulary with limbic system (amygdala, hippocampus), neurotransmitter (dopamine, serotonin, cortisol), facial muscles (zygomatic major, corrugator supercilii, FACS), mirror neurons. Rewrote activity to include facial muscle exploration, mirror neuron experiments, neurotransmitter identification per emotion, and evolutionary purpose of emotions."
  },
  "knowledge/energy-and-movement-physical-energy-body-movement-social-dynamics.md": {
    "verdict": "PASS",
    "issues": "Outstanding — vocabulary defines energy with joules unit; kinetic/potential/chemical energy with correct physics; force cites Newton; momentum distinguishes from energy correctly; activity traces food→muscle→kinetic energy chain; ramp experiment teaches potential-to-kinetic conversion; friction converting energy to heat; Newton's second law by name",
    "fixed": "N/A"
  },
  "knowledge/environmental-care-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No real ecological science; vocabulary was affective (stewardship, responsibility) not scientific; activity was purely procedural with no explanation of why these care actions matter ecologically",
    "fixed": "Added ecosystem/photosynthesis/decomposition/food-web/habitat vocabulary; explained why watering feeds photosynthesis, why litter harms ecosystems (no decomposition), why birds matter to food webs; wove ecological concepts into activity narration"
  },
  "knowledge/equipment-care-and-maintenance.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Entirely procedural; vocabulary was everyday words; no science behind why maintenance works (paint chemistry, surfactants, oxidation/rust, bristle materials)",
    "fixed": "Added pigment/binder/surfactant/oxidation/bristles vocabulary; explained how water-soluble binders enable washing, how soap surfactants work, why metal must be dried to prevent rust; wove these concepts into activity narration"
  },
  "knowledge/escape-room-and-mystery-solving.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Only everyday vocabulary (mystery, clue, puzzle, solve); activities were themed hide-and-seek with no real cognitive science content; no mention of deductive reasoning, hypothesis formation, evidence, or logical inference",
    "fixed": "Added real reasoning vocabulary (deduction, hypothesis, evidence, eliminate, sequence, observation); rewrote activity flow to model and name detective reasoning processes; added elimination tracking and conditional logic for older children; updated summary to name the cognitive skills being developed"
  },
  "knowledge/evaluating-information.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Wrong frame — used \"real vs. pretend\" as a proxy for evaluating information. Never taught claims, evidence, sources, bias, or how to reason from evidence. No critical thinking framework. Vocabulary was basic (observe, compare, question, real).",
    "fixed": "Replaced vocabulary with claim, evidence, source, bias, experiment, logical fallacy. Rewrote entire activity around claim-testing: state a claim, make a prediction, test it physically, observe results, compare. Added \"source check game\" with made-up scenario cards teaching source reliability, bias, and the difference between an anecdote and data. Updated age adaptations with concrete application of all vocabulary."
  },
  "knowledge/event-planning-and-coordination.md": {
    "verdict": "PASS",
    "issues": "Uses real organizational vocabulary: coordinate, sequence, collaborate, delegate; activities teach genuine planning and logistics skills; connects to real-world event management processes",
    "fixed": "N/A"
  },
  "knowledge/exploration-and-investigation-physical-world-discovery-creative-materials-social-interactions-learning-environments.md": {
    "verdict": "PASS",
    "issues": "Already uses real scientific vocabulary (hypothesis, variable, empirical, property) with etymology; explicitly teaches scientific method throughout; activity prompts real scientific reasoning with every material interaction",
    "fixed": "N/A"
  },
  "knowledge/fact-checking-and-verification-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "knowledge/family-and-relationships.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All everyday vocabulary (relationship, family, sibling, caregiver). No developmental psychology, no anthropology, no attachment theory. Activity was a photo collage with no intellectual content.",
    "fixed": "Replaced vocabulary with attachment (Bowlby 1950s, secure base theory), kinship (anthropological study, cross-cultural variation), oxytocin (bonding hormone released during physical contact), genealogy (generational doubling — 1,000+ ancestors in 10 generations). Rewrote activity to trace genealogical generations, explore cross-cultural kinship systems, and explain attachment science."
  },
  "knowledge/family-gathering-simulation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "\"Dramatic play\" (meta-term defining the lesson type) and \"Gathering\" (everyday word) in vocabulary. No developmental psychology about symbolic play, no anthropology, no oxytocin. Activity had no intellectual content beyond social script practice.",
    "fixed": "Replaced \"Gathering\" with ritual (universal human behavior, oxytocin/endorphin release, anthropological definition). Replaced \"Dramatic play\" with theory of mind (ages 2-5 development, false belief task, what pretend play trains neurologically). Enhanced hospitality with evolutionary/anthropological context. Enhanced tradition with cultural transmission framing. Rewrote guided social play to include ritual framing and theory of mind prompting questions."
  },
  "knowledge/family-history-and-genealogy-exploration.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Missing science of heredity (DNA, genetic inheritance), genealogy as a research discipline with methodology (primary sources, census records, DNA testing), historical context for family migration",
    "fixed": "Added DNA/genetic inheritance, primary source concept, genealogy as investigative discipline; expanded vocabulary with DNA, genetic inheritance, primary source, oral history; activity overview reframed around real genealogical methods"
  },
  "knowledge/family-interaction-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday (\"interaction,\" \"connection,\" \"reciprocal,\" \"engagement\"). Peek-a-boo mentioned but its developmental significance (object permanence — Piaget's foundational milestone) completely missed. No serve-and-return science, no attachment theory, no imitation/mirror neuron framing.",
    "fixed": "Replaced vocabulary with serve and return (Harvard Center on the Developing Child, neural circuit building), object permanence (Piaget, why peek-a-boo matters), attachment (Bowlby/Ainsworth, secure base theory), imitation (mirror neuron system). Updated age adaptations to explain developmental significance of each game type, including false belief in hide-and-seek."
  },
  "knowledge/farming-and-food-production.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Missing photosynthesis — the central mechanism of plant growth; mentioned sunlight without explaining why plants need it; no mention of chlorophyll, seed anatomy (embryo/cotyledon), or soil nutrients",
    "fixed": "Added photosynthesis, chlorophyll, nutrient, and embryo/cotyledon to vocabulary; rewrote summary to frame farming as management of photosynthesis at scale; integrated these concepts into activity flow"
  },
  "knowledge/fashion-and-clothing.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No textile science. Vocabulary was \"texture, garment, drape, adornment.\" No fibers, weaving, thermal insulation, or material science. \"This jacket is waterproof\" stated with no explanation of how waterproofing works.",
    "fixed": "Replaced vocabulary with fiber (natural vs. synthetic — cotton, wool, silk, polyester, nylon), thermal insulation (trapped air pockets, wool crimping, down feathers), weaving (warp/weft on loom vs. knitting), dye (chemical bonding, historical pigments — indigo, Tyrian purple). Rewrote activity with water absorption tests, fiber type sorting, and weaving demonstrations. Added silk production, dye experiments, and fabric engineering for 3-4+."
  },
  "knowledge/filing-and-record-keeping-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic organizational terms without deeper concepts; activities treated filing as purely mechanical sorting with no insight that categories are human constructs or that classification is a fundamental cognitive/scientific skill; missing real-world classification systems",
    "fixed": "Added classification, attribute vocabulary; rewrote summary to frame filing as the cognitive skill of classification used in biology, libraries, and science; introduced the key insight that the same item can be classified multiple ways; added sub-categories and historical reclassification example to older age adaptation"
  },
  "knowledge/finding-your-way-around.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Just walking through a living room obstacle course. No real navigation, cartography, or geography content. Vocabulary was everyday words only.",
    "fixed": "Added cardinal directions and map/cartography to vocabulary. Added content about the sun rising in the East, Earth as a giant magnet (compass), maps as bird's-eye representations, and scale. Updated age adaptations and follow-up activities."
  },
  "knowledge/fine-and-gross-motor-skills.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary used only everyday words: \"coordinate,\" \"balance,\" \"strength,\" \"control\" — no anatomy, neuroscience, or physiology. Template placeholder comment still present. Activity descriptions were generic movement play with no scientific content. Muscle names absent throughout.",
    "fixed": "Rewrote vocabulary section with: motor cortex (homunculus map, 120 m/s signals), cerebellum (50% of brain neurons, error-correction), myelination (100x signal speed, gross before fine motor), proprioception, fine motor vs. gross motor (specific muscle names: quadriceps/hamstrings/gluteus maximus/deltoids for gross; lumbricals/interossei/thenar muscles for fine), neuromuscular junction (acetylcholine, motor unit precision). Updated all activity stations with muscle names and physiology."
  },
  "knowledge/fire-and-combustion.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Activity narration said \"the very tip is the hottest part\" (incorrect — blue base is hottest). No explanation of combustion zones, carbon particle incandescence, or combustion products.",
    "fixed": "Fixed flame zone science: blue base = hottest (~1,400°C, complete combustion), yellow-orange = carbon particle incandescence (incomplete combustion), invisible upper gases = CO₂ and water vapor products. Added \"ignition temperature\" to narration."
  },
  "knowledge/fire-safety-and-prevention-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Safety rules taught without scientific explanation. \"Don't run during a fire\" without explaining why running fans flames. No fire triangle, no combustion chemistry, no thermal convection (why smoke rises), no stop/drop/roll physics, no carbon monoxide concept. Vocabulary was basic (prevention, hazard, alert, escape).",
    "fixed": "Replaced vocabulary with combustion (fire triangle), thermal convection (hot air rises, why we crawl), carbon monoxide (most fire deaths are smoke/CO, not burns), stop/drop/roll (removes oxygen from flames), flash point, prevention. Rewrote activity to explain the fire triangle first, then derive each safety rule from it scientifically. Added \"which side of the fire triangle?\" analysis game. Updated age adaptations to include vocabulary for 2-3 year olds."
  },
  "knowledge/first-aid-and-medical-response-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary had stethoscope and vital signs but never explained what a heartbeat IS (heart valve sounds), what vital signs actually measure (specific numbers, physiological meaning), or what fever really means (immune response mechanism). \"Compassion\" occupied a vocabulary slot with no medical content.",
    "fixed": "Replaced vocabulary with: stethoscope (diaphragm amplifies vibrations, lub-dub = heart valve sounds, S1/S2, murmurs), vital signs (all four defined with normal ranges for toddlers — temperature 37°C, heart rate 80-130 bpm, breathing rate 20-30/min, blood pressure), diagnose (symptoms vs. signs, differential diagnosis), immune system (white blood cells, B cells, antibodies, how vaccines work), triage (French etymology, urgency sorting). Rewrote introduction to explain lub-dub sounds with hands-on stethoscope exploration. Updated 3-4+ adaptations with triage, fever physiology, and vaccine/immunity framing."
  },
  "knowledge/fix-it-activities-and-repair-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Mentioned \"mechanism\" but never explained how any mechanism works. Activities were about the motion of unscrewing, not understanding what's inside.",
    "fixed": "Added real mechanical explanations: screws as inclined planes (threads), springs as energy storage, gears as motion transfer. Added \"diagnose\" to vocabulary. Updated activity flow to include real explanations during exploration. Added mechanical advantage concept to 3-4+ adaptations."
  },
  "knowledge/folklore-and-myths.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary included \"enchanted\" (not scholarly). No anthropology — no oral tradition, no etiological myth concept, no archetypes, no cultural transmission science. Treated myths as \"magical stories\" with no literary theory or cross-cultural analysis.",
    "fixed": "Replaced vocabulary with oral tradition (Aboriginal Australian stories verified for 7,000 years), etiological myth (pre-scientific explanations, Greek/Norse/Maori examples), archetype (Joseph Campbell's monomyth/hero's journey), cultural transmission (universal human behavior). Rewrote activity to create etiological myths following hero's journey structure with cross-cultural comparison."
  },
  "knowledge/food-chains-and-relationships.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Had good basic vocabulary (herbivore, carnivore, predator, prey) but missing major concepts. No energy transfer, no decomposers, no producer/consumer framework.",
    "fixed": "Added producer, decomposer, and energy transfer to vocabulary with full explanations (10% energy rule). Updated discovery section with decomposer cycle and energy pyramid concept. Enhanced 3-4+ adaptations with food webs, phytoplankton, and full vocabulary list."
  },
  "knowledge/food-photography-and-documentation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic art terms (composition, texture, frame, documentation). No optics, no light physics, no camera technology, no color science. Activity was \"point and click\" with aesthetic appreciation but no science.",
    "fixed": "Replaced vocabulary with lens (refraction, Ibn al-Haytham 1000 CE), pixel (picture element, 12 megapixels = 12 million light sensors), exposure (aperture/shutter speed/ISO, \"photography\" = Greek \"writing with light\"), color temperature (kelvin scale, 2700K warm vs. 5500K sunlight vs. 7000K cloudy). Rewrote activity with lens optics, pixel explanation, and exposure demonstration."
  },
  "knowledge/food-preparation-and-cooking.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all everyday (ingredients, simmer, transform, texture). No food chemistry — \"combining ingredients\" with no explanation of chemical reactions, dissolving, oxidation, or emulsification.",
    "fixed": "Replaced vocabulary with chemical reaction (denaturation, Maillard reaction, permanent change), dissolve (solute/solvent/solution, kinetic energy), oxidation (polyphenol oxidase, melanin, antioxidants), emulsification (lecithin, hydrophilic/hydrophobic). Rewrote activity to include apple browning experiment, dissolving demonstrations, and chemical vs. physical change identification."
  },
  "knowledge/food-preservation-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday words (preserved, texture, sorted, stored). Never explained WHY preservation methods work — no biochemistry of bacterial growth, no water activity, no fermentation science.",
    "fixed": "Replaced vocabulary with dehydration (80% water in grape vs. 15% in raisin, bacteria need water), fermentation (bacteria eat sugar, produce acid — yogurt, pickles, kimchi), osmosis (water movement through membranes, salt/sugar draw water out), microorganism (bacteria, yeast, mold — 1 billion per teaspoon of soil). Rewrote activity with grape-vs-raisin demonstration and osmosis salt experiment."
  },
  "knowledge/food-styling-and-presentation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary used only vague aesthetic/everyday words (presentation, palette, aesthetic, arrangement) with no scientific content. Activities were pure themed play with no food science — no pigments, phytonutrients, color chemistry, or oxidation. \"Eat the rainbow\" mentioned with no explanation of why.",
    "fixed": "Replaced vocabulary with pigment (light absorption/reflection), anthocyanins (blue/red/purple, antioxidants), carotenoids (orange/yellow, beta-carotene → vitamin A), chlorophyll (green, photosynthesis), phytonutrients (why \"eat the rainbow\" is real science), contrast and complementary colors, oxidation (browning, citric acid inhibition), texture (plant cell wall structure). Rewrote activity to teach pigment science; added oxidation experiment (apple + lemon juice)."
  },
  "knowledge/forces-and-motion.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary section had the template instruction visible (\"Select 3-4 vocabulary words...\") — indicating incomplete generation. Vocabulary was basic (force as \"push/pull,\" momentum, friction) without Newton's laws, inertia, acceleration, or mass. Activity had no actual physics framework.",
    "fixed": "Replaced vocabulary with Newton's First Law (inertia), Second Law (F=ma), Third Law (action-reaction), gravity (9.8 m/s²), momentum (mass × velocity), friction (kinetic energy → heat), and mass (kg). Rewrote activity framing around real Newtonian physics with age-appropriate narration."
  },
  "knowledge/foreign-language-conversation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary defined \"linguistic\" vaguely and was missing \"phoneme.\" Activity was process-only (\"repeat after me,\" \"sing songs\") with no intellectual content about WHY languages differ, what makes foreign sounds hard, or the cognitive science of bilingualism. No language families, no 7,000 languages fact, no phoneme concept, no neural/executive function benefits of multilingualism.",
    "fixed": "Replaced vocabulary with phoneme (smallest sound unit), language family (Latin roots, Romance languages), iteration, predictability. Added phoneme, articulation as mouth muscle training, language family context, cognitive diversity research, and bilingualism's executive function benefits. Rewrote introduction to include the ~7,000 languages fact and language family origins. Added phoneme training framing in Sound Play. Updated multi-language comparison to use concrete water/water examples across six languages. Updated 3-4+ to explain geographic divergence of language (island species analogy)."
  },
  "knowledge/friendship-games-and-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Missing key developmental psychology concepts: stages of play development, theory of mind, reciprocity; activities framed as generic fun without naming the social-cognitive skills being developed",
    "fixed": "Added theory of mind, reciprocity vocabulary; rewrote summary to explain stages of play development and why theory of mind is central to friendship; added developmental framing to age adaptations with guidance on making others' internal states visible and practicing perspective-taking explicitly"
  },
  "knowledge/game-creation-and-rule-making.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Reasonable social/creative focus but missed opportunities to connect to formal concepts. Rules were treated as informal, not as logical structures.",
    "fixed": "Added conditional logic framing (if-then rules) and fairness/game theory to vocabulary. Updated rule-making phase to explicitly teach if-then structure and rule conflicts. Connected to computer programming and law as parallel systems. Added game theory framing to social negotiation."
  },
  "knowledge/government-and-leadership.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Title says government but lesson had zero civics content — generic taking-turns leadership activity with no democracy, voting, laws, or government structures.",
    "fixed": "Added government, democracy, law, vote, citizen vocabulary with real definitions; restructured activity to practice actual democratic voting and elected leadership; added monarchy vs democracy comparison extension; integrated political science framing throughout"
  },
  "knowledge/group-meetings-and-discussions.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Democracy never mentioned despite being a lesson in democratic deliberation. Vocabulary was basic (participate, facilitate, contribute, perspective) with no political philosophy, decision science, or cognitive diversity research. Activities were entirely socio-emotional (feelings, kindness) with no intellectual content about HOW and WHY group decisions work.",
    "fixed": "Replaced vocabulary with deliberation, consensus (vs. majority vote), democracy (with 500 BCE Athens origin), agenda, and cognitive diversity (diverse groups make fewer mistakes). Rewrote activity overview with 7,000+ year history of human councils and cognitive diversity argument for inclusive deliberation. Rewrote introduction step to explain what a meeting is for (democratic decision-making) and why circle seating signals equality. Updated discovery phase to explicitly teach deliberation, teach the consensus vs. vote distinction, and connect to real governance. Updated 3-4+ with direct \"democracy\" vocabulary and geographic isolation explanation for why perspectives differ."
  },
  "knowledge/health-and-nutrition.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic (nourish, nutrient, consume, energy). Vague health claims (\"red helps hearts\") with no biochemistry. No vitamins, macronutrients, digestion, or metabolism.",
    "fixed": "Replaced vocabulary with macronutrient (carbohydrates/proteins/lipids with specific functions), vitamin (beta-carotene → vitamin A, ascorbic acid/vitamin C), digestion (mouth amylase → stomach HCl and pepsin → 6m small intestine absorption), metabolism (cellular chemical reactions, caloric energy conversion). Rewrote activity to explain specific biochemistry of each food's color and nutrient content."
  },
  "knowledge/heat-and-cold.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Pure sensory play — touching warm and cold objects with no physics. Vocabulary included \"sensation\" instead of physics terms. No thermal energy, conduction, conductivity, or phase changes. No explanation of why metal feels colder than wood at the same temperature, why heat always flows hot→cold, or what a phase change is.",
    "fixed": "Replaced vocabulary with thermal energy (molecular kinetic energy), temperature (average molecular speed), conduction, thermal conductivity (why metal ≠ wood despite same temperature), phase change. Wrote three targeted physics experiments: conductivity comparison (metal vs. wood at same room temperature — same temp, different feel), heat-flow direction (hand loses heat to ice, not ice chilling hand), and phase change (ice melting as energy breaking crystal structure, why melting ice stays 0°C)."
  },
  "knowledge/helping-others-and-volunteer-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Pure dress-up play as community helpers. No sociology, no economics of community organization, no real knowledge about what specialists actually know or why communities exist.",
    "fixed": "Replaced vocabulary with altruism (kin selection, reciprocal altruism), division of labor, interdependence, civic duty. Rewrote activity to build an interdependent community where removing one role affects all others. Added public goods concept and historical context for 3-4+."
  },
  "knowledge/heritage-exploration-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No anthropological framework: missing cultural transmission, why humans universally develop traditions, oral traditions, material culture, anthropology as a field",
    "fixed": "Added anthropology, cultural transmission, oral tradition, material culture, artifact as primary source; rewrote activity overview to frame exploration as anthropological fieldwork; vocabulary expanded with 3 new terms"
  },
  "knowledge/historical-investigation-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No actual archaeological content — pure sensory play with historical framing. No stratigraphy, material history, preservation, or real archaeological method.",
    "fixed": "Added stratigraphy, preservation (why stone/clay survive), material timeline (Stone Age→Bronze→Iron), real archaeological vocabulary; updated activity prompts to include real content"
  },
  "knowledge/historical-preservation-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Titled 'Historical Preservation Games' but contained zero historical content — purely a lesson about handling toys gently. No conservation science, archival methods, or explanation of why preservation matters.",
    "fixed": "Rewrote entirely: added conservation science (acid deterioration, humidity, UV light, oxidation/rust), real vocabulary (conservation, archive, humidity, acid-free, museum conservator, deteriorate), hands-on activities demonstrating real preservation threats, age-adapted content"
  },
  "knowledge/hobbies-and-collections.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was \"collection, hobby, organize, treasure\" — all everyday words. No taxonomy, classification science, or psychology of collecting. Activity was picking things up and sorting by color with no intellectual content.",
    "fixed": "Replaced vocabulary with taxonomy (Linnaeus 1735 hierarchical classification), specimen (with provenance), classification (sorting by attributes, Darwin's finch beaks), curation (museum practice — selection, organization, presentation, labeling). Rewrote activity as a scientist-collector exercise with specimen labeling, multi-level taxonomy, and museum exhibit curation. Added rock types (igneous/sedimentary/metamorphic), famous collectors (Darwin, Mary Anning), and field guide use for 3-4+."
  },
  "knowledge/hobby-group-participation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Almost entirely logistical — how to find/register for groups. No content about why group learning works, what different activities develop cognitively, or the psychology of motivation and skill acquisition.",
    "fixed": "Added intrinsic motivation, community of practice (Lave & Wenger), peer modeling, zone of proximal development (Vygotsky), mastery motivation; added what each activity type specifically develops (music→auditory/rhythm, sports→proprioception, art→spatial reasoning); integrated concepts into activity flow"
  },
  "knowledge/holiday-celebrations-and-traditions.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Entirely generic — \"people celebrate differently\" with zero examples, no anthropology, no calendar astronomy, no ritual science. Vocabulary was basic everyday words (tradition, celebrate, ritual, diversity).",
    "fixed": "Replaced vocabulary with: ritual (prehistoric origin 300,000+ years, function of marking time and reinforcing community bonds), calendar (astronomical basis — solstice, equinox, lunar cycle), tradition (cultural transmission across generations). Added detailed examples of 6 specific holiday traditions with real origins: Diwali, Hanukkah, Eid al-Fitr, Lunar New Year, Día de los Muertos, Midsommar. Updated introduction and 3-4+ adaptations with cultural origins."
  },
  "knowledge/home-decoration-and-design.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary entirely everyday (design, decorate, arrange, cozy). No design principles, no color theory, no spatial concepts. Activity was gluing magazine cutouts on poster board.",
    "fixed": "Replaced vocabulary with symmetry (and asymmetry), complementary colors, proportion (golden ratio), ergonomics. Rewrote activity to use color wheel, symmetry placement experiments, and proportion testing. Added environmental psychology (colors affecting heart rate/mood), negative space, and mood-based room design for 3-4+."
  },
  "knowledge/home-maintenance-simulation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Activity was pure pretend-play with no content — generic vocabulary (maintain, organize, responsible, simulate), no explanation of why things get dirty, how cleaning works, or what tools do mechanically",
    "fixed": "Replaced vocabulary with entropy, dust (composition), surfactant (soap molecule mechanism), abrasion, corrosion, torque; rewrote introduction to explain entropy and how cleaning works; added real mechanisms to guided tasks (friction, surfactants, torque); upgraded age adaptations to use real terms naturally"
  },
  "knowledge/household-tasks-and-organization.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All everyday vocabulary (sort, organize, responsibility, tidy). No classification science, no cognitive science, no physics. Activity was sorting items into baskets with no intellectual content.",
    "fixed": "Replaced vocabulary with taxonomy (Linnaeus 1735 hierarchical classification), entropy (Second Law of Thermodynamics — disorder increases without energy input), spatial memory (hippocampus mental maps, London taxi driver research), algorithm (step-by-step cleanup procedure). Rewrote activity to build taxonomy hierarchies, demonstrate entropy, and practice reclassification by different attributes."
  },
  "knowledge/how-language-develops.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words (communicate, sound, gesture, expression). No neuroscience despite the topic being about the brain — no Broca's/Wernicke's areas, no phoneme science, no critical period, no language acquisition device. Activity was generic \"make sounds and gestures\" play.",
    "fixed": "Replaced vocabulary with phoneme (44 English sounds, infant specialization by age 1), babbling (motor practice for phoneme production), Broca's area (speech production, left frontal lobe), Wernicke's area (comprehension, left temporal lobe), syntax (word order rules, acquired without explicit instruction), semantics (word meaning, fast mapping 5-10 words/day), critical period (0-7 years), gesture (protodeclarative pointing as theory of mind milestone), language acquisition device (Chomsky, universal grammar). Rewrote activity to connect child's experience to brain neuroscience."
  },
  "knowledge/how-languages-are-structured.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Missing key linguistics concepts: morpheme (smallest unit of meaning vs. phoneme as sound unit), overgeneralization (evidence of grammar rule learning rather than imitation), syntax differences across languages. Extension for multi-language comparison didn't explain why word order differs.",
    "fixed": "Rewrote summary with overgeneralization as the key evidence that children learn grammar rules (not imitate), and the universal features of all 7,000+ human languages (all have nouns and verbs, word order varies enormously). Replaced vocabulary with morpheme (meaning unit), syntax (word order rules, named after language type), overgeneralization (real examples: goed/mouses as rule-following not mistakes), and expanded grammar definition. Added morpheme exploration and word-order comparison (English SVO vs. Japanese SOV) to discovery section. Updated multi-language extension with actual syntax comparison across Japanese/Spanish/English."
  },
  "knowledge/how-societies-develop.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Song section contained all AI draft/scratch work (syllable counting deliberation) never cleaned up. Vocabulary too generic. Activity lacked real content about HOW societies develop (agriculture, division of labor, specialization, surplus, governance).",
    "fixed": "Removed song draft artifacts; added society, division of labor, specialization, agriculture, surplus, governance vocabulary; rewrote activity to trace societal development from nomadic hunters through agriculture to specialized towns; added trade, power dynamics, governance origins"
  },
  "knowledge/how-things-work.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Had some real terms (mechanism, lever) but missed the key physics framework. No \"force,\" \"energy,\" \"simple machine\" (as a classification), or \"mechanical advantage.\" Missing the conceptual spine of physics.",
    "fixed": "Replaced vocabulary with simple machine (6 types, Archimedes), force (push/pull, measured in newtons), mechanical advantage (less force = more distance), energy (kinetic/potential/thermal/elastic, conservation law). Rewrote age adaptations with all six simple machines hunt, mechanical advantage demonstration, and Rube Goldberg energy conversion chains."
  },
  "knowledge/human-body-and-functions.md": {
    "verdict": "PASS",
    "issues": "Already rigorous. Vocabulary includes hemoglobin (270M molecules per RBC, iron makes blood red), diaphragm (negative pressure mechanism, 20,000 breaths/day), cardiac muscle (intercalated discs, 100,000 beats/day), organ (78 organs, organ systems). Activity names femur, cranium, vertebrae, biceps/triceps antagonist pairs, quadriceps, gastrocnemius, deltoids. 3-4+ section covers four heart chambers, digestive system (peristalsis, HCl, villi), neurons at 120 m/s.",
    "fixed": "N/A"
  },
  "knowledge/human-impact-on-nature.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Purely behavioral (pick up trash, water plants) with no ecology. No explanation of HOW pollution harms nature — no food chains, no ecosystem interconnection, no biodiversity concept, no microplastics, no habitat destruction.",
    "fixed": "Replaced vocabulary with: ecosystem (interconnected living community, bee/flower/fruit/animal web example), biodiversity (variety as resilience, rainforest vs. monoculture), habitat destruction (primary cause of extinction — losing home, food, and neighbors simultaneously), pollution types (plastic 400-1,000 year decomposition, microplastics in fish, fossil fuels CO₂, fertilizer runoff). Rewrote introduction with microplastics and ecosystem framing. Updated discovery questions with food chain cause-and-effect. Updated 3-4+ with biodiversity resilience explanation."
  },
  "knowledge/imaginative-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All four vocabulary words (imagine, transform, pretend, scenario) were everyday words. No cognitive science of pretend play whatsoever — no theory of mind, no executive function, no explanation of what the brain does during imagination.",
    "fixed": "Replaced vocabulary with symbolic representation (cognitive foundation of language and math), theory of mind (understanding others' mental states, Bandura), executive function (working memory, cognitive flexibility, inhibitory control — prefrontal cortex), counterfactual thinking (foundation of scientific reasoning and engineering). Rewrote activity to explicitly identify each cognitive process during play."
  },
  "knowledge/imitation-and-modeling-physical-movements-creative-expression-social-behaviors-practical-skills.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No brain science: missing mirror neurons, observational learning, motor cortex/memory — activities with no intellectual framing for why imitation is fundamental to human development",
    "fixed": "Added mirror neurons, motor cortex, observational learning, motor memory vocabulary; added neurological context to activity overview and follow-up notes; humans as uniquely skilled imitators from birth"
  },
  "knowledge/information-gathering-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was decent (observe, investigate, clue, pattern) but no scientific method framework. No distinction between observation and inference. No hypothesis testing. Activity taught \"finding things\" without the intellectual structure of information gathering.",
    "fixed": "Replaced vocabulary with hypothesis (testable guess, scientific method), observation (direct sensory facts), inference (conclusion from evidence), evidence (multiple clues build case), systematic (organized search strategy, scientific experiment design). Rewrote introduction to frame searching with hypothesis → test → evidence framework. Updated discovery section to distinguish observation from inference and name the detective process explicitly."
  },
  "knowledge/innovation-and-invention.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Referenced simple machines without defining them; no historical inventors mentioned; design process unnamed and implicit; Ramp extension had no physics content.",
    "fixed": "Added simple machines (lever, wheel, inclined plane, pulley, wedge, screw) and design process to vocabulary; added Edison/Wright Brothers historical context to introduction; added inclined plane physics and gravity/force content to ramp extension"
  },
  "knowledge/instructional-games-and-teaching-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words (turn-taking, rules, engagement, strategy). No cognitive science, no probability, no executive function, no learning science.",
    "fixed": "Replaced vocabulary with working memory (prefrontal cortex, 2-3 items in children vs. 7 in adults), probability (1-in-6 die face, 36 two-dice combinations), executive function (working memory + inhibitory control + cognitive flexibility), protégé effect (teaching others improves your own learning). Rewrote introduction to explain the three executive functions being exercised."
  },
  "knowledge/interconnections-ecosystems-social-networks-global-connections-systems-thinking.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Food chain had an inaccuracy (\"bird eats bees\" is unusual). Missing trophic levels, keystone species, mutualism vs. parasitism vs. commensalism. Food chain vs. food web distinction absent.",
    "fixed": "Fixed food chain to plant→caterpillar→bird→worm→soil with accurate relationships. Added trophic levels, keystone species (Yellowstone wolf example), mutualism/parasitism/commensalism as named concepts. Distinguished food chain from food web. Updated 3-4+ adaptations with 10% energy rule between trophic levels. Fixed book recommendation (The Little Blue Truck is not an ecosystems book)."
  },
  "knowledge/interview-and-field-research-simulation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Activity was \"ask 3-4 questions and draw the answers\" with no research methodology. No research question formulation, no open vs. closed question distinction, no bias, no primary source concept, no data analysis phase. All four vocabulary words were everyday synonyms for \"asking questions.\"",
    "fixed": "Replaced vocabulary with research question, primary source, open question (vs. closed), data (field notes), bias (leading questions). Rewrote activity as a 5-step research process: (1) form research question, (2) learn open vs. closed and neutral vs. biased questions with live demonstrations, (3) conduct structured interview with field notes, (4) ask follow-up questions iteratively, (5) analyze patterns in collected data. Added \"research always generates more questions\" as conclusion."
  },
  "knowledge/interview-and-journalism-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all everyday words (journalist, interview, communicate, curious). No journalism framework, no source verification, no fact vs. opinion distinction, no media literacy.",
    "fixed": "Replaced vocabulary with primary source (firsthand knowledge vs. secondary retelling), verification (checking information against multiple sources), Five W's framework (Who/What/When/Where/Why, Aristotle's rhetoric), editorial vs. reporting (fact vs. opinion, media literacy foundation). Rewrote activity with Five W's structure, verification exercise, and fact/opinion identification."
  },
  "knowledge/interview-practice-and-preparation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was entirely generic (interview, interviewer, communication, listen) — no real content about what makes interviews effective. Activity was just asking \"what's your favorite food?\" with no teaching of actual interview technique. No mention of open vs. closed questions, active listening, follow-up questions, or real-world interview contexts.",
    "fixed": "Replaced vocabulary with open-ended question, closed question, follow-up question, active listening — the actual concepts of effective interviewing. Updated activity to explicitly contrast open vs. closed questions and show why open-ended questions get richer answers. Added follow-up question practice and real-world context (journalism, science, medicine)."
  },
  "knowledge/job-role-play-and-career-exploration.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No economic concepts: missing division of labor, specialization, economic interdependence, goods vs services — just themed play with thin vocabulary",
    "fixed": "Added division of labor, specialization, economic interdependence, goods and services to vocabulary and activity overview; framed job exploration as economics education; added prompts to connect interdependent jobs during play"
  },
  "knowledge/knowledge-sharing-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No intellectual content — purely procedural meta-lesson about playing games. Vocabulary used only process words. No explanation of how memory works, the cognitive science of game-based learning, or the testing effect.",
    "fixed": "Added real cognitive science vocabulary: encoding, retrieval, working memory, testing effect/retrieval practice. Explained why game-based struggle strengthens memory more than passive learning. Wove retrieval practice concept into activity guidance."
  },
  "knowledge/language-and-cultural-exchange.md": {
    "verdict": "PASS",
    "issues": "Vocabulary is excellent: phoneme (44 English phonemes, Mandarin tones, Xhosa clicks, infant brain specialization by 12 months), language family (Indo-European family, 3 billion speakers, cognates across 5,000 years), bilingualism (prefrontal cortex strengthening, executive function, >50% of world bilingual, 7,000 languages with one going extinct every two weeks), writing system (alphabets vs. logographic vs. three simultaneous Japanese systems, Sumerian cuneiform 5,400 years ago). Activity references sitar strings, pentatonic scales, Diwali's 2,500-year history, and encourages cognate hunting and endangered language discussion.",
    "fixed": "N/A"
  },
  "knowledge/language-learning-and-practice.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "knowledge/laundry-and-clothing-care-practice.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary surface-level (absorbent, moisture, texture, garment). No chemistry of cleaning (how soap works), no textile science (fiber types), no physics of drying (evaporation). Purely procedural washing activity.",
    "fixed": "Replaced vocabulary with surfactant (hydrophilic/hydrophobic molecular structure), fiber (cotton cellulose vs. wool protein vs. polyester polymer — different water absorption), evaporation (kinetic energy, water vapor, temperature effects), capillary action (adhesion/cohesion through fiber gaps). Rewrote activity to include surfactant mechanism explanation, fiber absorption comparison, and evaporation science."
  },
  "knowledge/leadership-and-team-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was circular (leadership defined as \"guiding others toward goals,\" cooperation as \"working together\"). No intellectual content about what leadership is, why groups need coordination, authority vs. leadership, or division of labor. Activities were art-making and block-stacking with generic \"teamwork\" prompts, no framework.",
    "fixed": "Replaced vocabulary with authority (role-based), leadership (trust and competence-earned), role (specific group job), consensus, division of labor. Rewrote activity introduction with contrast between bossy authority and real earned leadership. Added structured roles (architect, builder, stability checker, materials manager), mid-activity role rotation, debrief on whose idea actually solved the problem. Connected to real-world examples (firefighters, doctors who must listen to their teams)."
  },
  "knowledge/leading-and-following.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All four vocabulary words (lead, follow, direction, turn) were everyday words. No psychology of leadership, no social learning theory, no neuroscience of imitation. Activity was follow-the-leader with no intellectual content.",
    "fixed": "Replaced vocabulary with hierarchy (universal in social animals — wolf packs, pecking orders), social learning (Albert Bandura's observational learning research), mirror neurons (premotor cortex neurons that fire during both action and observation), initiative (prefrontal cortex generating vs. copying actions, executive function). Rewrote activity to explain mirror neuron activation during following, initiative as harder cognitive task than imitation, and democratic hierarchy rotation. Added emergent leadership, V-formation energy conservation, animal hierarchy examples, and dual-leader confusion experiment for 3-4+."
  },
  "knowledge/learning-how-to-learn.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Entirely about growth mindset emotional framing (persist, don't give up); no actual neuroscience content about how the brain learns",
    "fixed": "Added neuroplasticity, neuron, working/long-term memory, sleep consolidation, myelin/practice, spaced repetition vocabulary; introduction now teaches brain cell biology; discovery questions connect activity to neural pathway strengthening"
  },
  "knowledge/learning-to-tie-knots-and-bows.md": {
    "verdict": "PASS",
    "issues": "Already excellent. Vocabulary covered friction (as the actual mechanism knots rely on), overhand knot, crossing (mathematically defined), and topology (knot theory, DNA research application). Activity explicitly teaches friction at every step. Age adaptations reference knot theory for 3-4+. No changes needed.",
    "fixed": "N/A"
  },
  "knowledge/letter-writing-and-calligraphy.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Missing writing system history, no neuroscience of fine motor control, no ink science. Vocabulary was basic art terms (calligraphy, letterform, stroke, mark-making). Activity was painting marks with no knowledge content.",
    "fixed": "Replaced vocabulary with grapheme (written symbol for sound, 'A' from Phoenician ox head ~1050 BCE), motor cortex (34 hand muscles, myelination timeline), cuneiform (oldest writing, Mesopotamia 3400 BCE), serif (Roman stonemason chisel marks, serif vs. sans-serif). Rewrote activity to include writing system history, brain science of motor control, and cross-cultural script comparison."
  },
  "knowledge/library-and-book-exploration.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was almost entirely generic everyday words: \"Explore\" and \"Imagination\" are not literacy concepts at all. \"Library\" defined as just \"a collection of books.\" No mention of fiction vs. non-fiction, genre, narrative structure, author/illustrator distinction, or how to use reference tools (table of contents, index). Activity was just \"browse books and read together\" with no intellectual framework.",
    "fixed": "Replaced vocabulary with fiction, non-fiction, genre, author, illustrator, narrative — real literacy concepts. Updated activity to include sorting books by fiction/non-fiction, demonstrating table of contents vs. absence of one, tracking narrative structure aloud, and using non-fiction as reference."
  },
  "knowledge/light-and-sound.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Missing opaque/transparent/translucent vocabulary (why objects make shadows); missing frequency/pitch (why different surfaces sound different); incorrect/incomplete claim that both light and sound travel through air — light travels through vacuum, sound does not.",
    "fixed": "Added opaque, transparent, translucent, frequency/pitch, and spectrum vocabulary with real definitions; integrated material classification into shadow activity; added pitch/frequency explanation to sound exploration; corrected light vs sound medium distinction with space example; fixed wrap-up to accurately distinguish how light and sound travel"
  },
  "knowledge/logic-and-reasoning-puzzles.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Emojis in section headings (removed). Vocabulary included \"perseverance\" (character trait, not logic content) instead of logic concepts. No explanation of what logic IS — no deductive/inductive reasoning, no hypothesis, no distinction between logic and guessing. Activity was puzzle play with no logical framework.",
    "fixed": "Removed emojis from all section headings. Replaced vocabulary with logic (rule-following reasoning, computers run on logic), deductive reasoning (general rule → specific conclusion, always true), inductive reasoning (observations → general rule, can be wrong), hypothesis (testable prediction, how science works), pattern (with mathematical examples: doubling sequence, Fibonacci in nature). Rewrote introduction to frame puzzles as logic — the tool used by detectives, scientists, and lawyers. Rewrote discovery section to name logical processes as they happen (deductive reasoning during edge-piece sorting, hypothesis testing during placement). Updated 2-3 age adaptation to use real vocabulary with simple explanations. Extended Variation 4 to include formal deductive games (process-of-elimination 20-questions style)."
  },
  "knowledge/logic-games-and-brain-teasers.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Title promises logic but lesson never defines logic, deductive reasoning, or process of elimination. Vocabulary (analyze, pattern, persist, strategy) could apply to any lesson — no actual logic content.",
    "fixed": "Added logic, deductive reasoning, process of elimination, and if-then thinking to vocabulary with real definitions; rewrote Discovery step to name logical strategies during play; added 20 Questions extension as explicit deductive reasoning practice; added Fibonacci sequence to pattern vocabulary"
  },
  "knowledge/making-and-keeping-friends.md": {
    "verdict": "PASS",
    "issues": "Vocabulary (companionship, cooperation, empathy, connection) IS the real developmental psychology terminology. Activities involve genuine practice of social skills through cooperative planting.",
    "fixed": "N/A"
  },
  "knowledge/making-bead-and-pasta-necklace-patterns.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Pattern vocabulary was decent (pattern, sequence, texture, symmetric) but missed that pattern-making is a direct algebraic precursor. AB/ABC/ABBA pattern type notation never introduced. Predictability — the mathematical value of patterns — never discussed. Symmetry mentioned without explaining axis of symmetry. Texture mentioned without explaining why pasta has ridges (manufacturing process).",
    "fixed": "Replaced vocabulary with pattern (mathematical definition with AB/ABC/ABBA notation), iteration (one complete repeating unit), predictability (the mathematical power of patterns — knowing what comes next without seeing it), sequence (not all sequences are patterns), texture (structural cause), and axis of symmetry (imaginary fold line). Rewrote exploration to name pattern types with mathematical notation and ask predictability questions. Updated 3-4+ to require pattern-type naming, teach axis of symmetry explicitly with folding test, and add predictability as the central concept."
  },
  "knowledge/making-good-decisions.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words (consequence, option, decision, safe). No cognitive science — just \"is it safe? is it kind?\" with no actual decision theory.",
    "fixed": "Replaced vocabulary with trade-off, prefrontal cortex, cost-benefit analysis. Rewrote activity flow to model cost-benefit thinking at each step. Added opportunity cost and genuine dilemma discussion for 3-4+."
  },
  "knowledge/managing-emotions.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "\"Regulate\" was real terminology but lesson was mostly craft (paper plate faces) with basic emotion labeling. No neuroscience of emotions.",
    "fixed": "Replaced vocabulary with amygdala, fight-or-flight response, cortisol, regulate (with vagus nerve mechanism). Rewrote activity to explain the amygdala alarm system, cortisol release, and how deep breathing activates the parasympathetic nervous system via the vagus nerve. Added dopamine for 3-4+."
  },
  "knowledge/manufacturing-and-making-things.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Only surface vocabulary; treated manufacturing as gluing pieces together; no materials science, no polymer/smelting chemistry, no assembly line history",
    "fixed": "Added polymer chemistry (plastic from petroleum), smelting (iron ore to steel), paper production; assembly line and division of labor; materials science properties; rewrote intro to explain raw material origins of plastic, metal, paper"
  },
  "knowledge/maps-and-directions.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Template boilerplate instruction text left visible in vocabulary section (lines 9-13: \"Select 3-4 vocabulary words that...\"). Missing map scale, legend/key, coordinate systems, and cardinal direction science (why north is north).",
    "fixed": "Removed template boilerplate. Replaced vocabulary with bird's-eye view/aerial perspective, map scale, legend/map key, cardinal directions (with sun-based orientation), coordinate system (latitude/longitude, GPS satellites), symbol. Added legend-making to activity, explained cardinal directions via sun position, added map scale measurement exercise. Updated 3-4+ to include coordinate grid labeling and GPS connection."
  },
  "knowledge/market-and-sales-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Good vocabulary (vendor, transaction, commerce) but no actual economics concepts. Running a pretend stall with uniform pricing taught social skills, not economics.",
    "fixed": "Replaced vocabulary with supply and demand, scarcity, profit, medium of exchange. Rewrote activity to include price-setting based on scarcity, supply-depletion price experiments, profit calculation, and barter vs. money comparison. Added competition and \"double coincidence of wants\" for 3-4+."
  },
  "knowledge/media-creation-and-sharing.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary had only 4 basic everyday terms (creator, audience, media, share) — no technical content. No mention of pixels, image sensors, lenses, file formats, compression, digital vs. analog, microphones, or networking. Entire activity was process-based with no explanation of how any technology works.",
    "fixed": "Replaced vocabulary with 10 technical terms: pixel (RGB values 0-255), lens (refraction, aperture), image sensor (photodiodes, electrical signals), resolution (megapixels), file format/compression (JPEG, PNG, MP4 codecs), microphone (sound waves → electrical → binary), transmission/network (Wi-Fi, fiber optics, speed of light). Rewrote introduction to explain lens and image sensor; rewrote wrap-up to narrate full transmission path."
  },
  "knowledge/memory-strategies.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "knowledge/mental-math-and-calculation-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary defined only everyday words; missing subitizing, cardinality, base-10, set union concept of addition, ordinal vs cardinal distinction",
    "fixed": "Added cardinality/cardinal principle, subitizing as perceptual skill, one-to-one correspondence, ordinal vs cardinal numbers, addition as set union, base-10 with historical context"
  },
  "knowledge/mentoring-younger-children.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was four generic social-emotional words (mentor, responsibility, patience, leadership) with no real content about how teaching and learning actually work. Activity was essentially \"pair an older and younger child together and let them play\" with no conceptual framework about what makes mentoring effective as a learning mechanism.",
    "fixed": "Added scaffolding, modeling, observational learning, fading support vocabulary — the actual educational psychology behind mentoring. Rewrote activity to teach the older child the three-step mentor sequence (model → scaffold → fade support) explicitly. Activity now names what's happening as it happens (\"that's scaffolding!\") and asks the older child to observe when fading support enables more independent performance."
  },
  "knowledge/model-building-and-miniatures.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary basic (architect, balance, structure, miniature). No structural engineering, no scale/ratio mathematics, no physics of why things stand or fall. Activity was stacking blocks with no engineering content.",
    "fixed": "Replaced vocabulary with scale (ratio, proportional reasoning, architect models), compression (pushing force, pyramids), center of gravity (balance point, stability physics), load-bearing (structural support, weight distribution). Rewrote activity to include center-of-gravity experiments, compression explanations, lintel construction, and triangle-as-strongest-shape demonstrations."
  },
  "knowledge/money-counting-and-budgeting-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary surface-level (exchange, denomination, budget, transaction). No real economics (opportunity cost, scarcity, fungibility) and no mathematical framework beyond basic counting. Activity was coin sorting and pretend shopping with no analytical content.",
    "fixed": "Replaced vocabulary with denomination (base-10 system, 100 cents = 1 dollar), fungibility (interchangeability, why money works as a system), opportunity cost (what you give up with each choice), budget constraint (allocating limited resources). Rewrote activity with dime-vs-nickel size puzzle, denomination sorting with base-10 connection, budget constraint exercises with addition/subtraction, and making change. Added equivalent denominations (combinatorics), interest, saving (marshmallow experiment), and penny metallurgy for 3-4+."
  },
  "knowledge/moving-and-relocation-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "knowledge/museum-and-gallery-creation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Decent basic vocabulary (exhibit, curate, gallery, artifact) but no museum science, no art history, no cultural heritage concept. Activity was arranging toys on a shelf with no intellectual payload.",
    "fixed": "Replaced vocabulary with conservation (temperature/humidity/light control, chemical bond degradation), provenance (documented ownership history, authenticity verification), taxonomy (hierarchical classification for 8M+ objects), cultural heritage (tangible/intangible heritage, UNESCO 1,100+ sites). Rewrote activity to document provenance for each item, build classification taxonomy, and discuss conservation science."
  },
  "knowledge/musical-instrument-exploration.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Had somewhat decent terms (vibration, rhythm, resonance, percussion) but definitions were imprecise — \"resonance\" defined as \"fills up space\" (that's reverberation, not resonance). No frequency (Hz), amplitude, sound waves as air compression, or material science of timbre.",
    "fixed": "Replaced vocabulary with frequency (Hz, vibrations per second, pitch relationship), amplitude (vibration size = loudness, energy relationship), sound wave (compression/rarefaction in air at 343 m/s), timbre (overtone/harmonic mixtures, why materials sound different). Rewrote activity to demonstrate amplitude with hard vs. soft strikes, compare frequency across instruments, and explain timbre through material science. Added water glass xylophone and meter for 3-4+."
  },
  "knowledge/natural-landmarks.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary used \"Landmark\" (not a scientific term) and \"Formation\" (vague process description). Missing plate tectonics (WHY mountains form), stratigraphy, and rock type information. Activity had no geological mechanisms.",
    "fixed": "Replaced \"Landmark\" with tectonic plates (12-20 plates, Indian-Eurasian collision still growing Himalayas). Replaced \"Formation\" with stratigraphy (Grand Canyon's 2 billion year rock record, color = time period). Enhanced erosion definition (Colorado River, 75B tons/year sediment). Added elevation's effect on temperature and oxygen. Updated mountain-building and canyon-creation activity steps with plate tectonics and stratigraphy content."
  },
  "knowledge/nature-study-and-observation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All process, no scientific content—observation framed as sensory play without any biology",
    "fixed": "Added chlorophyll, exoskeleton, adaptation, camouflage, decomposition, arachnid/insect distinction; discovery questions now teach actual concepts instead of open-ended wondering"
  },
  "knowledge/object-collecting-and-organizing.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary used only surface-level terms; no mention of attributes as formal properties, mathematical sets/subsets, or classification systems in science. Activities were purely procedural with no intellectual framework.",
    "fixed": "Added 'attribute' and 'set/subset' to vocabulary with mathematical and scientific context; connected classification to biological taxonomy and the periodic table; added 'same objects, different rule' discovery moment; introduced Venn diagram concept for older children"
  },
  "knowledge/oceans-and-rivers.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "knowledge/office-and-workplace-simulation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was generic behavior words (colleague, communicate, responsibility, professional) with no economics. No explanation of what offices are FOR — no goods vs. services, no economy, no organizational hierarchy, no wages.",
    "fixed": "Replaced vocabulary with: goods and services (physical objects vs. intangible work; offices provide services), economy (production/exchange/wages system), organizational hierarchy (CEO → manager → worker, why coordination requires structure), colleague (refined with work-relationship context), communication (refined with organizational framing). Rewrote introduction to explain goods vs. services, wages, and why offices have hierarchies."
  },
  "knowledge/organization-and-categorization-physical-spaces-creative-materials-social-groups-learning-information.md": {
    "verdict": "PASS",
    "issues": "Vocabulary uses real mathematical/cognitive terms (categorize, attribute, sort, system). Core concept that same objects can be organized multiple ways by different attributes is genuine classification thinking. Multi-attribute sorting activity is substantive.",
    "fixed": "N/A"
  },
  "knowledge/outdoor-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Generic sensory exploration with no ecology. Vocabulary (terrain, atmosphere, landscape, elements) sounded scientific but taught nothing real. Activities were \"find something smooth/rough\" — pure sensory play with no science. No ecosystem, habitat, decomposer, or adaptation content.",
    "fixed": "Replaced vocabulary with ecosystem, habitat, decomposer (with worms/pill bugs/fungi as real examples), adaptation. Rewrote activity around ecological observation: finding habitats, identifying decomposers in dead leaf litter, spotting plant and animal adaptations. Added food chain dependency reasoning and single-celled organism mention."
  },
  "knowledge/painting-a-group-mural-together.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic art terms (collaborate, mural, palette, composition). No color science — no pigments, no subtractive color mixing, no light absorption/reflection. \"Yellow + blue = green\" stated with no explanation.",
    "fixed": "Replaced vocabulary with pigment (light wavelength absorption, historical sources — ochre, lapis lazuli, cochineal), subtractive color mixing (combined pigments absorb more wavelengths), mural (Latin \"murus,\" Lascaux 17,000 years, Diego Rivera), composition (rule of thirds, visual cortex). Rewrote activity with pigment science narration, subtractive mixing explanation, and composition principles."
  },
  "knowledge/painting-with-various-materials.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was \"transform, texture, palette, stroke\" — basic art terms with no science. No paint chemistry, no color science. \"Yellow + blue = green\" stated as fact with no explanation of why.",
    "fixed": "Replaced vocabulary with pigment (light wavelength absorption/reflection, historical pigments — ochre, lapis lazuli, cochineal), binder (egg yolk tempera, linseed oil, acrylic polymer), capillary action (adhesion/cohesion in sponges, string, leaves), subtractive color mixing (wavelength absorption explanation). Rewrote activity to explain capillary action in each tool, pigment science, and why color mixing works. Added viscosity, CMYK printing, additive vs. subtractive mixing, and historical pigment economics for 3-4+."
  },
  "knowledge/paper-crafts-and-origami.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all everyday words (transform, crease, layer, origami). No geometry despite origami being fundamentally mathematical. No material science about paper. Activity was pure craft with no intellectual content.",
    "fixed": "Replaced vocabulary with cellulose (fiber science, grain direction), bisect (angle division, origami mathematics), symmetry (axis of symmetry, bilateral vs. radial), geometry (shapes, angles, Haga's theorems). Rewrote activity to include fiber grain experiments, angle bisection narration, symmetry discovery, and geometric shape identification in every fold."
  },
  "knowledge/party-planning-and-hosting.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was \"hospitality, orchestrate, coordinate, welcoming\" — all everyday words. No planning science, project management, or anthropology. Activity was crafts and pretend hosting with no intellectual content.",
    "fixed": "Replaced vocabulary with logistics (sequencing, resource planning, critical path), ritual (anthropology of celebration, universal human behavior, oxytocin/endorphin release), resource allocation (scarcity, trade-offs), delegation (parallel vs. sequential work, division of labor). Rewrote activity with task sequencing, resource counting, and delegation practice. Added cross-cultural ritual comparison, budgeting, and contingency planning for 3-4+."
  },
  "knowledge/pattern-recognition-and-creation-physical-rhythms-creative-designs-social-sequences-learning-systems.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "knowledge/patterns-and-systems-mathematical-patterns-natural-patterns-social-patterns-thinking-patterns.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Topic title includes 4 pattern types but lesson only covered basic AB repeating patterns; \"social patterns\" and \"thinking patterns\" entirely absent; no Fibonacci, fractals, or tessellation; \"systems\" concept not explained; 2-3 adaptation told to avoid complex vocabulary",
    "fixed": "Added Fibonacci sequence, fractal, tessellation, system vocabulary; rewrote activity flow to cover all 4 pattern types; added natural Fibonacci hunt (pinecones/sunflowers), social patterns (daily routines), thinking patterns (pattern recognition as prediction); fixed age adaptations to use real vocabulary"
  },
  "knowledge/peer-teaching-and-collaboration.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Missing developmental and cognitive science. No mention of Vygotsky's zone of proximal development, the protégé effect, or the parallel-to-cooperative play developmental sequence. Generic activity without intellectual framework.",
    "fixed": "Added Vygotsky's zone of proximal development and scaffolding concepts; the protégé effect (teaching consolidates teacher's own learning); the developmental play sequence (solitary → parallel → associative → cooperative); and cognitive conflict as a driver of learning. Added to vocabulary and age adaptations."
  },
  "knowledge/personal-hygiene-and-self-care.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Had \"bacteria\" but never explained how soap works or what bacteria actually are. Purely procedural (wet, soap, scrub, rinse, dry) with no science.",
    "fixed": "Replaced vocabulary with bacteria (single-celled organisms, microbiome), surfactant (hydrophilic/hydrophobic ends), microorganism, antibacterial. Rewrote handwashing to explain surfactant mechanism at each step. Added oil-and-soap experiment and germ theory (Louis Pasteur) for 3-4+."
  },
  "knowledge/personal-identity.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Mostly a self-esteem activity (\"you are special and unique!\") with no cognitive science. Mirror self-recognition mentioned but not explained — no rouge test, no cognitive milestone context. No theory of mind, no DNA as biological basis of uniqueness, no psychological concept of self-concept. Challenge solution for mirror non-recognition had no scientific framing.",
    "fixed": "Replaced vocabulary with self-concept (psychology), self-recognition (rouge test, 18-24 month milestone, cognitive significance), theory of mind (own thoughts vs. others', prefrontal cortex/temporoparietal junction, develops ages 3-4), unique (DNA as biological uniqueness, exception for identical twins). Rewrote introduction to frame mirror recognition as a cognitive milestone. Added DNA and theory of mind content to discovery section. Updated mirror challenge solution to describe the rouge test."
  },
  "knowledge/perspective-taking.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "\"Point of View\" redundant with \"Perspective.\" Empathy not connected to mirror neurons. No theory of mind science, no prefrontal cortex, no false belief task despite this being exactly the topic.",
    "fixed": "Replaced \"Point of View\" with theory of mind (false belief task, ages 2-5 development, why children before 4 think everyone knows what they know). Updated empathy definition to include mirror neurons (premotor cortex, fire during both action and observation). Added false belief task exercise to 3-4+ adaptations."
  },
  "knowledge/photo-editing-and-manipulation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "\"Transform\" (generic everyday word) and \"Digital\" (defined as \"related to technology, computers, devices\") in vocabulary. No pixel science, no RGB color model, no explanation of how screens or cameras work.",
    "fixed": "Replaced \"Transform\" with pixel (picture element, 12 megapixels = 12M colored squares, pixelation when zoomed). Replaced \"Digital\" with RGB (additive color mixing, three light types, R+G=yellow, all three=white — opposite of paint mixing, exploits three cone cell types). Enhanced filter definition with actual pixel math. Added pixel zoom exploration and RGB vs. paint mixing explanation to activity."
  },
  "knowledge/photography-and-picture-taking.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday words (observe, composition, capture, frame). No optics, no explanation of how cameras work, no physics of light. Activity was \"point and click\" with no science content.",
    "fixed": "Replaced vocabulary with lens (curved glass that refracts light to focal point, same principle as eye), sensor (millions of photosites converting light to pixels), exposure (aperture/shutter speed/ISO — \"photography\" = \"writing with light\" from Greek), composition (rule of thirds, visual cortex spatial processing). Rewrote activity to explain lens optics, pixel construction, light-and-shadow photography, and depth of field. Added shutter speed, motion blur, and photojournalism for 3-4+."
  },
  "knowledge/planets-and-stars.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Had real terms (luminous, celestial, orbit, constellation) but content was mostly craft-based (placing glow stars on paper). Never explained nuclear fusion, gravity, star vs. planet distinction, or solar system scale.",
    "fixed": "Replaced vocabulary with nuclear fusion (hydrogen to helium, 600M tons/second, E=mc²), gravity (Newton 1687, Einstein 1915, space bending), light-year (9.5 trillion km, seeing back in time), solar system (4.6 billion years, rocky inner vs. gas outer). Rewrote activity with fusion explanation, star-vs-planet distinction, and scale model (basketball sun, marble Earth 30 feet away)."
  },
  "knowledge/plant-growth-and-types.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Photosynthesis called 'magical process' — no actual chemistry; missing chlorophyll, CO2/O2 exchange, glucose, why plants are green; root system missing osmosis and minerals",
    "fixed": "Fixed photosynthesis definition to include chlorophyll, carbon dioxide, glucose, oxygen byproduct, why plants are green; added chlorophyll as separate vocabulary term; added osmosis and root hairs to root system definition; added oxygen-from-photosynthesis fact in Discovery step"
  },
  "knowledge/poetry-and-rhyming-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Had \"rhyme, rhythm, pattern, verse\" — real but basic terms any 5-year-old knows. Missing phonological terminology, meter, figurative language. No linguistics or neuroscience of language processing.",
    "fixed": "Replaced vocabulary with phoneme (44 English phonemes, phonological awareness), meter (trochaic/iambic), alliteration (onset repetition), onomatopoeia (cross-linguistic examples). Rewrote activity to include phoneme segmentation, meter clapping, alliteration tongue twisters, and couplet composition. Added syllable counting, simile, metaphor, and cross-linguistic onomatopoeia for 3-4+."
  },
  "knowledge/pottery-and-clay-work.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday words (sculpt, texture, tactile, manipulate). No material science — never explained what clay IS, how it responds to heat, or why it can be shaped. Pure sensory play with no intellectual content.",
    "fixed": "Replaced vocabulary with clay (kaolinite mineral particles from millions of years of rock weathering), plasticity (water as lubricant between plate-shaped particles), kiln (1,000-1,300°C vitrification — irreversible chemical change), ceramics (Greek \"keramos,\" includes pottery, bricks, spacecraft heat shields). Rewrote activity to explain mineral particle behavior, physical vs. chemical changes, and compare everyday ceramics. Added potter's wheel centripetal force, coil building history, and clay types (earthenware/stoneware/porcelain) for 3-4+."
  },
  "knowledge/printmaking-and-stamping.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No printmaking history, no physics, no ink chemistry. Vocabulary was basic (pattern, imprint, texture, transfer). Activity was stamping with paint and no explanation of how printing works.",
    "fixed": "Replaced vocabulary with relief printing (oldest method, Chinese woodblock 200 CE), pressure (force per area in pascals), mirror image (reversal principle, Gutenberg 1440 movable type), pigment (light wavelength absorption/reflection, historical sources). Rewrote activity to explain relief printing mechanics, pressure physics, mirror image principle, and pigment science. Added Gutenberg's revolution for 3-4+."
  },
  "knowledge/public-speaking-and-presentation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All everyday vocabulary (confidence, articulate, communicate, audience). No rhetoric, no vocal anatomy, no communication science. Activity was basic show-and-tell with no intellectual content.",
    "fixed": "Replaced vocabulary with rhetoric (Aristotle 350 BCE — ethos/pathos/logos), projection (diaphragm mechanics, Greek amphitheaters), body language (Mehrabian research, mirror neurons), oratory (Demosthenes, Cicero's five canons). Rewrote activity to use Aristotle's framework explicitly, practice diaphragm projection, and analyze body language science."
  },
  "knowledge/public-speaking-and-presentations.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words (audience, present, confidence, expression). No rhetoric, no vocal anatomy, no communication science. Activity was show-and-tell with no intellectual framework.",
    "fixed": "Replaced vocabulary with rhetoric (Aristotle, logos/ethos/pathos), articulation (tongue/lips/teeth/palate), intonation (pitch patterns, rising/falling meaning), projection (diaphragm mechanics), persuasion. Rewrote introduction to demonstrate projection vs. whispering and explain diaphragm mechanics. Updated discovery section to name and explain intonation, projection, and mirror neurons during eye contact."
  },
  "knowledge/puppet-shows-and-storytelling.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic theatrical terms (character, narrative, expression, pantomime). No puppetry history, no dramatic arc structure, no voice anatomy (projection/diaphragm), no suspension of disbelief concept. Activity was \"bring out puppets and tell stories\" with no theater science.",
    "fixed": "Replaced vocabulary with protagonist (Greek etymology), dramatic arc (setup/rising action/climax/resolution), projection (diaphragm-based vocal technique), suspension of disbelief (Coleridge 1817). Rewrote activity to teach dramatic arc explicitly, include 3,000-year puppetry history (bunraku, wayang), and practice projection. Added antagonist and shadow puppet optics for 3-4+."
  },
  "knowledge/puzzle-solving-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary existed (spatial, pattern, persistence, manipulate) but activity content was pure encouragement with no intellectual substance — no mention of mental rotation, jigsaw anatomy, or real puzzle-solving strategies",
    "fixed": "Replaced vocabulary with mental rotation, tab and blank (jigsaw anatomy), spatial reasoning (with parietal lobe reference), strategy, concave and convex; rewrote activity steps to teach edge-first strategy, name tabs/blanks, prompt mental rotation verbally; upgraded age adaptations to explicitly practice vocabulary and techniques"
  },
  "knowledge/reading-and-book-exploration.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was \"narrative, illustration, anticipate, literature\" — real but basic literacy terms. No neuroscience of reading, no phonological awareness, no explanation of how the brain processes written symbols. Activity was looking at picture books with no science content.",
    "fixed": "Replaced vocabulary with phoneme (44 English phonemes, infant phoneme pruning), Broca's area (speech production, Paul Broca 1861), Wernicke's area (language comprehension, Carl Wernicke 1874, arcuate fasciculus connection), decoding (visual cortex repurposing, reading invented only 5,000 years ago). Rewrote activity to include phoneme awareness, brain region identification, and CMYK printing science. Added writing system comparison, narrative structure, and phonological awareness exercises for 3-4+."
  },
  "knowledge/religious-and-spiritual-practices.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Lesson titled 'Religious and Spiritual Practices' but contains only a secular mindfulness exercise—no actual content about religion, traditions, or beliefs",
    "fixed": "Added vocabulary for monotheism, polytheism, animism, sacred, meditation; added real examples from Islam, Judaism, Buddhism, Hinduism in intro; discovery questions now explore why religion is a human universal"
  },
  "knowledge/repetition-and-practice-physical-skills-creative-techniques-social-routines-learning-exercises.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all motivational/process words (repetition, persistence, progression, mastery). Zero neuroscience. No explanation of WHY practice works — no neuroplasticity, no myelination, no procedural memory, no deliberate practice research. Activity taught \"doing things again\" without the biology of skill acquisition.",
    "fixed": "Replaced vocabulary with neuroplasticity (physical brain changes, synaptic strengthening), myelination (myelin sheath, 100x signal speed, automatic feeling), synapse (Hebb's rule — \"neurons that fire together, wire together\"), procedural memory (basal ganglia/cerebellum storage, automatic skill), deliberate practice (Ericsson's research, focused attention matters). Rewrote introduction to explain neuroplasticity and myelination as the actual biology behind why practice works."
  },
  "knowledge/research-project-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "\"Hypothesis\" was real terminology but lesson never taught the scientific method. No variables, no controlled experiments, no data collection framework, no distinction between qualitative and quantitative data. Activity was touching objects and sorting by color with no research methodology.",
    "fixed": "Replaced vocabulary with scientific method (7-step systematic process, 400+ years), variable (independent/dependent/controlled), data (quantitative vs. qualitative, Darwin's 15 notebooks), classification (Linnaeus 1735, hierarchical systems). Rewrote activity as a walk-through of all 7 scientific method steps: observation, question, hypothesis, experiment design, data collection, analysis, conclusion. Added peer review, reproducibility, sample size, and Marie Curie's radioactive notebooks for 3-4+."
  },
  "knowledge/resource-management-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Lesson was fundamentally about sharing/fairness (a social-emotional skill) rather than resource management economics. Missing the core concept that drives resource management: scarcity. No mention of trade-offs or opportunity cost. Activity was just counting and equal division with no constraint-based thinking.",
    "fixed": "Added scarcity, trade-off, and budget to vocabulary alongside allocate/prioritize/conserve. Rewrote activity to explicitly introduce scarcity as the reason resources need managing; added constraint-based scenarios requiring trade-off decisions; reframed discovery questions around why resources need managing and what trade-offs were made."
  },
  "knowledge/rhythm-and-timing-physical-coordination-creative-music-social-synchronization-learning-sequences.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Had rhythm/tempo/synchronize vocabulary but missing key scientific concepts: entrainment, meter, neuroscience of rhythm. Activities were mostly procedural with thin intellectual content.",
    "fixed": "Added entrainment and meter to vocabulary with real definitions; added caregiver background on neural circuits (auditory cortex, cerebellum), universal human rhythm, 40,000-year-old instruments; integrated entrainment language into activity introduction"
  },
  "knowledge/rocks-and-minerals.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Good observation vocabulary (mineral, density, texture) but missing the three fundamental rock types (igneous, sedimentary, metamorphic) and how they form — core geology content entirely absent. Also missing crystal structure.",
    "fixed": "Added igneous/sedimentary/metamorphic definitions with real formation explanations (lava cooling, sediment compression, heat/pressure metamorphosis); added crystal vocabulary; wove rock type classification into introduction; added mineral identification context to magnifying glass exploration"
  },
  "knowledge/role-playing-and-simulation-physical-activities-creative-performance-social-situations-learning-scenarios.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All four vocabulary words were everyday (\"simulate,\" \"character,\" \"scenario,\" \"improvise\"). No Theory of Mind, no symbolic thinking (cognitive milestone), no executive function, no connection to real-world simulation. Activity told caregivers to \"let child pick a role\" with no intellectual content.",
    "fixed": "Replaced vocabulary with Theory of Mind, symbolic thinking, simulate, empathy, executive function. Rewrote activity to explicitly teach Theory of Mind via false belief scenario, introduce symbolic thinking via banana-as-phone, and connect to real simulation (flight simulators, surgical training). Updated age adaptations with the Sally-Anne test."
  },
  "knowledge/rules-and-cooperation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All four vocabulary words (cooperate, rules, respect, turn-taking) were everyday words. No social science, no game theory, no explanation of WHY rules exist or how cooperation works mathematically. Activity was building blocks and rolling dice with behavioral prompts.",
    "fixed": "Replaced vocabulary with social contract (Hobbes/Rousseau — trading freedom for collective benefit), reciprocity (tit-for-tat strategy, vampire bat examples), norm (explicit and implicit group expectations, toddlers as norm enforcers), free rider (benefits without contributing, game theory concept). Rewrote activities as social contract experiments, reciprocity games, and free rider demonstrations. Added Prisoner's Dilemma, cross-cultural norms, and mathematical proof that cooperation beats selfishness for 3-4+."
  },
  "knowledge/safety-and-protection-physical-safety-emotional-safety-environmental-protection-social-security.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Template instruction still visible in vocabulary section (lines 9-13, \"Select 3-4 vocabulary words that...\"). Vocabulary was all everyday words (safe, protected, trust, alert). No physics of how safety equipment works (helmet foam absorbing impact, seatbelt + inertia). \"Strangers are usually safe\" advice is not best-practice safety guidance.",
    "fixed": "Removed template instruction. Replaced vocabulary with risk, consequence, inertia (with helmet/seatbelt mechanics), autonomy, instinct. Updated activity to explain how helmets absorb impact energy and how seatbelts work via inertia. Fixed stranger-danger advice to the current best-practice framing (go to known adults, people in uniforms behind counters)."
  },
  "knowledge/safety-and-security-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was generic social-emotional terms (vigilance, refuge, boundaries, resilience) with no real content about how emergency services work, what dispatchers do, why hand-washing kills germs, or how smoke detectors function",
    "fixed": "Replaced vocabulary with hazard, risk, emergency services, dispatcher, first responder, pathogen, smoke detector (with photoelectric/ionization sensor explanation); rewrote introduction to focus on risk assessment; upgraded picture discussion with real mechanisms (soap surfactants, 911 dispatch, smoke detectors); rewrote age adaptations to use real terminology throughout"
  },
  "knowledge/safety-rule-learning-and-practice.md": {
    "verdict": "PASS",
    "issues": "Excellent rigor: reaction time with neural pathway, momentum formula with real stopping distances, peripheral vision using rod cells, habituation as neurological process; ruler-drop demonstration",
    "fixed": "N/A"
  },
  "knowledge/science-experiments-and-discovery.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "A lesson titled \"Science Experiments and Discovery\" containing zero science content. Vocabulary had only process words (observe, experiment, discover, transform). No explanation of diffusion, acid-base reactions, polarity, or subtractive color mixing. Activities were structured play with science props. Scientific method mentioned only as praise, not taught.",
    "fixed": "Replaced vocabulary with diffusion (molecule movement), molecule (H₂O example), chemical reaction (acid-base CO₂ production), acid and base (with neutralization), polarity (polar water vs nonpolar oil), subtractive color mixing (pigment light absorption), hypothesis, and scientific method (5-step process). Rewrote all activity steps to follow the scientific method and teach the mechanism behind each phenomenon."
  },
  "knowledge/sculpture-and-3d-art-with-clay-playdough.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary had only 4 generic terms (sculpture, texture, mold, spatial awareness) — no material science, no art history, no technical terms. Anti-rigor instruction in age adaptations explicitly said \"Use short tool names like 'snake,' 'ball,' 'squish'\" — actively discouraging real vocabulary. No mention of additive vs. subtractive sculpture, plasticity, armature, kiln, or polymers.",
    "fixed": "Replaced vocabulary with 10 rigorous terms: sculpture (40,000-year history, Lion-Man figurine), plasticity (kaolinite/illite/montmorillonite mineral platelets), additive sculpture, subtractive sculpture (Michelangelo), relief sculpture, armature, kiln (vitrification at 900-1,400°C), polymer (wheat starch polymers in playdough), volume and form. Removed anti-rigor age adaptation instruction."
  },
  "knowledge/senses-and-perception.md": {
    "verdict": "PASS",
    "issues": "Already demonstrated genuine intellectual rigor: strong vocabulary section with photoreceptors (rod/cone counts and spectral types), cochlea anatomy (malleus/incus/stapes, 3,500 hair cells, frequency mapping), olfactory receptors (400 types, 1 trillion smells, limbic system direct pathway). Activities integrate Meissner's vs Pacinian corpuscles, 2,500 mechanoreceptors/cm² in fingertips, umami as 5th taste, nose-pinch taste test.",
    "fixed": "N/A"
  },
  "knowledge/sensory-exploration-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No neuroscience about how senses work. Vocabulary was basic (texture, sensory, tactile, explore). Activity was touching things in a bin with no science explanation.",
    "fixed": "Added receptor, neuron, sensory cortex to vocabulary with real explanations (2,500 receptors per cm² in fingertips). Rewrote activity to include fingertip-vs-elbow receptor density test, thermoreceptor concept, and blindfolded identification. Added two-point discrimination test for 3-4+."
  },
  "knowledge/sensory-exploration-taste-smell-touch-proprioception.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary mostly everyday words (texture, aroma, sensation). Only \"proprioception\" was technical. No neuroscience — no receptors, no olfactory bulb, no gustatory papillae, no somatosensory cortex. Activity was touching/smelling/tasting with no biology. Five basic tastes completely missing despite having a taste station. Proprioception named but mechanism never explained (no muscle spindles, Golgi tendon organs, or cerebellum).",
    "fixed": "Replaced vocabulary with mechanoreceptor (four types: Meissner's, Pacinian, Merkel's, Ruffini; 2,500/cm² in fingertips), olfactory receptor (400 types, limonene lock-and-key, direct brain connection), gustatory papilla (10,000 taste buds, five tastes with evolutionary purpose), proprioceptor (muscle spindles, Golgi tendon organs, joint receptors, cerebellum processing). Rewrote each station with receptor science: fingertip-vs-elbow receptor density test, olfactory adaptation, five-taste identification, proprioceptor demonstrations. Added two-point discrimination, taste map myth debunking, cross-modal perception, and somatosensory cortex for 3-4+."
  },
  "knowledge/services-and-helping-others.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All four vocabulary terms were soft social-emotional definitions with no economic or sociological content (service = \"helpful job,\" community = \"people in neighborhood,\" contribute = \"give something helpful,\" appreciation = \"feeling grateful\"); activity was pure community-helpers matching with no intellectual substance — no economics, no real facts about what helpers know or do",
    "fixed": "Replaced vocabulary with specialization (with 10-year doctor training example), interdependence (food-supply chain example), service vs. product distinction, infrastructure; rewrote activity introduction to teach specialization; added real facts for each helper (firefighter oxygen/fuel/heat triangle, doctor bacteria vs. viruses, plumber gravity and pressure, Dewey Decimal System); updated 3-4+ adaptation to trace full interdependence chains and explain taxes/public services"
  },
  "knowledge/sewing-and-fabric-work-simple.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was decent (textile, stitch, tension, embellish) but lacked fiber science and structural explanation. No explanation of WHY stitches hold or how fabric is constructed. Activity was pushing needle through fabric with no knowledge content.",
    "fixed": "Replaced vocabulary with fiber (natural vs. synthetic — cotton, wool, silk, polyester; 30,000+ years of spinning), running stitch (friction-based holding mechanism, oldest stitch), warp and weft (loom structure, plain weave vs. twill vs. satin), tension (pulling force physics). Rewrote activity to explain fiber structure, friction as holding mechanism, and front/back stitch visibility. Added stitch types (running/whip/cross), fiber comparison, magnified warp-and-weft examination, and bone needle history (40,000 years) for 3-4+."
  },
  "knowledge/shopping-and-store-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary had \"transaction, commerce, currency, consumer\" but activity taught zero economics. No supply/demand, no scarcity, no price signals, no profit. Just handing coins back and forth in roleplay.",
    "fixed": "Replaced vocabulary with supply and demand, scarcity, profit, medium of exchange (with barter problem). Rewrote activity to include scarcity experiments (price changes as items sell out), profit calculation, and price-setting based on demand. Added competition, opportunity cost, and \"double coincidence of wants\" for 3-4+."
  },
  "knowledge/show-and-tell-presentations.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Purely procedural — instructions for running show-and-tell with no intellectual content. Missing the actual cognitive skills involved: perspective-taking (theory of mind), oral narrative, audience awareness, descriptive precision. Vocabulary was generic (present, audience, confidence, special).",
    "fixed": "Replaced vocabulary with perspective-taking, theory of mind (other people have different knowledge), oral narrative (structured enough for unfamiliar listeners), descriptive language, audience awareness. Rewrote summary with developmental psychology context (theory of mind as a developmental milestone, connection to narrative comprehension and writing). Rewrote activity overview to frame the challenge as perspective-taking. Updated presentation step to push for precise descriptive language and name the cognitive skill when children use it. Updated 3-4+ adaptations with blind description game and perspective-taking debrief."
  },
  "knowledge/sign-language-and-gesture-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all everyday (non-verbal communication, gesture, expression, inclusive). No linguistics (ASL as complete language with grammar), no neuroscience (Broca's area processes sign language), no history (ASL from French Sign Language, 1817).",
    "fixed": "Replaced vocabulary with sign language (300+ languages worldwide, ASL grammar, Laurent Clerc 1817), Broca's area (language center for both speech and sign), mirror neurons (premotor cortex, observation-action coupling), phonology (handshape, location, movement, palm orientation — four parameters). Rewrote activity to teach phonological analysis of signs, facial grammar, and mirror neuron awareness."
  },
  "knowledge/simple-calculations.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was extremely basic (quantity, more, fewer, match). Missing foundational mathematical concepts. The lesson prompt template was even visible in the text.",
    "fixed": "Replaced vocabulary with cardinality (last number = total, cognitive breakthrough ages 2-4), one-to-one correspondence (each object counted once, foundation of counting), subitizing (instant quantity recognition, Latin \"subitus,\" visual cortex neurons), conservation of number (Piaget 1950s, arrangement doesn't change quantity). Rewrote activity with subitizing flash game, conservation experiment, and cardinality check."
  },
  "knowledge/simple-comedy-and-jokes.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday (comedy, joke, timing, punchline). No humor theory — never explained WHY things are funny. No cognitive science of prediction and surprise. Activity was telling jokes without analyzing humor mechanisms.",
    "fixed": "Replaced vocabulary with incongruity (dominant humor theory — mismatch between expectation and reality), expectation violation (the specific cognitive moment), timing (builds expectation for bigger violation), punchline (etymology from Punch and Judy 1600s). Rewrote activity to analyze humor mechanisms: peek-a-boo as first expectation violation, slapstick as 2,500-year-old physical comedy, mirror neurons and contagious laughter."
  },
  "knowledge/simple-jewelry-making.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all basic (design, texture, pattern, symmetry). No material science, no cultural history (jewelry is 100,000+ years old), no neuroscience of fine motor development. Activity was threading beads with no intellectual content.",
    "fixed": "Replaced vocabulary with bead (100,000-year history, material science — glass/wood/ceramic/stone manufacturing), sequence (mathematical concept, period, alternating patterns), bilateral symmetry (fusiform face area detection), fine motor cortex (34 hand muscles, myelination, 120 m/s nerve signals). Rewrote activity to compare material properties (density, thermal conductivity, sound), build mathematical sequences, and explain myelination during practice."
  },
  "knowledge/simple-machines.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Used \"ramp\" instead of \"inclined plane.\" Vocabulary missing fulcrum, mechanical advantage, force, and work. Only 3 of 6 simple machines covered without naming the six-machine framework. Never explained WHY machines make work easier (force-distance trade-off). Video guidance explicitly said \"no overly technical language\" — contradicting educational philosophy.",
    "fixed": "Replaced vocabulary with simple machine (all six named, Archimedes 250 BCE), mechanical advantage (force × distance trade-off, work equation), fulcrum (pivot point, Archimedes quote), inclined plane (steepness vs. force relationship, wedge and screw as derived forms). Rewrote activity with fulcrum position experiments, steepness vs. force comparisons, and real physics explanations at each station. Added six-machine scavenger hunt, force measurement with scale, compound machine analysis (scissors = two levers + two wedges), and work equation introduction for 3-4+."
  },
  "knowledge/simple-tools-and-their-uses.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was \"tool,\" \"purpose,\" \"handle,\" \"function\" — entirely everyday words. No physics whatsoever. No mention of simple machines, levers, fulcrums, inclined planes, wedges, or mechanical advantage. \"Tools have different shapes because they do different jobs!\" with no explanation of how shapes make work easier.",
    "fixed": "Replaced vocabulary with simple machine, lever, mechanical advantage, inclined plane (with wedge). Rewrote each tool exploration to identify the simple machine inside it: spoon as lever, scissors as two levers + wedge, broom as lever with mechanical advantage, screw as inclined plane wrapped around a cylinder. Added all six simple machines to 3-4+ adaptations."
  },
  "knowledge/singing-and-vocal-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic music terms (pitch, vocal, melody, rhythm) with no anatomy or physics. No explanation of how the voice works or what pitch IS physically. Activity was \"sing songs together\" with no science.",
    "fixed": "Replaced vocabulary with vocal cords (vibrating tissue in larynx, 6-8mm in children), frequency (vibrations per second in hertz, middle C = 261.6 Hz), diaphragm (dome-shaped breathing muscle, controls airflow), resonance (body cavities as amplifying chambers, why each voice is unique). Rewrote activity to explore vocal anatomy through touch, frequency through pitch experiments, and resonance through mouth-shape changes. Added syrinx (bird vocal organ), octave, and tonal languages for 3-4+."
  },
  "knowledge/size-and-measurement.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words (measurement, comparison, capacity, dimension). No concept of units, no standard vs. non-standard measurement, no seriation as a mathematical concept, no estimation. Activity was perceptual size sorting with no measurement framework.",
    "fixed": "Replaced vocabulary with unit (standard vs. non-standard, cubit history), seriation (transitive relationships), capacity (volume measurement in liters/mL), estimation (prediction vs. measurement, error). Rewrote activity with non-standard measurement using blocks, seriation with transitive property, estimate-then-measure cycle, and same-object-different-units demonstration. Added metric system history and area concept for 3-4+."
  },
  "knowledge/skill-demonstration-and-modeling.md": {
    "verdict": "PASS",
    "issues": "Rigorous neuroscience and psychology throughout: mirror neurons (Rizzolatti, 1990s, macaque discovery), procedural memory (cerebellum and basal ganglia vs. declarative memory in hippocampus), scaffolding (Vygotsky's zone of proximal development), observational learning (Bandura's social learning theory, Bobo doll experiments, four-step model). All referenced consistently in activity steps and age adaptations.",
    "fixed": "N/A"
  },
  "knowledge/skill-practice-and-training.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Nearly identical to already-failed \"Study and Homework Play.\" Vocabulary was purely motivational (practice, persistence, progress, skill). No neuroscience of skill acquisition, no motor learning theory.",
    "fixed": "Replaced vocabulary with myelination (nerve insulation speeds signals 100x), procedural memory (cerebellum/basal ganglia storage), cerebellum (50% of brain's neurons), deliberate practice (Ericsson's research). Rewrote activity to explain real-time cerebellar error correction, track myelination through accuracy improvement, and compare mindless vs. deliberate practice."
  },
  "knowledge/sleep-and-rest.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was \"rest, drowsy, recharge, settle\" — all everyday words. Zero sleep science. No circadian rhythm, melatonin, REM sleep, growth hormone, or memory consolidation. Activity was touching blankets in a dim room with no scientific content.",
    "fixed": "Replaced vocabulary with circadian rhythm (suprachiasmatic nucleus, 24-hour cycle), melatonin (pineal gland, light suppression), REM sleep (rapid eye movement, hippocampus memory consolidation, 50% in babies vs. 20% in adults), growth hormone (pituitary gland, deep sleep release). Rewrote activity to explain melatonin release in darkness, REM memory consolidation, and growth hormone physiology. Added sleep stages, adenosine, and sleep debt for 3-4+."
  },
  "knowledge/social-media-creation-pretend.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Lesson was just art-making with a social media label; no explanation of what social media actually is; no real photography concepts beyond \"composition\" as a word; no media literacy content; missing vocabulary for platform, audience, caption, algorithm",
    "fixed": "Added vocabulary: platform, content, audience, caption, curation, narrative; rewrote activity to explain what social media IS; added photography basics (rule of thirds, lighting, subject/background); added media literacy discussion (curation = selected highlights, not whole life); updated age adaptations to introduce algorithm concept"
  },
  "knowledge/social-rules-and-manners.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All 4 vocabulary words (courtesy, considerate, respectful, gratitude) were synonyms for \"polite.\" No sociology, anthropology, or developmental psychology. Activity was \"say please\" roleplay with no science content.",
    "fixed": "Replaced vocabulary with social norm (unwritten cultural rules, cross-cultural variation — bowing, kissing cheeks, handshakes), theory of mind (understanding others' expectations, prefrontal cortex), prosocial behavior (evolutionary basis, dopamine reward, cross-species examples — vampire bats, elephants), cultural variation (eye contact, burping norms differ globally). Rewrote activity to explore norms across cultures and explain the neuroscience of prosocial behavior."
  },
  "knowledge/song-creation-and-composition.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all basic music terms (melody, rhythm, composition, expression). No physics of sound (frequency, vibration, Hz), no neuroscience (auditory cortex, motor cortex entrainment), no music theory (intervals, consonance/dissonance).",
    "fixed": "Replaced vocabulary with frequency (Hz, vocal cord vibration speed, octave as doubled frequency), melody (interval patterns, auditory cortex recognition), rhythm (motor cortex entrainment, meter), consonance/dissonance (frequency ratios, tension and resolution). Rewrote activity to explore vocal cord vibrations, frequency experiments, entrainment, and meter (4/4 vs. 3/4 time)."
  },
  "knowledge/sorting-a-treasure-box-of-buttons-shells-and-stones.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Core classification math was decent, but zero science about the actual objects. No geology (what stones are made of), no conchology (shell biology), no material science (button manufacturing). Objects treated as generic sorting tokens.",
    "fixed": "Replaced vocabulary with taxonomy (hierarchical classification), mineral (quartz, feldspar, chemical composition), density (mass/volume, sink-or-float), attribute (measurable properties for classification). Rewrote activity with Mohs hardness testing, density experiments, material science investigation, and multi-level taxonomy building. Added shell calcium carbonate biology and rock type identification."
  },
  "knowledge/sorting-and-grouping.md": {
    "verdict": "PASS",
    "issues": "Real mathematical vocabulary (categorize, classify, attribute, pattern). Core concept that same objects can be classified differently by attribute is genuine mathematical thinking.",
    "fixed": "N/A"
  },
  "knowledge/space-and-astronomy-exploration.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Defined \"twinkle\" but never explained what a star actually IS (a massive sphere of plasma undergoing nuclear fusion). No planets named, no solar system, no light-years. Video guidance explicitly said to \"focus on wonder and observation rather than complex astronomy facts.\"",
    "fixed": "Replaced vocabulary with: star (nuclear fusion, hydrogen→helium, the Sun is a star), planet (orbits a star; 8 named), orbit (gravity-driven path, 365 days = 1 year), light-year (distance, not time — 9.5 trillion km, Proxima Centauri 4.2 ly away), constellation (patterns that may be far apart in space), galaxy (200-400B stars in Milky Way), atmospheric refraction (why stars twinkle but planets don't). Removed anti-rigor video guidance. Rewrote introduction with nuclear fusion and solar system framing. Updated 3-4+ adaptations with all 8 planet names and a solar system map activity."
  },
  "knowledge/spatial-reasoning-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Emojis in section headings (removed). Age adaptation said \"Keep spatial vocabulary minimal and concrete\" — directly against the philosophy. No neuroscience of spatial reasoning (parietal lobe, hippocampus, trainability). No mention of mental rotation as a distinct cognitive skill, or its relationship to STEM success.",
    "fixed": "Removed emojis from all section headings. Replaced vocabulary with spatial reasoning (cognitive skill, parietal lobe, trainable, STEM predictor), mental rotation (3D object manipulation in the mind, parietal lobe), perspective (viewpoint-dependence, architect/pilot/surgeon reliance), hippocampus (spatial maps, taxi driver research), architecture (requires 3D mental models). Rewrote introduction to explain spatial reasoning as a distinct brain skill. Updated discovery section to include plan view, mental rotation challenge, and stability narration. Updated 2-3 age adaptation to remove \"minimal vocabulary\" instruction."
  },
  "knowledge/states-of-matter-water-ice-steam.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Had basic terms (solid, liquid, evaporate, freeze) but never explained WHY — no molecules, no kinetic energy, no specific phase transition temperatures (0°C/100°C), no crystal lattice, no condensation. \"It got cold and became solid\" with no molecular explanation.",
    "fixed": "Replaced vocabulary with molecule (H₂O, 0.3 nm), kinetic energy (temperature as molecular motion), phase transition (0°C freezing, 100°C boiling, energy goes to breaking bonds not raising temperature), crystal lattice (hexagonal structure, hydrogen bonds, why ice floats — less dense than liquid). Rewrote activity with molecular narration at each phase, ice-floats experiment, and condensation. Added water cycle, plasma as fourth state, and salt water freezing point for 3-4+."
  },
  "knowledge/stories-and-literature.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Lesson was retelling fairy tales with props — no explanation of what literature IS or why humans tell stories; missing plot structure (conflict, rising action, climax, resolution), theme, genre (fable vs. myth vs. fairy tale), oral tradition; vocabulary only covered character, setting, narrative, illustrate",
    "fixed": "Added vocabulary: oral tradition, genre (fable, myth, fairy tale), conflict, plot, theme; rewrote intro to explain 40,000-year history of storytelling; rewrote activity to walk through plot arc and identify genre/theme of chosen story; added wolf's-perspective/point-of-view discussion; updated age adaptations to compare genres and identify themes"
  },
  "knowledge/storytelling-and-oral-traditions.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was basic literary terms (\"narrative,\" \"character,\" \"oral tradition,\" \"sequence\"). No explanation of WHY oral traditions used rhythm/repetition/rule of three (mnemonic aids). No specific oral tradition examples (Griot tradition, Homeric epics, Dreamtime stories). No narrative arc concept. Activity told caregivers to \"read a story\" with nothing to discuss intellectually.",
    "fixed": "Replaced vocabulary with narrative arc, oral tradition (as survival technology for encoding navigation/medicine/seasonal knowledge), Griot (West African oral historian tradition), story grammar, mnemonic devices. Rewrote introduction with Epic of Gilgamesh (oldest written story) and cave paintings context. Updated discovery section to analyze mnemonic patterns and knowledge encoded in stories. Updated age adaptations with specific cultural oral traditions."
  },
  "knowledge/strategic-planning-and-goal-setting.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No cognitive science behind planning — no executive function, working memory, mental simulation, decomposition, or obstacle anticipation. Vocabulary was basic motivational words (strategy, intention, progress, persist). Activity was drawing pictures of goals with no planning framework or real intellectual content.",
    "fixed": "Replaced vocabulary with executive function, mental simulation, decomposition, obstacle anticipation, strategy, persist/iterate. Rewrote activity introduction to connect planning to real-world applications (architects, surgeons, engineers). Added decomposition exercise, obstacle anticipation as \"pre-mortem\" concept, and the plan→act→observe→revise cycle. Updated age adaptations with \"hypothesis\" and \"prediction\" language."
  },
  "knowledge/study-and-homework-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Entirely process-focused with no intellectual content. Vocabulary was motivational words (practice, persistence, focus, effort) with no substance. The lesson taught children to playact studying without studying anything real.",
    "fixed": "Replaced vocabulary with deliberate practice, working memory, metacognition, and persistence (with neuroscience backing). Updated activity flow with real content examples (vowels vs. consonants, mathematical sequences, Latin roots in shape names). Added metacognition prompts and protege effect."
  },
  "knowledge/supply-management-and-delivery-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was all everyday words (organization, deliver, responsibility, route). No logistics, no supply chain, no inventory management, no distribution network concepts. Activity was pure roleplay — \"deliver items to zones\" with no explanation of how supply chains actually work.",
    "fixed": "Replaced vocabulary with logistics (sequencing, routing, resource management), supply chain (full journey from raw materials to consumer, banana example), inventory (counting stock, restocking, optimization), distribution network (hub-and-spoke vs. point-to-point, USPS 31,000+ offices). Rewrote activity to include inventory-taking, shipping manifests, route optimization, last-mile delivery concept, shortage/change-order problem-solving, and restocking. Added hub-and-spoke model and transportation costs for 3-4+."
  },
  "knowledge/taste-testing-and-flavor-exploration.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all everyday words (palate, sensory, savor, texture). Zero taste science — no taste buds, no five basic tastes, no umami, no olfactory connection, no explanation of how taste receptors work.",
    "fixed": "Replaced vocabulary with gustatory papillae (50-100 taste receptor cells each, 10,000 total, children have more than adults), five basic tastes (sweet/salty/sour/bitter/umami, Ikeda 1908), olfactory system (400 receptor types, 80% of flavor, 1 trillion smell combinations), taste receptor (molecular lock-and-key, evolutionary purpose of each taste). Rewrote activity to test all five tastes with explanations, nose-pinch olfactory experiment, and mechanoreceptor texture identification."
  },
  "knowledge/teaching-and-demonstration-physical-skills-creative-techniques-social-behaviors-learning-concepts.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was generic (demonstrate, model, technique, instruct). No cognitive science of teaching — no protégé effect, no metacognition, no explanation of WHY teaching strengthens learning. Activity was pure role-play as \"teacher\" with zero intellectual content about how learning works.",
    "fixed": "Replaced vocabulary with protégé effect (scientific observation that teaching makes you learn better), metacognition (thinking about your own thinking), scaffold (support that can be gradually removed), and technique (refined definition). Rewrote summary with learning science. Updated introduction to name the protégé effect explicitly. Rewrote activity flow to name metacognition during explanation and scaffolding during the learning phase. Updated age adaptations to use all new vocabulary in context."
  },
  "knowledge/team-activities-and-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "All everyday vocabulary (cooperation, coordination, sportsmanship, teamwork). No exercise physiology, no game theory, no muscle anatomy, no cardiovascular science. Activity was \"play ball and be nice\" with no intellectual content.",
    "fixed": "Replaced vocabulary with collective action (game theory, ant colony example), cardiovascular system (heart rate 80→180 bpm, oxygen delivery), strategy (prefrontal cortex planning, constant updating), quadriceps (four muscles, antagonist pair with hamstrings). Rewrote activity with pre/post heart rate measurement, muscle naming during warmups, biomechanics narration during skill practice, and collective action analysis during team play. Added heart rate journaling, strategy replay, and animal collective action comparisons for 3-4+."
  },
  "knowledge/technology-experimentation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday words (\"technology,\" \"device,\" \"explore\"). No explanation of how anything works — pure button-pressing. Suggested \"technical language\" for 3-4+ was \"battery\" and \"button.\"",
    "fixed": "Replaced vocabulary with circuit, input/output, sensor, processor. Added real explanations of how electricity flows through circuits when buttons close them. Updated activity prompts and age adaptations with real technical content."
  },
  "knowledge/test-and-quiz-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Entirely process-focused — how to run a quiz with zero intellectual content. Questions used as examples were basic object identification (Is this a dog?). No learning science — no testing effect, no retrieval practice, no spaced repetition. Vocabulary was synonyms for \"answering\" (question, answer, challenge, discover).",
    "fixed": "Replaced vocabulary with retrieval practice/testing effect (memory strengthened by retrieval, not re-exposure), multiple choice vs. recall distinction, spaced repetition (spreading practice over time for durability). Rewrote summary with actual learning science. Updated introduction to explain the testing effect to children. Updated wrap-up to connect each retrieved memory to the neuroscience. Updated age adaptations to name multiple choice vs. recall as different retrieval difficulty levels."
  },
  "knowledge/theater-and-drama.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary mostly everyday words (character, stage, expression, ensemble). No theater history, no Aristotle's dramatic arc, no cognitive science of pretend play, no vocal projection anatomy. Activity was dress-up play with no theater science.",
    "fixed": "Replaced vocabulary with dramatic arc (Aristotle 335 BCE, setup/rising action/climax/resolution), theory of mind (prefrontal cortex, imagining others' mental states), projection (diaphragm technique, Greek amphitheaters held 14,000 with no microphones), suspension of disbelief (Coleridge 1817). Rewrote activity to teach dramatic arc structure, mirror neuron awareness, and projection technique. Added bunraku, wayang, and commedia dell'arte for 3-4+."
  },
  "knowledge/time-and-duration-physical-cycles-human-experience-sequences-measurement.md": {
    "verdict": "PASS",
    "issues": "Already rigorous — vocabulary includes oscillation (with atomic clock specification: 9,192,631,770 cesium vibrations = 1 second), circadian rhythm, entropy (as physics of time's arrow), interval. Parent notes include excellent response to \"where does time go?\" covering entropy and Einstein's relativity. Activity connects sand timers to atomic clock oscillations. One gap: no explanation of why minutes have 60 seconds",
    "fixed": "Added sexagesimal vocabulary entry (Babylonian base-60 counting system, why 60 divides so evenly, counting to 12 on finger joints); added brief mention in activity flow connecting the Babylonian system to modern clock reading"
  },
  "knowledge/tool-use-and-maintenance.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Template instruction still visible in vocabulary section (lines 9-13). Vocabulary was practical/social terms only (purpose, maintain, responsibility, durable). No mechanics — no simple machines, no levers, no wedges, no mechanical advantage. Activity taught tool handling without any physics of how tools work.",
    "fixed": "Removed template instruction. Replaced vocabulary with simple machine (all six types), lever, wedge, mechanical advantage, maintain. Rewrote activity introduction to explain most tools as simple machines or combinations. Updated discovery section to identify simple machines in each tool (spoon as lever, scissors as lever + wedge, magnifying glass as lens refracting light). Updated video recommendation."
  },
  "knowledge/traditional-games-and-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all everyday words (strategy, tradition, technique, heritage). No anthropology, no cultural transmission science, no game theory, no proprioception. Activity was playing hopscotch with cultural labels.",
    "fixed": "Replaced vocabulary with cultural transmission (knowledge passed between generations, hopscotch from Roman soldiers), oral tradition (7,000+ year accuracy of Aboriginal stories), proprioception (sixth sense, cerebellar balance feedback), game theory (von Neumann 1928, strategic interaction in tag). Rewrote age adaptations with proprioception training, cultural transmission narration, and game theory analysis."
  },
  "knowledge/traditions-and-celebrations.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all everyday words (tradition, celebrate, ritual, gather). No anthropology, no evolutionary function of ritual, no cross-cultural comparison, no neuroscience of communal bonding.",
    "fixed": "Replaced vocabulary with ritual (universal in all human cultures, oxytocin/endorphin release during performance), cultural transmission (cumulative knowledge transfer across generations), solstice (23.5° axial tilt, astronomical basis of winter celebrations worldwide), oxytocin (bonding hormone, increased trust/generosity during group activities). Rewrote activity to explain oxytocin science, compare celebrations across cultures, and trace solstice origins. Added Kinderfest history and ritual psychology research for 3-4+."
  },
  "knowledge/transportation-methods.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary only covered transport/vehicle/propel/route with no science. Activity was pure themed play (sort by wheels/wings, make vroom sounds). No mention of buoyancy (why boats float), lift/aerodynamics (why planes fly), combustion or electric motors (how cars are propelled), or friction (why wheels work). 2-3 year adaptation explicitly said \"keep language simple: Car goes zoom! Zoom, zoom!\"",
    "fixed": "Added vocabulary: propulsion (combustion, electric motor, jet propulsion via Newton's 3rd law), buoyancy (Archimedes' principle, water displacement), lift (Bernoulli's principle, wing curvature), friction (rolling vs. sliding, steel-on-steel efficiency), infrastructure. Updated activity with three science experiments: buoyancy water test (floating/sinking, foil boat engineering), lift wing demonstration, ramp friction exploration. Updated discovery questions to probe mechanisms. Fixed 2-3 adaptation to use real terms during play. Added challenge about engine combustion with real answer (\"piston,\" \"ignition,\" \"combustion\")."
  },
  "knowledge/transportation-planning-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Activity overview framed the lesson as \"themed play with a toy car\" — no graph theory, no logistics science, no route optimization framework.",
    "fixed": "Reframed activity as legitimate graph theory and logistics exercise: networks (nodes and edges), route optimization, the Traveling Salesman Problem (one of math's most famous unsolved problems, intuitively experienced when choosing stop order). Updated activity type descriptor."
  },
  "knowledge/travel-planning-and-booking-simulation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Purely procedural role-play (pack a suitcase, make fake tickets) with no geographic, economic, or logistical content",
    "fixed": "Added time zones, GPS navigation, transportation infrastructure, and logistics vocabulary; discovery questions now include real distance/time concepts, climate-latitude connections, and basic economics of air travel"
  },
  "knowledge/tutoring-and-coaching-activities.md": {
    "verdict": "PASS",
    "issues": "Exceptional — protege effect with neural explanation; scaffolding cites Lev Vygotsky 1930s with zone of proximal development; mirror neurons discovered in 1990s macaque monkeys by Italian neuroscientists; metacognition with prefrontal cortex development timeline (ages 2-7); \"different neural pathways\" in age adaptations",
    "fixed": "N/A"
  },
  "knowledge/understanding-others'-feelings-empathy.md": {
    "verdict": "PASS",
    "issues": "Outstanding — vocabulary covers mirror neurons (premotor cortex, macaque monkey origin, neural firing mechanism), theory of mind (false belief task, developmental timeline 2-5 years, prefrontal cortex/temporoparietal junction), oxytocin (hypothalamus production, pituitary release, amygdala calming mechanism), emotional contagion (facial feedback loop), FACS with specific muscle names (zygomaticus major, corrugator supercilii, depressor anguli oris). Activity connects every element to real neuroscience. Age adaptations correctly preserve real vocabulary at all levels.",
    "fixed": "N/A"
  },
  "knowledge/underwater-and-marine-exploration.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "\"Observe\" (everyday word) and \"Transparent\" (non-scientific) in vocabulary. No marine biology — no photosynthesis, no bioluminescence, no ocean zones (photic/aphotic), no gill science. Activity was water-play with plastic fish with no scientific content.",
    "fixed": "Replaced \"Observe\" with photosynthesis (phytoplankton produce 50% of Earth's oxygen, base of ocean food web). Replaced \"Transparent\" with bioluminescence (luciferin + oxygen reaction, 90% of deep-sea animals, cold light). Enhanced Submarine definition with ballast tank mechanics. Added Habitat definition with ocean zones (photic 0-200m vs. aphotic below 200m). Rewrote discovery section with photic/aphotic zones and bioluminescence content."
  },
  "knowledge/vehicle-operation-simulation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was purely game-role words (operate, steering, accelerate, route) with no physics or engineering. No explanation of how vehicles actually work — no combustion, friction, inertia, transmission, or momentum. Activity was pure dramatic play with zero science.",
    "fixed": "Replaced vocabulary with combustion (internal combustion engine physics), friction (tires/road grip, brake pad mechanics, kinetic energy conversion), inertia (Newton's First Law, seatbelt function), transmission (gear ratios, power transfer), momentum (mass × velocity, stopping distance). Rewrote introduction to explain combustion engines vs. electric motors and the physics behind stopping at signs (friction + distance)."
  },
  "knowledge/video-games-and-digital-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary had only 4 terms (interface, navigate, interact, respond) — all purely behavioral with no technical content. No mention of how touchscreens work, what a processor is, what pixels are, how sound is generated, or what frame rate is.",
    "fixed": "Replaced vocabulary with 11 technical terms: touchscreen/capacitive sensing (electrical charge grid, finger conductivity), pixel (RGB LEDs, 16M colors), processor/CPU (millions of instructions/second, 30-60fps), algorithm (if-then instructions), code/programming (Python/C++/JavaScript), digital sound synthesis (DAC, frequency, amplitude), frame rate (30fps, persistence of vision). Rewrote introduction to explain capacitive sensing and processor before first tap."
  },
  "knowledge/visual-arts-and-design.md": {
    "verdict": "PASS",
    "issues": "Already had strong vocabulary with genuine science: pigment (light wavelength absorption/reflection, historical pigments — ochre, lapis lazuli, cochineal), subtractive color mixing (accurate wavelength explanation), negative space (Rubin's vase, rod cells). Activity integrated color science throughout. Minor improvements made: added composition and complementary colors to vocabulary, removed meta-instruction from video section, strengthened wrap-up with concept review.",
    "fixed": "Minor improvements only — added composition (rule of thirds, visual path) and complementary colors (opposing cone cell stimulation) to vocabulary. Removed \"Try to find an actual video\" meta-instruction. Added concept-review wrap-up."
  },
  "knowledge/weather-and-seasons.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Had real meteorological terms (temperature, precipitation, atmosphere) but never explained the mechanisms behind weather phenomena. No water cycle, no axial tilt, no cloud formation science.",
    "fixed": "Replaced vocabulary with water cycle (evaporation/condensation/precipitation cycle), axial tilt (23.5° tilt is WHY seasons exist), condensation (water vapor to liquid, cloud formation), barometric pressure (Torricelli 1643, high pressure = clear, low = rain). Rewrote stations: water cycle demo with warm water and cold plate, cloud types, axial tilt explanation, chlorophyll/anthocyanin in fall leaves."
  },
  "knowledge/woodworking-child-safe.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary was everyday (grain, texture, craftsperson, stabilize). No wood science (growth rings, cellulose), no physics of tools (hammer as lever, nail as wedge). Activity was sanding and hammering with no explanation of how anything works.",
    "fixed": "Replaced vocabulary with grain (cellulose fibers — former water transport tubes), growth rings (annual growth patterns, dendrochronology), wedge (simple machine — nail concentrates force on tiny area), lever (hammer amplifies arm force through mechanical advantage). Rewrote activity to include growth ring counting, hardwood vs. softwood comparison, sandpaper mineral science (aluminum oxide), and simple machine identification. Added all six simple machines, wood glue mechanics, and hardwood cathedral comparison for 3-4+."
  },
  "knowledge/word-games-and-language-puzzles.md": {
    "verdict": "PASS",
    "issues": "Vocabulary uses real linguistics terminology (phonemic awareness, syllable, alliteration). Activities involve genuine phonological work — the skill itself IS the intellectual content.",
    "fixed": "N/A"
  },
  "knowledge/work-and-occupations.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary missed core economic concepts (\"occupation,\" \"tool,\" \"uniform,\" \"responsibility\"). No division of labor, no specialization, no economic interdependence. Activity was tool-matching with no intellectual content. Song section had generator's revision notes visibly embedded in the markdown.",
    "fixed": "Replaced vocabulary with occupation, specialization, division of labor (with pencil example — dozens of workers), economy. Cleaned up garbled song section. Rewrote introduction with the \"how many people does a pencil take?\" hook. Updated discovery section with why specialization leads to better outcomes."
  },
  "knowledge/writing-and-mark-making.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Vocabulary all everyday words (scribble, mark-making, expression, trace). No neuroscience of motor control, no writing system history, no pigment/ink science. Purely procedural with no intellectual content.",
    "fixed": "Replaced vocabulary with motor cortex (34 hand muscles, motor neuron control), grapheme (Phoenician origin of letters, writing invented 5,400 years ago in Mesopotamia), pigment (light wavelength absorption, paraffin wax vs liquid ink vs graphite), myelination (nerve insulation, 100x signal speed, improves with practice). Rewrote activity to explain pigment science of each tool, friction effects, and capillary action in markers. Added cuneiform history and cross-cultural writing systems for 3-4+."
  },
  "physical/aikido-and-redirecting-force.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section; summary promised physics concepts (momentum, direction, balance) but none were taught; no anatomy; coaching cues were 100% nature metaphors (\"move like water,\" \"root of a tree\") with zero physics or anatomy; the lesson is explicitly about redirecting force but never defines force, momentum, or vector.",
    "fixed": "Added full vocabulary section: force/momentum/vector/center of mass/base of support (physics), proprioception/vestibular system/core muscles/hip external rotators/gluteus medius (anatomy), aiki/irimi/tenkan (authentic aikido terminology). Rewrote introduction to explain physics of redirection; replaced all metaphor-only coaching cues with anatomical and physics references."
  },
  "physical/american-football-and-tackle-games.md": {
    "verdict": "PASS",
    "issues": "Excellent rigor: accurate vocabulary (angular momentum, projectile, deltoid, proprioception), physics explanations (parabolic arc, 9.8 m/s², kinetic chain), and activity instructions consistently use technical terms; one of the strongest lessons in the set",
    "fixed": "N/A"
  },
  "physical/archery-and-target-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No projectile physics, no trajectory science, no muscle anatomy, no visual cortex processing. Coaching cues were generic encouragement.",
    "fixed": "Added full vocabulary section: projectile (parabolic arc, gravity + air resistance), trajectory (cerebellar prediction), deltoid (three sections), proprioception (muscle spindles, Golgi tendon organs), visual cortex (V5/MT motion detection). Rewrote coaching cues with physics and neuroscience."
  },
  "physical/badminton-and-shuttlecock-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section; shuttlecock's unique aerodynamic properties (drag, self-righting) — the most distinctive thing about badminton — were never mentioned; no muscle names; no visual neuroscience despite tracking being a stated focus; coaching cues were entirely motivational or metaphorical.",
    "fixed": "Added full vocabulary section: shuttlecock/aerodynamic drag/self-righting/trajectory, rotator cuff/deltoid/wrist extensors and flexors/biceps/serratus anterior, visual tracking/binocular depth perception/hand-eye coordination, impulse/gravity. Enriched introduction to explain the shuttlecock's unique aerodynamic self-righting physics."
  },
  "physical/balance-and-stability-training.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No vestibular system, center of gravity, muscle names. Coaching cues were generic encouragement with no science.",
    "fixed": "Added full vocabulary section: vestibular system (semicircular canals, fluid-based rotation detection), center of gravity (balance point over base of support), proprioception (muscle spindles, Golgi tendon organs, joint receptors → cerebellum), core muscles (transverse abdominis, rectus abdominis, obliques, erector spinae). Rewrote coaching cues with tibialis anterior/gastrocnemius antagonist pair, vestibular reference points, and counterbalance physics."
  },
  "physical/baseball-and-softball.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No kinetic chain, no projectile motion physics, no binocular vision, no muscle anatomy. Coaching cues were motivational with no science.",
    "fixed": "Added full vocabulary section: kinetic chain (sequential force transfer), projectile motion (parabolic arc, gravity + drag), cerebellum (timing coordinator, 50% of neurons), binocular vision (stereopsis, depth perception), rotator cuff (four stabilizing muscles). Rewrote coaching with biomechanics and neuroscience."
  },
  "physical/basketball-and-hoop-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No parabolic arc, launch angle, or kinetic chain physics. No muscle anatomy. Coaching cues were generic.",
    "fixed": "Added full vocabulary section: parabolic arc (gravity + launch force), launch angle (optimal 45-55°), deltoid (three sections), quadriceps (four muscles, power generation), proprioception (muscle spindles, Golgi tendon organs). Rewrote coaching with shot physics and biomechanics."
  },
  "physical/beach-volleyball-and-sand-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Proprioception mentioned in summary but never defined or explained; missing physics of why sand is harder to move on; forearm pass technique not explained mechanically.",
    "fixed": "Added full definition of proprioception with explanation of sand's unstable, energy-absorbing properties and their training benefit; added sand resistance physics in warm-up notes; explained forearm pass surface area mechanics"
  },
  "physical/bilateral-coordination-exercises.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all; neuroscience of bilateral coordination nearly absent (corpus callosum, contralateral control, lateralization, myelination not mentioned)",
    "fixed": "Added complete vocabulary section with corpus callosum, contralateral control, lateralization, motor cortex, myelination, bilateral definitions; added Key Concepts section covering why midline crossing is neurologically significant, corpus callosum development timeline, occupational therapy connection, cerebellum automatization of motor learning; updated Introduction and Challenge sections to use technical terms accurately"
  },
  "physical/bobsledding-and-speed-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No physics (inertia, aerodynamics, drag) or physiology (fast-twitch fibers) content; bobsled framing was thin theme over generic running activity",
    "fixed": "Added physics/physiology section covering inertia, aerodynamics, drag, fast-twitch muscle fibers, motor synchronization; enriched introduction to explain why push phase decides the race; added aerodynamics experiment (crouch vs upright); connected synchronized push to additive force"
  },
  "physical/body-awareness-and-proprioception.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "physical/bowling-and-precision-rolling.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No physics of rolling — no momentum, friction, force transfer, trajectory. Coaching cues were generic (\"soft and smooth\") with no science content.",
    "fixed": "Added full vocabulary section: momentum (mass × velocity, Newton's First Law), friction (surface resistance, coefficient), force transfer (momentum transfer at impact, chain reactions), trajectory (path prediction, cerebellar learning). Rewrote coaching cues with muscle names (deltoids, latissimus dorsi, flexor digitorum), energy conversion, and Newton's laws."
  },
  "physical/boxing-and-striking-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No science of striking: missing F=ma, kinetic chain (why hip rotation generates power), Newton's Third Law (why form protects you), boxing's ancient history",
    "fixed": "Added boxing history (ancient Greek Olympics 688 BC), F=ma and kinetic chain physics in activity summary, Newton's Third Law in introduction; explains why hip rotation generates more force and why wrist alignment protects the striker"
  },
  "physical/brazilian-jiu-jitsu-and-ground-fighting.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Mentions leverage but never explains the physics; missing proprioception, center of gravity, BJJ history (Gracie family, Judo origins, philosophy of smaller defeating larger), mechanical advantage",
    "fixed": "Added BJJ history (Maeda, Gracie family, Judo lineage), physics of leverage and mechanical advantage, proprioception concept, center of gravity explanation in skill breakdown; added Archimedes reference for intellectual depth"
  },
  "physical/calisthenics-and-bodyweight-exercises.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. Line 94 explicitly stated \"Gentle engagement of core (without saying technical words)\" — directly rejecting the intellectual rigor philosophy. No muscle names, no physics of leverage, no neuroscience.",
    "fixed": "Added full vocabulary section: quadriceps/hamstrings (antagonist pair, eccentric/concentric contraction), bodyweight leverage (moment arm, angle changes difficulty), motor cortex (motor map/homunculus, myelination), core muscles (transverse abdominis, rectus abdominis, obliques, erector spinae). Rewrote all movements with specific muscle names, leverage physics, and motor cortex science. Removed the anti-rigor instruction."
  },
  "physical/camping-and-outdoor-living-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No physics of shelter construction (what makes a roof shed rain, natural anchor points). No nature literacy — \"animal watching\" was \"shhh, be very quiet\" with no content about tracks, calls, or animal evidence. No Leave No Trace principles beyond \"be safe.\" Coaching cues were positional with no science.",
    "fixed": "Rewrote summary with real outdoor skills context. Updated shelter-building section to explain sloped-roof rain-shedding, natural branch anchor points (V-shaped forks), and Leave No Trace (take only fallen materials). Updated campfire section to explain teepee vs. log-cabin fire shapes (airflow physics). Replaced hollow \"animal watching\" with real naturalist content: tracks, nibbled food, alarm bird calls, burrows, and common backyard animal evidence. Updated 3-4+ adaptations with real nature literacy vocabulary (deciduous, camouflage, habitat, foraging)."
  },
  "physical/capture-the-flag-and-territory-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No cardiovascular physiology, no energy systems, no strategic thinking neuroscience, no proprioception.",
    "fixed": "Added full vocabulary section: cardiovascular system (80→150+ bpm, oxygen delivery), strategic thinking (prefrontal cortex, anticipating opponents), proprioception (sixth sense, balance during direction changes), anaerobic vs. aerobic (two energy systems, 10-30 second sprint limit). Rewrote introduction with energy system switching, cardiovascular warm-up awareness, and strategic thinking prompts."
  },
  "physical/cheerleading-and-acrobatic-movements.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No real vocabulary or body science. No center of gravity, no vestibular system, no angular momentum, no real gymnastics terms (tuck position). Coaching cues were motivational (\"we're strong and brave\") with no scientific content.",
    "fixed": "Rewrote summary with center of gravity (tuck position physics, figure skater analogy), vestibular system and proprioception as real concepts named during balance. Updated tuck position instruction to explain the physics. Updated coaching cues to name center of gravity, vestibular system in action, and proprioception. Updated dizziness Common Challenge to explain semicircular canal fluid mechanics."
  },
  "physical/climbing-and-balancing-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section, no muscle names, no anatomy, no physiology. Warm-up cues said \"wake up our legs\" without naming quadriceps, glutes, or tibialis anterior. Coaching cues were purely procedural with no biomechanical explanation. No mention of center of gravity, vestibular system, proprioception, or Newton's Third Law. Vestibular system appeared once in challenges section but was never taught to children.",
    "fixed": "Added full vocabulary section: quadriceps, gluteus maximus, core muscles, gastrocnemius, tibialis anterior; center of gravity, vestibular system (semicircular canals), proprioception, Newton's Third Law, bilateral coordination. Rewrote warm-up cues to name specific muscles. Rewrote coaching cues with anatomical and biomechanical language. Rewrote cool-down to name hamstrings, gastrocnemius, diaphragm, and parasympathetic nervous system."
  },
  "physical/color-guard-and-flag-work.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. No muscle names in coaching cues or warm-up. Coaching cues were entirely behavioral (\"hold lightly like a bird,\" \"let the flag flow\"). No physics or art terms. No biomechanics of circular and pendulum movements.",
    "fixed": "Added full vocabulary section: deltoid (three heads), rotator cuff (four named muscles), wrist extensors and flexors, bilateral coordination, proprioception, motor learning/muscle memory, core stabilizers (transversus abdominis, multifidus); plus physics terms: momentum, angular momentum, centripetal force, choreography. Rewrote coaching cues with forearm muscle and centripetal force explanations."
  },
  "physical/competitive-swimming-and-racing.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "physical/coordination-and-agility-training.md": {
    "verdict": "PASS",
    "issues": "Already had strong vocabulary section (motor cortex, cerebellum, center of gravity, vestibular system) and coaching cues with real anatomy (quadriceps, deltoids, muscle spindles, semicircular canals). Activities grounded in neuroscience.",
    "fixed": "N/A"
  },
  "physical/cricket-and-bat-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. No kinetic chain, no hand-eye coordination neuroscience, no momentum physics, no cricket history despite being a culturally specific sport. Coaching cues were motivational with no science.",
    "fixed": "Added vocabulary: kinetic chain (feet→hips→torso→arm, professional speeds >100 km/h), hand-eye coordination (V5/MT visual cortex 150ms, cerebellum trajectory prediction, 34 hand muscles), momentum (mass × velocity, why bat weight and swing speed both matter), cricket history (16th century England, British Empire spread, 2.5B fans, second most popular sport). Updated coaching cues with kinetic chain and cerebellar learning."
  },
  "physical/cross-lateral-movement-exercises.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Good developmental science (vestibular system, mirror neurons, homolateral stages) but never named corpus callosum or contralateral brain control — the central anatomical concepts",
    "fixed": "Added corpus callosum (250M nerve fibers connecting hemispheres), contralateral control (left brain controls right body side), and bilateral brain activation to summary, warm-up purpose, introduction, and coaching language"
  },
  "physical/curling-and-precision-ice-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "physical/cycling-and-bike-riding.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No physics of cycling — no gyroscopic effect, no center of gravity, no muscle anatomy, no simple machine explanation. Activity was purely procedural pedaling instruction.",
    "fixed": "Added full vocabulary section: gyroscopic effect (spinning wheel resists tipping — angular momentum), center of gravity (must stay over base of support between wheel contact points), quadriceps/hamstrings (antagonist pair powering downstroke and upstroke), wheel and axle (simple machine — small axle rotation creates large wheel rotation for distance multiplication). Rewrote coaching cues with muscle names, gyroscopic stability explanation, target fixation, and center of gravity mechanics."
  },
  "physical/dance-and-rhythmic-movement.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No music science, no anatomy, no neuroscience. Coaching cues were motivational with no science content.",
    "fixed": "Added full vocabulary section: tempo (BPM, auditory cortex detection), entrainment (automatic synchronization, nearly unique to humans — cockatoos and sea lions), dynamics (pianissimo to fortissimo, Italian musical terms), vestibular system (semicircular canals, fluid mechanics of dizziness, ballet spotting technique). Rewrote coaching cues with muscle names (gluteus maximus, quadriceps, deltoids), entrainment awareness, and dynamics exploration."
  },
  "physical/dance-choreography-and-routines.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Solid structural content (session flow, safety, age adaptations) but taught \"follow movements to music\" rather than actual choreography. No choreographic vocabulary or concepts: motif, spatial levels, dynamics (sharp vs. flowing), 8-count phrasing, canon, unison vs. contrast.",
    "fixed": "Rewrote summary with real choreographic framing (space/time/energy). Updated introduction to teach 8-count phrasing, spatial levels (high/medium/low), and motif. Rewrote skill practice to build choreography using a recurring motif, contrasting movement, and dynamic variation. Updated 3-4+ adaptations with canon, unison vs. contrast, and child-invented motifs."
  },
  "physical/diving-and-underwater-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No physics of water, no anatomy of breathing, no dive reflex neuroscience. \"Take a deep breath\" without explaining diaphragm mechanics.",
    "fixed": "Added full vocabulary section: buoyancy (Archimedes, lung inflation changes density), mammalian dive reflex (heart rate slows 10-25%, blood redirects), hydrostatic pressure (1 atm per 10m depth), diaphragm (dome-shaped breathing muscle). Rewrote introduction with buoyancy control through breathing, dive reflex explanation, and diaphragm mechanics."
  },
  "physical/dodgeball-and-throwing-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No physics of throwing or catching. No parabolic arc, no projectile motion, no momentum, no hand-eye coordination neuroscience. Coaching cues were generic (\"swing your arm like a pendulum\") with no underlying physics explained. \"Hand-eye coordination\" named but mechanism never explained.",
    "fixed": "Rewrote summary with projectile physics (parabolic arc, gravity + forward momentum), the catching challenge (3D trajectory prediction as a real neural computation), and the explanation that struggling to catch isn't failure but a complex calculation. Updated skill breakdown to explain arc differences between throw types and that catching is prediction. Updated coaching cues to include \"watch it the whole way — your brain needs the arc to predict landing\" and \"soft throw = gentle arc, hard throw = fast flat line.\""
  },
  "physical/drum-line-and-marching-band.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all; no acoustics content (how drums produce sound via vibration and resonance); no music theory terms; no cultural/historical context for drum lines",
    "fixed": "Added full vocabulary section with percussion, resonance, tempo, meter, vibration; added acoustics explanation (membrane vibration, resonating chamber) to introduction; added historical context about military drum lines"
  },
  "physical/endurance-and-cardiovascular-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section; activity had zero content about the cardiovascular system, heart physiology, aerobic exercise, or why cool-down matters — pure game mechanics with generic encouragement",
    "fixed": "Added vocabulary section with cardiovascular system, heart rate, aerobic, endurance, vasodilation, lactic acid; rewrote introduction to explain heart as a muscle, demonstrate pulse before/after exercise; upgraded coaching cues to use real terms; added physiological explanations to cool-down (lactic acid clearance, blood pooling prevention); upgraded 2-3 adaptation to make heartbeat tangible"
  },
  "physical/fencing-and-sword-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No fencing history, no biomechanics, no reaction time neuroscience, no muscle anatomy. Coaching cues were metaphorical (\"hold like a magic wand\") with no science.",
    "fixed": "Added full vocabulary section: reaction time (150-300ms neural pathway, myelination), lunge (quadriceps/gastrocnemius biomechanics, Newton's Third Law), en garde (center of gravity, co-contraction), fencing history (Bronze Age through 1896 Olympics, electronic scoring circuits). Rewrote coaching cues with specific muscle names and neuroscience."
  },
  "physical/figure-skating-and-ice-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. No physics of ice — \"knees bent\" without explaining center of gravity, no friction coefficient, no momentum. Generic coaching cues with no science.",
    "fixed": "Added vocabulary: friction (ice's 0.003 coefficient, liquid-like surface layer), center of gravity (why bent knees stabilize), momentum (why stopping on ice takes planning), blade edge (edge-vs-glide mechanics). Rewrote introduction to explain ice friction and center of gravity. Updated coaching cues with physics language."
  },
  "physical/figure-skating-and-ice-dance.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No explanation of why ice is slippery, how blade edges work, or physics of spins; never explained why it's called \"figure skating\" (tracing geometric figures); coaching language was fluffy (\"imagine you're a beautiful swan\"); no physics vocabulary",
    "fixed": "Added vocabulary: blade edge, angular momentum, ice surface slipperiness, compulsory figures, arabesque; rewrote intro to cover 4,000-year history of skating and origin of \"figure skating\" as tracing geometric figures; replaced fluffy coaching cues with physics-based ones (feel which edge, what happens when arms pull in, why ice is slippery)"
  },
  "physical/fine-motor-skill-development.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Entirely procedural — no neuroscience content despite being about brain-muscle coordination",
    "fixed": "Added myelin/myelination, neuroplasticity, motor cortex, cerebellum, proprioception, corticospinal tract, synaptic strengthening"
  },
  "physical/fishing-and-angling-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section; all caregiver language was pure praise/encouragement with zero biology of fish or science of fishing; word \"angling\" never explained; no mention of fish anatomy (gills, fins, cold-blooded), aquatic habitats, or how lures work",
    "fixed": "Added angling etymology and explanation (hook-and-line, lures vs. bait) to intro; updated demonstration script to explain fish anatomy (gills, fins, cold-blooded vertebrates) and why fish are attracted to lures (prey mimicry); replaced all-praise caregiver prompts with habitat, predator/prey, vertebrate, gills vocabulary woven into encouragement"
  },
  "physical/geocaching-and-treasure-hunting.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. No GPS/satellite science, no cartography, no spatial reasoning neuroscience, no cardinal directions. Activity was \"look for hidden things\" with no navigation framework. Coaching cues were generic (\"use your eyes like a detective\").",
    "fixed": "Added full vocabulary section: GPS (24+ satellites, trilateration, speed of light, 3M+ active geocaches), cartography (scale, legend, bird's-eye perspective, cognitive maps), spatial reasoning (hippocampus, parietal lobe, London taxi driver research), cardinal directions (Earth's poles, magnetic field, Sun position). Rewrote warm-up with cardinal direction orientation and landmark mapping. Rewrote coaching with systematic search techniques and map-based navigation. Added compass introduction, dead reckoning, coordinate grids, and surveying by pacing for 3-4+."
  },
  "physical/golf-and-putting-games.md": {
    "verdict": "PASS",
    "issues": "Excellent vocabulary: pendulum (Galileo's chandelier discovery ~1600, swing speed depends on arc not weight), kinetic energy transfer (½mv² formula, Newton's Third Law, energy as sound/heat/motion), rolling resistance (ball deformation, energy-to-heat conversion, professional green-reading), proprioception (muscle spindles, Golgi tendon organs, cerebellar calibration). All four terms actively deployed in coaching cues.",
    "fixed": "N/A"
  },
  "physical/gross-motor-skill-practice.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No muscle names, no anatomy, no neuroscience of motor control. Purely procedural (\"jump, crawl, throw\") with coaching cues like \"arms out like an airplane\" and no explanation of what's happening physiologically.",
    "fixed": "Added full vocabulary section: motor cortex (body map, electrical signals to muscles), cerebellum (50% of brain's neurons, error correction, motor learning), quadriceps/hamstrings (antagonist pairs, extension/flexion), proprioception (muscle/tendon/joint sensors, sixth sense). Rewrote coaching cues with muscle names and brain regions. Added muscle-specific naming to all age adaptations."
  },
  "physical/gymnastics-and-tumbling.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No physics of rolling (angular momentum), no vestibular system science (why rolling causes dizziness), no anatomy (which muscles stabilize the spine). Coaching was positional instruction with no underlying science.",
    "fixed": "Added full vocabulary section: angular momentum (tuck tighter = spin faster, conservation principle — same as figure skaters), center of gravity (must stay over base of support for balance), vestibular system (semicircular canals, fluid mechanics of dizziness), core muscles (transverse abdominis, rectus abdominis, obliques, erector spinae — spine stabilization). Rewrote coaching cues with spinal anatomy, angular momentum explanation, vestibular fluid dynamics, and arm-extension balance physics. Added vestibular adaptation timeline and \"spotting\" technique to dizziness solution."
  },
  "physical/hand-eye-coordination-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. No visual cortex, motor cortex, cerebellum, or trajectory prediction neuroscience despite the topic being inherently neuroscientific.",
    "fixed": "Added full vocabulary section: visual cortex (V1-V5, area V5/MT for motion detection, 150ms processing), cerebellum (50% of brain's neurons, trajectory prediction, error correction), binocular vision (stereopsis from two-eye image fusion, depth perception), motor planning (premotor cortex → primary motor cortex, 34 hand muscle sequencing). Rewrote coaching cues with cerebellar error feedback, binocular depth perception tests, and myelination explanation."
  },
  "physical/handball-and-court-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No projectile physics, no kinetic chain, no proprioception. Coaching cues were generic encouragement with no science.",
    "fixed": "Added full vocabulary section: projectile (parabolic arc, Galileo), trajectory (angle, speed, height), kinetic chain (sequential body segment energy transfer), proprioception (muscle/joint/tendon sensors, catches improve with practice). Rewrote introduction with parabolic arc demonstration, kinetic chain breakdown, and proprioception explanation."
  },
  "physical/hiking-and-nature-walks.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. No ecology, geology, or proprioception science despite being a nature activity. Coaching cues were generic encouragement with no scientific content.",
    "fixed": "Added full vocabulary section: proprioception (muscle/tendon/joint sensors, tibialis anterior and peroneal micro-adjustments on uneven terrain), ecosystem (producers/consumers/decomposers/nutrient cycling), photosynthesis (6CO₂ + 6H₂O → C₆H₁₂O₆ + 6O₂, chlorophyll absorbs red/blue reflects green), erosion (water moves 75B tons of soil/year, trail formation). Rewrote activities as ecosystem identification, photosynthesis hunts, geology walks, and sound mapping."
  },
  "physical/hockey-ice-and-field.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. No distinction between ice hockey and field hockey despite being in the title. No physics (friction coefficient of ice, why hockey players crouch = center of gravity). No biomechanics terms.",
    "fixed": "Added vocabulary section with stick handling, dribbling, friction, center of gravity, and ice hockey vs. field hockey distinctions. Updated Introduction & Demonstration to explain friction differences, center of gravity, and how stick design relates to upright body posture."
  },
  "physical/hunting-simulation-games.md": {
    "verdict": "PASS",
    "issues": "Good connection to animal behavior and observation skills. Appropriate for genre.",
    "fixed": "N/A"
  },
  "physical/ice-hockey-and-puck-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. Coaching cues were pure cheerleading (\"like a goose on the ice!\") with zero scientific content. No muscle names, no anatomy, no biomechanics, no physiology anywhere. Cool-down had no explanation of why cool-down matters physiologically.",
    "fixed": "Added full vocabulary section: proprioception on ice (vestibular recalibration, cerebellum), center of gravity and ice (quadriceps, hip flexors, blade stability), glide and friction (gluteus maximus, quadriceps, hip abductors, iliotibial band), core stability (transversus abdominis, multifidus, obliques), stick handling and bilateral coordination (corpus callosum, wrist flexors/extensors), reaction time (150-300ms, myelination). Rewrote cool-down to explain lactate clearance and parasympathetic activation."
  },
  "physical/ice-skating-and-rink-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No physics of why ice is slippery. The pressure-melts-ice myth is common but false — the quasi-liquid surface layer exists regardless of pressure. No blade edge mechanics (hollow grind, two edges), no skating history.",
    "fixed": "Added to summary: quasi-liquid surface layer (why the pressure myth is wrong; water molecules at ice surface are semi-liquid due to lack of neighbors above them), friction heat (thin water film during skating), blade edge mechanics (concave hollow grind creates two edges for grip and propulsion), 5,000-year history (bone blade skates from Finland). Updated introduction demonstration to explain the quasi-liquid layer and blade edges."
  },
  "physical/judo-and-throwing-arts.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Details not recorded.",
    "fixed": "Agent committed fixes."
  },
  "physical/jumping-hopping-and-movement-games.md": {
    "verdict": "PASS",
    "issues": "Uses \"bilateral coordination,\" \"explosive power.\" Appropriate technical depth for physical lesson.",
    "fixed": "N/A"
  },
  "physical/karate-and-striking-arts.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section; no etymology of 'karate'; no cultural/historical origin content; no biomechanics (torque, hip rotation); martial arts terms mentioned but not defined or taught",
    "fixed": "Added vocabulary section with martial arts, karate etymology (empty hand/Okinawa origin), kata, kiai, torque; added cultural history and torque explanation to introduction; added kiai practice to demonstration; expanded 3-4+ years section with kata, kiai, and Japanese dojo vocabulary"
  },
  "physical/kayaking-and-paddling-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. No physics (buoyancy, drag, lever mechanics), no anatomy (latissimus dorsi, deltoids, obliques), no Newton's Third Law. Coaching cues were generic (\"sit tall like a king,\" \"let your whole body help\") with no biomechanics or physics.",
    "fixed": "Added full vocabulary section: buoyancy (Archimedes' principle, displacement, life jacket mechanism), drag (800x denser than air, increases with speed squared), lever (paddle as lever — fulcrum, force, load), latissimus dorsi (primary power muscle, with deltoids, obliques, core). Rewrote coaching with torso rotation biomechanics, Newton's Third Law propulsion, drag awareness, and center of gravity stability. Added steering torque, hull design trade-offs, and drag-vs-speed experiments for 3-4+."
  },
  "physical/lacrosse-and-stick-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Generic \"stick pushing activity\" with no mention of lacrosse's origins, Indigenous history, or real vocabulary. Words \"crosse,\" \"pocket,\" \"cradling,\" or \"crease\" never appeared.",
    "fixed": "Added real lacrosse history (one of oldest North American sports, created by First Nations peoples, French name from la crosse = bishop's staff). Added vocabulary: crosse (the stick), pocket (the mesh net), cradling (rocking motion that keeps ball in pocket), crease (goal circle). Updated coaching cues to use \"crosse\" instead of \"stick\" and explain cradling. Added \"Real Lacrosse: What to Know\" section with sport facts."
  },
  "physical/martial-arts-and-self-defense.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No biomechanics, no anatomy, no martial arts history. Coaching was motivational with no science or cultural content.",
    "fixed": "Added full vocabulary section: kinetic chain (sequential force transfer feet→legs→hips→torso→arm, Newton's Third Law), center of gravity (wide stance physics, base of support), biomechanics (force = mass × acceleration, leg vs. arm muscle size comparison), discipline (3,000+ year history — Shaolin 500 CE, karate 1600s, judo 1882, taekwondo 1950s, capoeira 1500s). Rewrote coaching cues with kinetic chain explanation, hip rotation mechanics, and quadriceps/core muscle naming."
  },
  "physical/meditation-and-breathing-exercises.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No physiology — just \"breathe in, breathe out\" with no explanation of why it works. \"Calm your nervous system\" mentioned once but never explained. No anatomy of breathing.",
    "fixed": "Added vocabulary section with diaphragm, autonomic nervous system (sympathetic/parasympathetic), vagus nerve, heart rate variability. Rewrote all techniques to explain the physiology: diaphragm mechanics, vagus nerve stimulation through long exhales, parasympathetic activation. Added pulse-checking experiments and respiratory sinus arrhythmia for 3-4+."
  },
  "physical/mindful-walking-and-movement.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. No neuroscience of attention, proprioception, or sensory processing. Activity was \"walk slowly and look around\" with no scientific content.",
    "fixed": "Added full vocabulary section: proprioception (muscle/joint/tendon sensors), vestibular system (semicircular canals, utricle, saccule), prefrontal cortex attention (selective attention, directed focus), mechanoreceptors (Meissner's, Pacinian, Merkel's). Rewrote walking exercises as proprioceptive, mechanoreceptor, and sensory integration activities. Added vestibular challenges, sensory habituation, and backward walking for 3-4+."
  },
  "physical/mixed-martial-arts-basics.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. \"Punch from your whole body\" stated without explaining kinetic chain. No biomechanics, no martial arts history, no reaction time science.",
    "fixed": "Added vocabulary: kinetic chain (feet→legs→hips→torso→arm sequential force transfer), center of gravity (wide stance physics), reaction time (150-300ms, myelination), martial arts history (Shaolin 500 CE, judo 1882, capoeira 1500s, UFC 1993). Rewrote introduction and coaching cues with kinetic chain and center of gravity explanations."
  },
  "physical/mountain-biking-and-trail-riding.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Good practical structure but no physics or physiology; missing vestibular system/proprioception, gyroscopic effect, muscle groups named, center of gravity concept",
    "fixed": "Added vestibular system and proprioception explanation in warm-up; introduced gyroscopic stabilization effect; named quadriceps/hamstrings/glutes/core; explained visual-motor system; added lactic acid and cardiovascular recovery in cool-down"
  },
  "physical/movement-storytelling.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Purely procedural; no science backdrop; Hungry Caterpillar used with zero metamorphosis biology",
    "fixed": "Added embodied cognition, mirror neurons, narrative comprehension as intellectual backdrop; rewrote Caterpillar sequence with full metamorphosis biology (larva/pupa/chrysalis vs cocoon, molting, dissolution and rebuilding inside chrysalis)"
  },
  "physical/musical-theater-and-integrated-performance.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No music theory content. Mentions rhythm and beat interchangeably without distinction. No explanation of tempo, dynamics, major/minor keys, or how musical theater works as a storytelling form.",
    "fixed": "Added Key Concepts section covering beat vs rhythm distinction, tempo and dynamics (forte/piano), major vs minor keys and emotional effect, musical theater as story-song integration with ancient roots, and physical expression/posture. Rewrote skill practice section to incorporate music concepts."
  },
  "physical/nature-observation-and-wildlife-tracking.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No ecology (ecosystem, food chain), no tracking science (spoor, camouflage), no taxonomy, no sensory neuroscience. Activity was \"walk around and look at stuff\" with generic encouragement and no scientific framework.",
    "fixed": "Added full vocabulary section: ecosystem (producers/consumers/decomposers), camouflage (cryptic coloration, visual cortex contrast detection), spoor (tracks, scat, feathers — weight, speed, species identification), taxonomy (Linnaeus 1735, kingdom to species). Rewrote warm-up with sensory neuroscience and taxonomist stretches. Rewrote observation points with bird beak adaptation, chlorophyll/xylem/phloem in plants, ant pheromone trails, and decomposer ecology. Added food chain construction and dichotomous keys for 3-4+."
  },
  "physical/orienteering-and-navigation-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No real content about navigation; didn't explain what orienteering is, how compasses work, cardinal directions, cognitive maps/hippocampus, or why left/right is harder than forward/backward",
    "fixed": "Added orienteering as a sport; introduced compass and Earth's magnetic field; added cardinal directions tied to sun's position; explained hippocampus and cognitive maps; explained why left/right is neurologically harder; connected to GPS and historical navigation"
  },
  "physical/outdoor-obstacle-courses.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No physics, no anatomy, no neuroscience. Coaching was motivational with no scientific content.",
    "fixed": "Added full vocabulary section: proprioception (muscle spindles, Golgi tendon organs, joint receptors → cerebellum), motor planning (premotor cortex sequential muscle activation planning), friction (surface interlocking, rubber deformation, contact area), center of gravity (crouching lowers it, leaning shifts it). Rewrote coaching cues with proprioception awareness, motor planning identification, friction science, and center of gravity management."
  },
  "physical/paddleboarding-and-balance-on-water.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Summary mentioned \"balance proprioception\" but didn't explain mechanisms. No physics of why board floats (buoyancy, Archimedes), no propulsion physics (Newton's Third Law), no explanation of why water balance is harder than land balance (unstable surface, vestibular challenge). Coaching cues were purely procedural.",
    "fixed": "Rewrote summary to explain buoyancy (Archimedes' principle, displaced water force), Newton's Third Law (push water back → board moves forward), vestibular system on unstable surface (constant semicircular canal updates), and cerebellar coordination. Updated coaching cues to reference center of gravity, Newton's Third Law, vestibular system, and paddle as balance tripod."
  },
  "physical/performance-stunts-and-tricks.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section; all caregiver language was pure praise (\"you're so brave!,\" \"look how strong your muscles are!\"); no mention of center of gravity, vestibular system, proprioception, cerebellum, or any physics of balance/motion; why tucking chin protects the cervical spine never explained",
    "fixed": "Added key concepts (center of gravity, vestibular system, proprioception, bilateral coordination); rewrote introduction to explain center of gravity in stunts, vestibular system in ears as level sensor, proprioceptors as body-position sensors; replaced all-praise coaching cues with cervical spine protection explanation, vestibular/eye connection for balance, center of gravity awareness, cerebellum building new skill patterns"
  },
  "physical/pilates-and-core-strengthening.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No muscle names — said \"abdominal and back muscles\" without naming any. \"Keep your core tight\" without anatomical explanation. No physiology of breathing.",
    "fixed": "Added full vocabulary section: transverse abdominis (deepest core layer, Pilates \"powerhouse\"), rectus abdominis (six-pack muscle, spinal flexion), erector spinae (three muscles — iliocostalis, longissimus, spinalis — spinal extension), diaphragm (dome-shaped breathing muscle, negative pressure mechanism). Rewrote all exercises with specific muscle names at each step. Added isometric vs. isotonic contraction, antagonist pairs, and contralateral stabilization for 3-4+."
  },
  "physical/progressive-muscle-relaxation.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No physiology of why tension-then-release works. \"Feel how good relaxation feels\" with zero explanation. No muscle anatomy, no nervous system science.",
    "fixed": "Added full vocabulary section: muscle fiber (actin/myosin contraction mechanism, calcium signaling), Golgi tendon organ (autogenic inhibition reflex — the actual mechanism behind PMR), autonomic nervous system (sympathetic/parasympathetic branches), cortisol (adrenal glands, stress response, clinical reduction through PMR). Rewrote each body part exercise with specific muscle names (flexors, trapezius, corrugator supercilii, rectus abdominis, gastrocnemius) and Golgi tendon organ explanations. Added heart rate monitoring and antagonist pairs for 3-4+."
  },
  "physical/qigong-and-energy-exercises.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No anatomy or physiology. \"Energy flow\" referenced repeatedly but never scientifically grounded. No explanation of why slow breathing creates calm.",
    "fixed": "Added full vocabulary section: diaphragm (breathing mechanics, phrenic nerve), parasympathetic nervous system (vagus nerve pathway, cortisol reduction), proprioception (muscle/tendon/joint sensors, \"sixth sense,\" cerebellum feedback), fascia (connective tissue web, sensory nerve endings, hydration needs). Rewrote coaching cues with muscle names and nervous system explanations. Added heart rate measurement, respiratory sinus arrhythmia, and fascia rehydration for 3-4+."
  },
  "physical/reaction-time-and-quick-response-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "The activity described a signal-response loop without explaining what reaction time actually IS. No actual reaction time numbers, no neural pathway (sensory → brain → muscle), no explanation of why sound responses are faster than visual, no mention of how practice physically changes the brain.",
    "fixed": "Added actual reaction time numbers (250ms visual, 170ms auditory) to summary. Rewrote introduction to explain the full neural pathway (sensory organ → nerve → brain → motor command → muscle), nerve speed (up to 70 m/s), and ruler-drop test as a real reaction time measurement. Added sound-vs-sight comparison experiment. Updated skill breakdown to label each step of the neural process. Updated coaching cues to narrate brain activity during each signal. Added neural rewiring explanation for why practice improves reaction time."
  },
  "physical/relaxation-and-tension-release.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No physiology — just \"breathe in, breathe out, feel relaxed.\" Mentioned \"calming nervous system\" once with zero explanation. No anatomy of stress or relaxation.",
    "fixed": "Added full vocabulary section: autonomic nervous system (sympathetic/parasympathetic), muscle fiber contraction, cortisol (adrenal glands, immune/memory effects), vagus nerve (longest nerve, parasympathetic channel). Rewrote skill practice with physiological explanations. Added heart rate measurement, 4-7-8 breathing, and biofeedback for 3-4+."
  },
  "physical/relay-races-and-team-challenges.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No muscle names, no cardiovascular physiology, no physics of acceleration. Coaching cues were purely motivational with no science.",
    "fixed": "Added full vocabulary section: acceleration (Newton's Third Law, quadriceps/gluteus push), anaerobic exercise (glucose without oxygen, lactic acid byproduct), quadriceps/hamstrings (antagonist pair, 5 contractions per second during sprinting), cardiovascular system (heart rate 80→180 bpm, stroke volume, vessel dilation). Rewrote warm-up, coaching, and cool-down with muscle names, Newton's laws, and cardiovascular physiology."
  },
  "physical/rhythmic-gymnastics-with-props.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Described activity as generic scarf play without explaining that rhythmic gymnastics is an Olympic sport; no physics content (momentum, air resistance); no motor development terminology (proprioception, bilateral coordination); coaching language was purely aesthetic with no technical concepts",
    "fixed": "Added summary explaining rhythmic gymnastics as an Olympic sport with five apparatus; introduced momentum, air resistance, proprioception, bilateral coordination; updated coaching cues to include physics and body-awareness concepts; framed free exploration as physics discovery"
  },
  "physical/rock-climbing-and-bouldering.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. Good technique advice (\"push from legs, not arms\") but never explained WHY — no physics of center of gravity, no friction science, no muscle anatomy. Coaching was motivational rather than educational.",
    "fixed": "Added full vocabulary section: center of gravity (keeping weight over feet on holds), friction (skin-to-hold contact, chalk absorbs sweat, rubber shoe coefficient), forearm flexors (flexor digitorum profundus/superficialis — primary climbing muscles), lactic acid (anaerobic byproduct causing \"pump,\" cleared by blood flow during rest). Rewrote coaching cues with physics explanations for hip position, friction maximization, leg vs. arm muscle size comparison, and three-point-of-contact stability."
  },
  "physical/rugby-and-contact-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Lesson never explained what rugby actually is — its origin, distinctive backward-pass rule, scoring (try), or how it differs from other sports; no physiology content about cardiovascular response to exercise",
    "fixed": "Added rugby history, the lateral/backward pass rule, try scoring; introduced cardiovascular system, heart rate, lactic acid in coaching cues; rewrote introduction to teach the actual sport rules while adapting for toddler safety"
  },
  "physical/sailing-and-wind-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Summary claimed \"developing understanding of wind and physics\" but never delivered any physics. No lift, drag, pressure differential, Bernoulli, or points of sail (running/reaching/beating). \"See how the sail fills with wind? That's what makes the boat go\" with no explanation of why.",
    "fixed": "Expanded summary to explain: wind as moving air molecules creating pressure, drag (wind pushing against surface) vs. lift (pressure differential from curved sail — same principle as airplane wings), and points of sail (running/reaching/beating). Updated introduction and coaching cues with lift/drag explanations. Updated sailboat coaching to name \"reaching\" and explain the curved sail as a wing generating lift."
  },
  "physical/self-defense-and-protection-skills.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. Physical skill content was nearly absent — almost entirely about body autonomy and saying \"no\" with no actual physical protection techniques. No wrist release technique, no distance-creation principle, no target-denial behavior concept.",
    "fixed": "Added vocabulary section with body autonomy, assertive, distance/personal space, wrist release, de-escalation, target-denial behavior. Rewrote skill practice to include four concrete skills: (1) voice — practicing a loud assertive \"NO,\" (2) creating distance — run toward safety, (3) wrist release — pull toward the thumb, the weakest point of any grip, (4) trusted adults network. Updated age adaptations with concrete focus for each age group."
  },
  "physical/sensory-integration-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Used terms \"vestibular\" and \"proprioceptive\" but never explained mechanisms. No neuroscience of how sensory systems actually work (semicircular canals, otolith organs, mechanoreceptors, corpus callosum). Coaching cues were motivational with no science. Sensory defensiveness challenge lacked neurological framing.",
    "fixed": "Added neuroscience of sensory integration (semicircular canals, otolith organs, mechanoreceptors, myelination) to summary. Rewrote introduction to name vestibular, proprioceptive, and tactile systems with actual mechanisms. Updated skill breakdown with real physiology (muscle spindles, Golgi tendon organs, corpus callosum for bilateral coordination). Rewrote coaching cues with sensory integration terminology. Updated tactile defensiveness challenge to explain neurological thresholds and recommend OT evaluation. Updated balance challenge to mention cerebellar maturation."
  },
  "physical/skateboarding-and-balance-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. Mentioned \"proprioceptive awareness\" in summary but never explained it. No vestibular system, no center of gravity physics, no ankle/hip strategy distinction, no muscle anatomy. Coaching cues were generic (\"bendy like springs\").",
    "fixed": "Added full vocabulary section: vestibular system (semicircular canals, otoliths, 500 updates/sec), proprioception (muscle spindles, Golgi tendon organs, cerebellum), center of gravity (base of support physics), ankle strategy vs. hip strategy (tibialis anterior/gastrocnemius vs. gluteus medius/obliques). Rewrote coaching cues with specific muscles, moment of inertia, and neural pathway science."
  },
  "physical/skiing-and-snow-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Good practical/safety content but zero physics or science explanation — mentions 'discuss gravity' in extensions without any content to share. No explanation of why pizza position works, what snow is made of, or how the body handles cold.",
    "fixed": "Added Key Concepts section: gravity on slopes, friction and speed control (why pizza position works), center of gravity and knee-bending physics, snow crystal science, thermoregulation/frostbite; integrated physics language into introduction; expanded extension science activities with actual content"
  },
  "physical/skiing-downhill-and-cross-country.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Coaching cues gave only procedural instructions with no physics explanation (\"Stand tall like a tree trunk!\" vs. explaining center of gravity; \"Make a pizza!\" vs. explaining friction and momentum diversion). Despite the title, cross-country skiing was entirely absent — the lesson only covered downhill.",
    "fixed": "Rewrote coaching cues to explain why techniques work (wedge creates friction in two directions; bent knees lower center of gravity; leaning forward keeps ski tips down for control). Added cross-country skiing section explaining the fundamentally different mechanics (stride-and-glide, poles for propulsion, diagonal pattern, kick-zone grip vs. glide), including Newton's Third Law explanation for the kick."
  },
  "physical/sledding-and-snow-sliding.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Good safety and logistics but no physics content—gravity, friction, momentum, center of gravity all absent",
    "fixed": "Added gravity/friction/momentum explanations integrated into instruction cues; added body-science to cool-down (oxygen demand, visible breath/condensation)"
  },
  "physical/snorkeling-and-underwater-exploration.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No marine science content. Children told to look for fish and coral with no explanation of what these are, what coral reefs are ecologically, or any physics of light underwater or snorkel mechanics.",
    "fixed": "Added Key Concepts section covering coral reef ecology (polyps, calcium carbonate, bleaching), marine organism categories (vertebrates/invertebrates/echinoderms), light absorption at depth, snorkel physics, and reef food web including parrotfish sand production. Wove concepts into coaching cues."
  },
  "physical/snow-fort-building-and-winter-construction.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No science content. Entirely procedural — scoop here, pack there. No explanation of what snow is, why it packs, or why structures collapse. Snow insulation and igloo connection completely absent.",
    "fixed": "Added Key Concepts section covering ice crystals and snow structure, sintering (why snow compacts), snow as insulator and the igloo/Inuit engineering connection, structural engineering (arches/domes vs flat walls), and states of water. Wove concepts into introduction and challenge solutions."
  },
  "physical/snowboarding-and-board-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Good technique and safety content but no physics or science explanation. No explanation of edge control mechanics, why sideways stance works, body rotation physics, or why wrists break in falls.",
    "fixed": "Added Key Concepts section: edge control (heel vs. toe edge), why snowboarders face sideways, body rotation and turning physics, center of gravity and balance, wrist fracture mechanics (why hands-out instinct is dangerous), snow conditions and friction; integrated edge control explanation into introduction"
  },
  "physical/snowshoeing-and-winter-hiking.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section; no anatomy or physiology; no muscle names anywhere; no physics of snowshoes (flotation, pressure distribution, surface area); no explanation of thermoregulation, UV reflection, or wind chill despite all being directly relevant; coaching cues were purely motivational metaphors with zero technical content.",
    "fixed": "Added full vocabulary section: flotation/pressure/traction (snowshoe physics), quadriceps/hip flexors/tibialis anterior/core muscles, vestibular system/proprioception, thermoregulation/UV radiation/wind chill. Rewrote warm-up cues to explain which muscles are activating and why. Added snowshoe flotation physics with crampons named; added physics of snow crystal structure."
  },
  "physical/soccer-and-football.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section, no muscle names, no anatomy, no physiology. Coaching cues were purely procedural (\"use the inside of your foot,\" \"stand on one strong leg\") with no biomechanical explanation. No mention of kicking lever, center of percussion, foot dominance/laterality, proprioception, or momentum.",
    "fixed": "Added full vocabulary section: quadriceps (four individual muscles), iliopsoas (hip flexors), gluteus medius (single-leg balance stabilizer), gastrocnemius, tibialis anterior; kicking lever (fulcrum at hip), center of percussion (instep vs inside of foot), foot dominance and laterality, proprioception, momentum/force transfer. Rewrote warm-up and coaching cues with muscle names."
  },
  "physical/spatial-awareness-and-body-mapping.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Lesson was Simon Says with body parts — no neuroscience explaining why the body knows where it is; \"proprioception,\" \"vestibular,\" \"somatosensory cortex,\" and \"kinesthesia\" all absent; 2-3 adaptation explicitly said \"avoid complex anatomical terms\" (wrong approach)",
    "fixed": "Added vocabulary section: proprioception, vestibular system, somatosensory cortex, kinesthesia, bilateral coordination; updated intro to explain the brain's body map; added proprioception challenge (eyes-closed body-part location); added vestibular demonstration (post-spin dizziness); added reflex demo for 3-4+ adaptation; fixed 2-3 adaptation to embrace real vocabulary"
  },
  "physical/stage-movement-and-blocking.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No proprioception science, no proxemics (Hall's four zones), no center of gravity physics, no anatomy of core muscles, no theater history. Coaching cues were generic with no science or technical theater content.",
    "fixed": "Added full vocabulary section: blocking (history and notation), proprioception (muscle/tendon/joint receptors, sixth sense), proxemics (Edward T. Hall's four zones — intimate/personal/social/public, how stage blocking manipulates emotional meaning), center of gravity (performer stability physics), proscenium (historical raked stage etymology of \"upstage/downstage\"), core muscles (transverse abdominis, rectus abdominis, obliques, erector spinae), kinesthetic awareness (conscious proprioception in trained performers). Added stage labeling to setup."
  },
  "physical/strength-activities-and-resistance-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No anatomy, physiology, or physics content. Entirely procedural: push this, pull that. No explanation of how muscles work, which muscles are engaged, or the physics of resistance.",
    "fixed": "Added Key Concepts section covering muscle fiber adaptation, proprioception, isometric vs isotonic contraction, resistance as force, and named muscle groups (quadriceps, glutes, biceps). Wove muscle names and physiological explanations into coaching cues."
  },
  "physical/stretching-and-flexibility-exercises.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No muscle names, no anatomy, no physiology. \"Feel how your muscles are getting longer\" without naming any muscle. Previous physical lessons that passed used terms like \"bilateral coordination\" and \"explosive power.\"",
    "fixed": "Added muscle names to every stretch: hamstrings, quadriceps, deltoids, gastrocnemius, obliques, abdominals, adductors. Added tendon and muscle fiber concepts. Rewrote animal stretches to name specific muscles. Added antagonist muscle pairs and blood flow physiology for 3-4+."
  },
  "physical/surfing-and-wave-riding.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No wave physics (energy transfer, orbital motion, breaking), no buoyancy (Archimedes' principle), no drag, no muscle anatomy. Coaching cues were generic imagery (\"hold the board like a teddy bear\") with no science.",
    "fixed": "Added full vocabulary section: wave (energy transfer through water, orbital motion, breaking in shallow water), buoyancy (Archimedes' principle, density, breathing affects buoyancy), drag (800x denser than air, speed-squared relationship, streamlining), core muscles (transverse abdominis, rectus abdominis, obliques, erector spinae). Rewrote warm-up with pop-up practice and muscle naming (latissimus dorsi, deltoids, pectorals). Rewrote coaching cues with Newton's Third Law paddling, center of gravity balance, and wave energy transfer. Added thermoregulation in cool-down."
  },
  "physical/surfing-and-wave-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No ocean science whatsoever. No wave physics, no buoyancy, no explanation of what a wave is or why a board floats. Coaching cues were procedural (\"paddle like you're swimming\") with no physics. A surfing lesson without wave physics is a major missed opportunity.",
    "fixed": "Rewrote summary with wave physics (energy not water moving, orbital motion, wind generation thousands of miles away) and buoyancy (Archimedes' principle, upward force on less-dense objects). Updated introduction to include a wave-energy demonstration (hand ripple in water). Updated skill practice to name buoyancy during board float and wave energy during each swell. Updated coaching cues to include \"that's buoyancy\" and \"energy from far away reaching us right now.\""
  },
  "physical/survival-skills-and-wilderness-play.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No muscle names, anatomy, or physiology anywhere. Coaching cues were purely behavioral (\"step carefully,\" \"look closely\") with zero anatomical or biomechanical content. Survival/nature content used no real scientific terms — no ecology vocabulary, no physiology of balance.",
    "fixed": "Added full vocabulary section: proprioception, stabilizer muscles (tibialis anterior, peroneals), gluteus medius, vestibular system (semicircular canals), thermoregulation, cortisol/adrenaline, ecosystem, decomposer, habitat, camouflage, photosynthesis, foraging, tracking. Rewrote coaching cues to name ankle stabilizer muscles, vestibular system, and ecological facts (decomposers in logs, bark anatomy, moss as compass)."
  },
  "physical/swimming-and-water-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No physics of water — no buoyancy, no drag, no propulsion explanation. Activity was \"kick and float\" with purely procedural coaching and no science content.",
    "fixed": "Added full vocabulary section: buoyancy (Archimedes' principle, lung inflation changes density), drag (water 800x denser than air, increases with speed squared and surface area), propulsion (Newton's Third Law — push water backward, water pushes you forward), thermoregulation (water conducts heat 25x faster than air, children's surface-area-to-mass ratio). Rewrote coaching cues to explain buoyancy through breathing, drag through streamlining, and propulsion through kick mechanics."
  },
  "physical/swimming-techniques-and-strokes.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Comprehensive on technique and safety but zero physics or science content. No explanation of buoyancy (Archimedes' principle), Newton's Third Law and propulsion, drag and streamlining, why hip-driven kicks are more powerful, or saltwater vs. freshwater density.",
    "fixed": "Added Key Concepts section: buoyancy (Archimedes' principle), saltwater vs. freshwater density (Dead Sea example), Newton's Third Law and propulsion, drag and streamlining, hip-driven kick mechanics, breath control and its effect on buoyancy; integrated physics explanations into introduction demonstration"
  },
  "physical/synchronized-movement-activities.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section. Mentioned \"mirror neuron development\" in summary but never explained the concept in the activity. No neuroscience of synchronization (oxytocin release, entrainment), no anatomy.",
    "fixed": "Added full vocabulary section: mirror neurons (Rizzolatti discovery, premotor cortex, observation-action coupling), entrainment (automatic rhythm synchronization, nearly unique to humans), oxytocin (bonding hormone released during synchronized movement, measurable cooperation increase), temporal cortex (timing and rhythm processing). Rewrote coaching cues with muscle names and neuroscience explanations."
  },
  "physical/taekwondo-and-kicking-arts.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section; introduction said only \"Taekwondo is a Korean martial art\"; no etymology of the name, no philosophy, no biomechanics beyond vague \"power comes from hips and core\"; no explanation of chamber, kinetic chain, or stance",
    "fixed": "Added vocabulary section with taekwondo (tae/kwon/do etymology), kinetic chain, proprioception, momentum, chamber, stance; rewrote introduction to teach the name's meaning and explain kinetic chain during demonstration; upgraded coaching cues to use all vocabulary; rewrote 2-3 adaptation to teach proprioception tangibly"
  },
  "physical/tai-chi-and-flowing-movements.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No anatomy, no physics of balance, no history of tai chi (400+ years). \"Move slowly\" without explaining why slow movement is neurologically harder. Coaching cues were generic imagery with no science.",
    "fixed": "Added full vocabulary section: slow-twitch muscle fibers (Type I, aerobic metabolism, endurance), proprioception (muscle spindles, Golgi tendon organs, cerebellum feedback), center of gravity (balance physics, wide stance stability), tai chi history (Chen Wangting 1600s, five family styles, yin-yang philosophy). Rewrote coaching cues with muscle names (deltoids, quadriceps, gluteus maximus) and proprioception awareness."
  },
  "physical/track-and-field-running-jumping-throwing.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No physics or physiology; running/jumping/throwing described only as motor patterns with no biomechanical explanation",
    "fixed": "Added Newton's 3rd law/ground reaction force for running, stretch-shortening cycle for jumping, kinetic chain for throwing, projectile motion, fast-twitch vs slow-twitch fibers, aerobic vs anaerobic respiration, lactic acid"
  },
  "physical/volleyball-and-net-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section, no muscle names, no anatomy, no physiology. Warm-up mentioned \"windmill arms\" without naming deltoids or rotator cuff. No explanation of visual tracking, hand-eye coordination neural circuit, reaction time, projectile motion/parabola, or cardiovascular response.",
    "fixed": "Added full vocabulary section: deltoids (anterior/lateral/posterior), triceps brachii, pectoralis major, serratus anterior, core stabilizers; visual tracking (smooth pursuit), hand-eye coordination, reaction time (150-200ms, myelination), projectile motion (parabola, gravity), momentum transfer, cardiovascular response. Rewrote warm-up and coaching cues with anatomy and physics."
  },
  "physical/water-polo-and-pool-games.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No physics of water at all despite being an aquatic activity. \"This is our water polo ball — it floats!\" with no explanation of why. No buoyancy, no water density, no resistance. Real water polo's history and rules not mentioned.",
    "fixed": "Added buoyancy (Archimedes' principle, dense vs. less-dense objects), water density (800x denser than air as explanation for why water is harder to move through), lung buoyancy as a real experiment children can try. Rewrote introduction to explain: pop-up ball demonstrates upward buoyancy force, water resistance while walking, real water polo history (Olympic since 1900, treading water, no standing allowed). Updated skill breakdown and coaching cues with buoyancy and resistance language."
  },
  "physical/water-safety-and-rescue-practice.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary/concepts section. \"Water is fun and also needs our respect\" — vague platitude with no physics or biology. Floating described as \"the water is holding you!\" without explaining buoyancy. Silent drowning mentioned without explaining the physiological mechanism (involuntary throat closure).",
    "fixed": "Added Key Concepts section with buoyancy (Archimedes' principle, relaxed body floats better), density (human near water's density, lung inflation changes it), aspiration (water in airways blocks gas exchange), involuntary response (why drowning is silent — throat closes automatically). Rewrote introduction to explain buoyancy with a dropped object demonstration and why water in the lungs is dangerous. Added breathing experiment during floating to feel buoyancy change. Updated constant-supervision safety reminder with physiological explanation of silent drowning."
  },
  "physical/water-skiing-and-towing-sports.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary/concepts section. No physics of water skiing — no hydrodynamic lift, no planing, no drag, no center of gravity, no tension/force transfer. Coaching cues said \"make yourself like a tree\" and \"the rope will help you up!\" with no explanation of the physical mechanisms.",
    "fixed": "Added Key Concepts section with planing (hydrodynamic lift at sufficient speed, angled surface physics), drag (800x denser than air, why skis minimize drag), center of gravity (must stay over skis to avoid falling), and tension/force transfer (how boat energy reaches skier). Rewrote introduction to explain planing before the child enters water. Updated coaching cues with center of gravity language and lift explanation during speed-up."
  },
  "physical/wrestling-and-grappling.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. Good technique content but no physics framework. No leverage, center of gravity, Newton's Third Law, or biomechanics.",
    "fixed": "Added full vocabulary section: leverage (Archimedes, force multiplication at fulcrum distance), center of gravity (lower = more stable, wide stance), Newton's Third Law (equal/opposite reaction, redirecting opponent's force), biomechanics (600+ muscles, 206 bones, joint types). Rewrote introduction with center-of-gravity stability demonstration and Newton's Third Law redirection."
  },
  "physical/wrestling-and-takedowns.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "Safety framework was solid but the physics was absent. No explanation of WHY the wrestling stance works (center of gravity, base of support). Leverage never explained as a physical principle. No historical context. Coaching cues were generic (\"get low and balanced\") with no underlying science.",
    "fixed": "Added wrestling's ancient history (ancient Egypt and Greece, 3,000+ years). Enriched introduction to explain center of gravity and base of support physics — with demonstration (narrow stance vs. wrestling stance push test). Added leverage as named concept (\"technique beats muscle\") to introduction. Updated skill breakdown with center of gravity and base of support definitions. Rewrote coaching cues and game variations to include physics language throughout."
  },
  "physical/yoga-and-mindful-movement.md": {
    "verdict": "FAIL -> FIXED",
    "issues": "No vocabulary section at all. No anatomy or physiology. \"Feel your feet on the ground\" without naming proprioception. \"Calm your nervous system\" without explaining how. Coaching cues were generic encouragement with no science.",
    "fixed": "Added full vocabulary section: proprioception (muscle/tendon/joint sensors sending position data to cerebellum), fascia (connective tissue web with more sensory endings than muscle, hydration through stretching), parasympathetic nervous system (vagus nerve pathway, cortisol reduction mechanism), isometric contraction (force without length change — yoga hold mechanics). Rewrote coaching cues with specific muscle names (quadriceps, erector spinae, rectus abdominis) and physiological explanations. Added vestibular system, antagonist pairs, and pulse-based parasympathetic measurement for 3-4+."
  }
}
